espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
/***************************************************************************//**
 * @brief SL_BT_API library at application layer provided as source code
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#ifndef SLI_BT_API_H
#define SLI_BT_API_H
#define VERSION no_link_tables

#include "sl_btmesh_api.h"

#ifdef __cplusplus
extern "C" {
#endif

enum sli_btmesh_class_id
{
    sli_btmesh_node_class_id = 0x14,
    sli_btmesh_prov_class_id = 0x15,
    sli_btmesh_proxy_class_id = 0x18,
    sli_btmesh_vendor_model_class_id = 0x19,
    sli_btmesh_health_client_class_id = 0x1a,
    sli_btmesh_health_server_class_id = 0x1b,
    sli_btmesh_generic_client_class_id = 0x1e,
    sli_btmesh_generic_server_class_id = 0x1f,
    sli_btmesh_test_class_id = 0x22,
    sli_btmesh_lpn_class_id = 0x23,
    sli_btmesh_friend_class_id = 0x24,
    sli_btmesh_proxy_client_class_id = 0x25,
    sli_btmesh_proxy_server_class_id = 0x26,
    sli_btmesh_config_client_class_id = 0x27,
    sli_btmesh_sensor_server_class_id = 0x47,
    sli_btmesh_sensor_setup_server_class_id = 0x48,
    sli_btmesh_sensor_client_class_id = 0x49,
    sli_btmesh_lc_client_class_id = 0x4C,
    sli_btmesh_lc_server_class_id = 0x4D,
    sli_btmesh_lc_setup_server_class_id = 0x4E,
    sli_btmesh_scene_client_class_id = 0x4F,
    sli_btmesh_scene_server_class_id = 0x50,
    sli_btmesh_scene_setup_server_class_id = 0x51,
    sli_btmesh_scheduler_client_class_id = 0x54,
    sli_btmesh_scheduler_server_class_id = 0x55,
    sli_btmesh_time_server_class_id = 0x52,
    sli_btmesh_time_client_class_id = 0x53,
    sli_btmesh_migration_class_id = 0x60,
};

enum sli_btmesh_command_id
{
    sli_btmesh_node_init_command_id = 0x00,
    sli_btmesh_node_set_exportable_keys_command_id = 0x24,
    sli_btmesh_node_start_unprov_beaconing_command_id = 0x01,
    sli_btmesh_node_stop_unprov_beaconing_command_id = 0x16,
    sli_btmesh_node_get_rssi_command_id = 0x17,
    sli_btmesh_node_send_input_oob_request_response_command_id = 0x02,
    sli_btmesh_node_get_uuid_command_id = 0x03,
    sli_btmesh_node_set_provisioning_data_command_id = 0x04,
    sli_btmesh_node_init_oob_command_id = 0x05,
    sli_btmesh_node_set_ivrecovery_mode_command_id = 0x06,
    sli_btmesh_node_get_ivrecovery_mode_command_id = 0x07,
    sli_btmesh_node_get_statistics_command_id = 0x09,
    sli_btmesh_node_clear_statistics_command_id = 0x0a,
    sli_btmesh_node_set_net_relay_delay_command_id = 0x0b,
    sli_btmesh_node_get_net_relay_delay_command_id = 0x0c,
    sli_btmesh_node_get_ivupdate_state_command_id = 0x0d,
    sli_btmesh_node_request_ivupdate_command_id = 0x0e,
    sli_btmesh_node_get_seq_remaining_command_id = 0x0f,
    sli_btmesh_node_save_replay_protection_list_command_id = 0x10,
    sli_btmesh_node_set_uuid_command_id = 0x11,
    sli_btmesh_node_get_replay_protection_list_status_command_id = 0x14,
    sli_btmesh_node_get_element_address_command_id = 0x12,
    sli_btmesh_node_send_static_oob_request_response_command_id = 0x13,
    sli_btmesh_node_reset_command_id = 0x15,
    sli_btmesh_node_set_beacon_reporting_command_id = 0x18,
    sli_btmesh_node_set_iv_update_age_command_id = 0x19,
    sli_btmesh_node_get_key_count_command_id = 0x1a,
    sli_btmesh_node_get_key_command_id = 0x1b,
    sli_btmesh_node_get_networks_command_id = 0x1c,
    sli_btmesh_node_get_element_seqnum_command_id = 0x1d,
    sli_btmesh_node_set_model_option_command_id = 0x1e,
    sli_btmesh_node_get_local_dcd_command_id = 0x1f,
    sli_btmesh_node_power_off_command_id = 0x21,
    sli_btmesh_node_set_adv_phy_command_id = 0x22,
    sli_btmesh_node_get_adv_phy_command_id = 0x23,
    sli_btmesh_node_set_unprov_beaconing_adv_interval_command_id = 0x28,
    sli_btmesh_node_set_proxy_service_adv_interval_command_id = 0x29,
    sli_btmesh_node_set_provisioning_service_adv_interval_command_id = 0x30,
    sli_btmesh_prov_init_command_id = 0x00,
    sli_btmesh_prov_scan_unprov_beacons_command_id = 0x01,
    sli_btmesh_prov_create_provisioning_session_command_id = 0x41,
    sli_btmesh_prov_set_provisioning_suspend_event_command_id = 0x42,
    sli_btmesh_prov_provision_adv_device_command_id = 0x43,
    sli_btmesh_prov_provision_gatt_device_command_id = 0x44,
    sli_btmesh_prov_continue_provisioning_command_id = 0x45,
    sli_btmesh_prov_abort_provisioning_command_id = 0x47,
    sli_btmesh_prov_set_device_address_command_id = 0x46,
    sli_btmesh_prov_create_network_command_id = 0x03,
    sli_btmesh_prov_create_appkey_command_id = 0x07,
    sli_btmesh_prov_send_oob_pkey_response_command_id = 0x08,
    sli_btmesh_prov_send_oob_auth_response_command_id = 0x09,
    sli_btmesh_prov_set_oob_requirements_command_id = 0x0a,
    sli_btmesh_prov_start_key_refresh_command_id = 0x0b,
    sli_btmesh_prov_get_key_refresh_exclusion_command_id = 0x0c,
    sli_btmesh_prov_set_key_refresh_exclusion_command_id = 0x0d,
    sli_btmesh_prov_get_ddb_entry_command_id = 0x16,
    sli_btmesh_prov_delete_ddb_entry_command_id = 0x17,
    sli_btmesh_prov_add_ddb_entry_command_id = 0x18,
    sli_btmesh_prov_list_ddb_entries_command_id = 0x19,
    sli_btmesh_prov_initialize_network_command_id = 0x37,
    sli_btmesh_prov_get_key_refresh_appkey_exclusion_command_id = 0x38,
    sli_btmesh_prov_set_key_refresh_appkey_exclusion_command_id = 0x39,
    sli_btmesh_prov_stop_scan_unprov_beacons_command_id = 0x3A,
    sli_btmesh_prov_update_device_netkey_index_command_id = 0x3b,
    sli_btmesh_prov_suspend_key_refresh_command_id = 0x3c,
    sli_btmesh_prov_resume_key_refresh_command_id = 0x3d,
    sli_btmesh_prov_get_key_refresh_phase_command_id = 0x3e,
    sli_btmesh_prov_start_key_refresh_from_phase_command_id = 0x3f,
    sli_btmesh_prov_flush_key_refresh_state_command_id = 0x40,
    sli_btmesh_prov_test_identity_command_id = 0x48,
    sli_btmesh_proxy_connect_command_id = 0x00,
    sli_btmesh_proxy_disconnect_command_id = 0x01,
    sli_btmesh_proxy_set_filter_type_command_id = 0x02,
    sli_btmesh_proxy_allow_command_id = 0x03,
    sli_btmesh_proxy_deny_command_id = 0x04,
    sli_btmesh_proxy_optimisation_toggle_command_id = 0x05,
    sli_btmesh_vendor_model_send_command_id = 0x00,
    sli_btmesh_vendor_model_set_publication_command_id = 0x01,
    sli_btmesh_vendor_model_clear_publication_command_id = 0x02,
    sli_btmesh_vendor_model_publish_command_id = 0x03,
    sli_btmesh_vendor_model_init_command_id = 0x04,
    sli_btmesh_vendor_model_deinit_command_id = 0x05,
    sli_btmesh_vendor_model_send_tracked_command_id = 0x06,
    sli_btmesh_vendor_model_set_publication_tracked_command_id = 0x07,
    sli_btmesh_health_client_get_command_id = 0x00,
    sli_btmesh_health_client_clear_command_id = 0x01,
    sli_btmesh_health_client_test_command_id = 0x02,
    sli_btmesh_health_client_get_period_command_id = 0x03,
    sli_btmesh_health_client_set_period_command_id = 0x04,
    sli_btmesh_health_client_get_attention_command_id = 0x05,
    sli_btmesh_health_client_set_attention_command_id = 0x06,
    sli_btmesh_health_server_set_fault_command_id = 0x00,
    sli_btmesh_health_server_clear_fault_command_id = 0x01,
    sli_btmesh_health_server_send_test_response_command_id = 0x02,
    sli_btmesh_generic_client_get_command_id = 0x00,
    sli_btmesh_generic_client_set_command_id = 0x01,
    sli_btmesh_generic_client_publish_command_id = 0x02,
    sli_btmesh_generic_client_get_params_command_id = 0x03,
    sli_btmesh_generic_client_init_command_id = 0x04,
    sli_btmesh_generic_client_init_common_command_id = 0x05,
    sli_btmesh_generic_client_init_on_off_command_id = 0x06,
    sli_btmesh_generic_client_init_level_command_id = 0x07,
    sli_btmesh_generic_client_init_default_transition_time_command_id = 0x08,
    sli_btmesh_generic_client_init_power_on_off_command_id = 0x09,
    sli_btmesh_generic_client_init_power_level_command_id = 0x0a,
    sli_btmesh_generic_client_init_battery_command_id = 0x0b,
    sli_btmesh_generic_client_init_location_command_id = 0x0c,
    sli_btmesh_generic_client_init_property_command_id = 0x0d,
    sli_btmesh_generic_client_init_lightness_command_id = 0x0e,
    sli_btmesh_generic_client_init_ctl_command_id = 0x0f,
    sli_btmesh_generic_client_init_hsl_command_id = 0x10,
    sli_btmesh_generic_server_respond_command_id = 0x00,
    sli_btmesh_generic_server_update_command_id = 0x01,
    sli_btmesh_generic_server_publish_command_id = 0x02,
    sli_btmesh_generic_server_init_command_id = 0x04,
    sli_btmesh_generic_server_init_common_command_id = 0x05,
    sli_btmesh_generic_server_init_on_off_command_id = 0x06,
    sli_btmesh_generic_server_init_level_command_id = 0x07,
    sli_btmesh_generic_server_init_default_transition_time_command_id = 0x08,
    sli_btmesh_generic_server_init_power_on_off_command_id = 0x09,
    sli_btmesh_generic_server_init_power_level_command_id = 0x0a,
    sli_btmesh_generic_server_init_battery_command_id = 0x0b,
    sli_btmesh_generic_server_init_location_command_id = 0x0c,
    sli_btmesh_generic_server_init_property_command_id = 0x0d,
    sli_btmesh_generic_server_init_lightness_command_id = 0x0e,
    sli_btmesh_generic_server_init_ctl_command_id = 0x0f,
    sli_btmesh_generic_server_init_hsl_command_id = 0x10,
    sli_btmesh_generic_server_get_cached_state_command_id = 0x11,
    sli_btmesh_test_get_nettx_command_id = 0x00,
    sli_btmesh_test_set_nettx_command_id = 0x01,
    sli_btmesh_test_get_relay_command_id = 0x02,
    sli_btmesh_test_set_relay_command_id = 0x03,
    sli_btmesh_test_set_adv_scan_params_command_id = 0x4,
    sli_btmesh_test_set_ivupdate_test_mode_command_id = 0x05,
    sli_btmesh_test_get_ivupdate_test_mode_command_id = 0x06,
    sli_btmesh_test_set_segment_send_delay_command_id = 0x07,
    sli_btmesh_test_set_ivupdate_state_command_id = 0x08,
    sli_btmesh_test_send_beacons_command_id = 0x09,
    sli_btmesh_test_bind_local_model_app_command_id = 0x0a,
    sli_btmesh_test_unbind_local_model_app_command_id = 0x0b,
    sli_btmesh_test_add_local_model_sub_command_id = 0x0c,
    sli_btmesh_test_remove_local_model_sub_command_id = 0x0d,
    sli_btmesh_test_add_local_model_sub_va_command_id = 0x0e,
    sli_btmesh_test_remove_local_model_sub_va_command_id = 0x0f,
    sli_btmesh_test_get_local_model_sub_command_id = 0x10,
    sli_btmesh_test_set_local_model_pub_command_id = 0x11,
    sli_btmesh_test_set_local_model_pub_va_command_id = 0x12,
    sli_btmesh_test_get_local_model_pub_command_id = 0x13,
    sli_btmesh_test_set_local_heartbeat_subscription_command_id = 0x14,
    sli_btmesh_test_get_local_heartbeat_subscription_command_id = 0x15,
    sli_btmesh_test_get_local_heartbeat_publication_command_id = 0x16,
    sli_btmesh_test_set_local_heartbeat_publication_command_id = 0x17,
    sli_btmesh_test_set_local_config_command_id = 0x18,
    sli_btmesh_test_get_local_config_command_id = 0x19,
    sli_btmesh_test_add_local_key_command_id = 0x1a,
    sli_btmesh_test_remove_local_key_command_id = 0x1b,
    sli_btmesh_test_update_local_key_command_id = 0x1c,
    sli_btmesh_test_set_sar_config_command_id = 0x1d,
    sli_btmesh_test_set_adv_bearer_state_command_id = 0x1f,
    sli_btmesh_test_prov_get_device_key_command_id = 0x23,
    sli_btmesh_test_prov_prepare_key_refresh_command_id = 0x24,
    sli_btmesh_test_cancel_segmented_tx_command_id = 0x25,
    sli_btmesh_test_set_iv_index_command_id = 0x26,
    sli_btmesh_test_set_element_seqnum_command_id = 0x27,
    sli_btmesh_test_set_model_option_command_id = 0x28,
    sli_btmesh_test_get_local_model_app_bindings_command_id = 0x29,
    sli_btmesh_test_get_replay_protection_list_entry_command_id = 0x2a,
    sli_btmesh_test_clear_replay_protection_list_entry_command_id = 0x2b,
    sli_btmesh_test_set_replay_protection_list_diagnostics_command_id = 0x2c,
    sli_btmesh_test_get_model_option_command_id = 0x2d,
    sli_btmesh_test_get_default_ttl_command_id = 0x2e,
    sli_btmesh_test_set_default_ttl_command_id = 0x2f,
    sli_btmesh_test_get_gatt_proxy_command_id = 0x30,
    sli_btmesh_test_set_gatt_proxy_command_id = 0x31,
    sli_btmesh_test_get_identity_command_id = 0x32,
    sli_btmesh_test_set_identity_command_id = 0x33,
    sli_btmesh_test_get_friend_command_id = 0x34,
    sli_btmesh_test_set_friend_command_id = 0x35,
    sli_btmesh_test_get_beacon_command_id = 0x36,
    sli_btmesh_test_set_beacon_command_id = 0x37,
    sli_btmesh_lpn_init_command_id = 0x00,
    sli_btmesh_lpn_deinit_command_id = 0x01,
    sli_btmesh_lpn_establish_friendship_command_id = 0x03,
    sli_btmesh_lpn_poll_command_id = 0x04,
    sli_btmesh_lpn_terminate_friendship_command_id = 0x05,
    sli_btmesh_lpn_config_command_id = 0x06,
    sli_btmesh_friend_init_command_id = 0x00,
    sli_btmesh_friend_deinit_command_id = 0x01,
    sli_btmesh_config_client_cancel_request_command_id = 0x00,
    sli_btmesh_config_client_get_request_status_command_id = 0x01,
    sli_btmesh_config_client_get_default_timeout_command_id = 0x2e,
    sli_btmesh_config_client_set_default_timeout_command_id = 0x2f,
    sli_btmesh_config_client_add_netkey_command_id = 0x02,
    sli_btmesh_config_client_remove_netkey_command_id = 0x03,
    sli_btmesh_config_client_list_netkeys_command_id = 0x04,
    sli_btmesh_config_client_add_appkey_command_id = 0x05,
    sli_btmesh_config_client_remove_appkey_command_id = 0x06,
    sli_btmesh_config_client_list_appkeys_command_id = 0x07,
    sli_btmesh_config_client_bind_model_command_id = 0x08,
    sli_btmesh_config_client_unbind_model_command_id = 0x09,
    sli_btmesh_config_client_list_bindings_command_id = 0x0a,
    sli_btmesh_config_client_get_model_pub_command_id = 0x0b,
    sli_btmesh_config_client_set_model_pub_command_id = 0x0c,
    sli_btmesh_config_client_set_model_pub_va_command_id = 0x0d,
    sli_btmesh_config_client_add_model_sub_command_id = 0x0e,
    sli_btmesh_config_client_add_model_sub_va_command_id = 0x0f,
    sli_btmesh_config_client_remove_model_sub_command_id = 0x10,
    sli_btmesh_config_client_remove_model_sub_va_command_id = 0x11,
    sli_btmesh_config_client_set_model_sub_command_id = 0x12,
    sli_btmesh_config_client_set_model_sub_va_command_id = 0x13,
    sli_btmesh_config_client_clear_model_sub_command_id = 0x14,
    sli_btmesh_config_client_list_subs_command_id = 0x15,
    sli_btmesh_config_client_get_heartbeat_pub_command_id = 0x16,
    sli_btmesh_config_client_set_heartbeat_pub_command_id = 0x17,
    sli_btmesh_config_client_get_heartbeat_sub_command_id = 0x19,
    sli_btmesh_config_client_set_heartbeat_sub_command_id = 0x1a,
    sli_btmesh_config_client_get_beacon_command_id = 0x1b,
    sli_btmesh_config_client_set_beacon_command_id = 0x1c,
    sli_btmesh_config_client_get_default_ttl_command_id = 0x1d,
    sli_btmesh_config_client_set_default_ttl_command_id = 0x1e,
    sli_btmesh_config_client_get_gatt_proxy_command_id = 0x1f,
    sli_btmesh_config_client_set_gatt_proxy_command_id = 0x20,
    sli_btmesh_config_client_get_relay_command_id = 0x21,
    sli_btmesh_config_client_set_relay_command_id = 0x22,
    sli_btmesh_config_client_get_network_transmit_command_id = 0x23,
    sli_btmesh_config_client_set_network_transmit_command_id = 0x24,
    sli_btmesh_config_client_get_identity_command_id = 0x25,
    sli_btmesh_config_client_set_identity_command_id = 0x26,
    sli_btmesh_config_client_get_friend_command_id = 0x27,
    sli_btmesh_config_client_set_friend_command_id = 0x28,
    sli_btmesh_config_client_get_key_refresh_phase_command_id = 0x29,
    sli_btmesh_config_client_get_lpn_polltimeout_command_id = 0x2b,
    sli_btmesh_config_client_get_dcd_command_id = 0x2c,
    sli_btmesh_config_client_reset_node_command_id = 0x2d,
    sli_btmesh_sensor_server_init_command_id = 0x00,
    sli_btmesh_sensor_server_deinit_command_id = 0x01,
    sli_btmesh_sensor_server_send_descriptor_status_command_id = 0x02,
    sli_btmesh_sensor_server_send_status_command_id = 0x03,
    sli_btmesh_sensor_server_send_column_status_command_id = 0x04,
    sli_btmesh_sensor_server_send_series_status_command_id = 0x05,
    sli_btmesh_sensor_setup_server_send_cadence_status_command_id = 0x00,
    sli_btmesh_sensor_setup_server_send_settings_status_command_id = 0x01,
    sli_btmesh_sensor_setup_server_send_setting_status_command_id = 0x02,
    sli_btmesh_sensor_client_init_command_id = 0x00,
    sli_btmesh_sensor_client_deinit_command_id = 0x01,
    sli_btmesh_sensor_client_get_descriptor_command_id = 0x02,
    sli_btmesh_sensor_client_get_command_id = 0x03,
    sli_btmesh_sensor_client_get_column_command_id = 0x04,
    sli_btmesh_sensor_client_get_series_command_id = 0x05,
    sli_btmesh_sensor_client_get_cadence_command_id = 0x06,
    sli_btmesh_sensor_client_set_cadence_command_id = 0x07,
    sli_btmesh_sensor_client_get_settings_command_id = 0x08,
    sli_btmesh_sensor_client_get_setting_command_id = 0x09,
    sli_btmesh_sensor_client_set_setting_command_id = 0x0a,
    sli_btmesh_lc_client_init_command_id = 0x00,
    sli_btmesh_lc_client_get_mode_command_id = 0x01,
    sli_btmesh_lc_client_set_mode_command_id = 0x02,
    sli_btmesh_lc_client_get_om_command_id = 0x04,
    sli_btmesh_lc_client_set_om_command_id = 0x05,
    sli_btmesh_lc_client_get_light_onoff_command_id = 0x07,
    sli_btmesh_lc_client_set_light_onoff_command_id = 0x08,
    sli_btmesh_lc_client_get_property_command_id = 0x09,
    sli_btmesh_lc_client_set_property_command_id = 0x0a,
    sli_btmesh_lc_server_init_command_id = 0x00,
    sli_btmesh_lc_server_deinit_command_id = 0x01,
    sli_btmesh_lc_server_update_mode_command_id = 0x02,
    sli_btmesh_lc_server_update_om_command_id = 0x03,
    sli_btmesh_lc_server_update_light_onoff_command_id = 0x04,
    sli_btmesh_lc_server_init_all_properties_command_id = 0x05,
    sli_btmesh_lc_server_set_publish_mask_command_id = 0x06,
    sli_btmesh_lc_server_set_regulator_interval_command_id = 0x07,
    sli_btmesh_lc_server_set_event_mask_command_id = 0x08,
    sli_btmesh_lc_server_get_lc_state_command_id = 0x09,
    sli_btmesh_lc_setup_server_update_property_command_id = 0x00,
    sli_btmesh_scene_client_init_command_id = 0x00,
    sli_btmesh_scene_client_get_command_id = 0x01,
    sli_btmesh_scene_client_get_register_command_id = 0x02,
    sli_btmesh_scene_client_recall_command_id = 0x03,
    sli_btmesh_scene_client_store_command_id = 0x04,
    sli_btmesh_scene_client_delete_command_id = 0x05,
    sli_btmesh_scene_server_init_command_id = 0x00,
    sli_btmesh_scene_server_deinit_command_id = 0x01,
    sli_btmesh_scene_server_reset_register_command_id = 0x2,
    sli_btmesh_scene_server_enable_compact_recall_events_command_id = 0x3,
    sli_btmesh_scene_setup_server_init_command_id = 0x00,
    sli_btmesh_scheduler_client_init_command_id = 0x00,
    sli_btmesh_scheduler_client_deinit_command_id = 0x01,
    sli_btmesh_scheduler_client_get_command_id = 0x02,
    sli_btmesh_scheduler_client_get_action_command_id = 0x03,
    sli_btmesh_scheduler_client_set_action_command_id = 0x04,
    sli_btmesh_scheduler_server_init_command_id = 0x00,
    sli_btmesh_scheduler_server_deinit_command_id = 0x01,
    sli_btmesh_scheduler_server_get_command_id = 0x02,
    sli_btmesh_scheduler_server_get_action_command_id = 0x03,
    sli_btmesh_scheduler_server_set_action_command_id = 0x04,
    sli_btmesh_time_server_init_command_id = 0x00,
    sli_btmesh_time_server_deinit_command_id = 0x01,
    sli_btmesh_time_server_get_time_command_id = 0x02,
    sli_btmesh_time_server_set_time_command_id = 0x03,
    sli_btmesh_time_server_get_time_zone_offset_new_command_id = 0x04,
    sli_btmesh_time_server_set_time_zone_offset_new_command_id = 0x05,
    sli_btmesh_time_server_get_tai_utc_delta_new_command_id = 0x06,
    sli_btmesh_time_server_set_tai_utc_delta_new_command_id = 0x07,
    sli_btmesh_time_server_get_time_role_command_id = 0x08,
    sli_btmesh_time_server_set_time_role_command_id = 0x09,
    sli_btmesh_time_server_get_datetime_command_id = 0x0A,
    sli_btmesh_time_server_publish_command_id = 0x0B,
    sli_btmesh_time_server_status_command_id = 0x0C,
    sli_btmesh_time_client_init_command_id = 0x00,
    sli_btmesh_time_client_deinit_command_id = 0x01,
    sli_btmesh_time_client_get_time_command_id = 0x02,
    sli_btmesh_time_client_set_time_command_id = 0x03,
    sli_btmesh_time_client_get_time_zone_command_id = 0x04,
    sli_btmesh_time_client_set_time_zone_command_id = 0x05,
    sli_btmesh_time_client_get_tai_utc_delta_command_id = 0x06,
    sli_btmesh_time_client_set_tai_utc_delta_command_id = 0x07,
    sli_btmesh_time_client_get_time_role_command_id = 0x08,
    sli_btmesh_time_client_set_time_role_command_id = 0x09,
    sli_btmesh_migration_migrate_keys_command_id = 0x1,
    sli_btmesh_migration_migrate_ddb_command_id = 0x2,
};

