espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
enum sli_btmesh_response_id
{
    sli_btmesh_node_init_response_id = 0x00,
    sli_btmesh_node_set_exportable_keys_response_id = 0x24,
    sli_btmesh_node_start_unprov_beaconing_response_id = 0x01,
    sli_btmesh_node_stop_unprov_beaconing_response_id = 0x16,
    sli_btmesh_node_get_rssi_response_id = 0x17,
    sli_btmesh_node_send_input_oob_request_response_response_id = 0x02,
    sli_btmesh_node_get_uuid_response_id = 0x03,
    sli_btmesh_node_set_provisioning_data_response_id = 0x04,
    sli_btmesh_node_init_oob_response_id = 0x05,
    sli_btmesh_node_set_ivrecovery_mode_response_id = 0x06,
    sli_btmesh_node_get_ivrecovery_mode_response_id = 0x07,
    sli_btmesh_node_get_statistics_response_id = 0x09,
    sli_btmesh_node_clear_statistics_response_id = 0x0a,
    sli_btmesh_node_set_net_relay_delay_response_id = 0x0b,
    sli_btmesh_node_get_net_relay_delay_response_id = 0x0c,
    sli_btmesh_node_get_ivupdate_state_response_id = 0x0d,
    sli_btmesh_node_request_ivupdate_response_id = 0x0e,
    sli_btmesh_node_get_seq_remaining_response_id = 0x0f,
    sli_btmesh_node_save_replay_protection_list_response_id = 0x10,
    sli_btmesh_node_set_uuid_response_id = 0x11,
    sli_btmesh_node_get_replay_protection_list_status_response_id = 0x14,
    sli_btmesh_node_get_element_address_response_id = 0x12,
    sli_btmesh_node_send_static_oob_request_response_response_id = 0x13,
    sli_btmesh_node_reset_response_id = 0x15,
    sli_btmesh_node_set_beacon_reporting_response_id = 0x18,
    sli_btmesh_node_set_iv_update_age_response_id = 0x19,
    sli_btmesh_node_get_key_count_response_id = 0x1a,
    sli_btmesh_node_get_key_response_id = 0x1b,
    sli_btmesh_node_get_networks_response_id = 0x1c,
    sli_btmesh_node_get_element_seqnum_response_id = 0x1d,
    sli_btmesh_node_set_model_option_response_id = 0x1e,
    sli_btmesh_node_get_local_dcd_response_id = 0x1f,
    sli_btmesh_node_power_off_response_id = 0x21,
    sli_btmesh_node_set_adv_phy_response_id = 0x22,
    sli_btmesh_node_get_adv_phy_response_id = 0x23,
    sli_btmesh_node_set_unprov_beaconing_adv_interval_response_id = 0x28,
    sli_btmesh_node_set_proxy_service_adv_interval_response_id = 0x29,
    sli_btmesh_node_set_provisioning_service_adv_interval_response_id = 0x30,
    sli_btmesh_prov_init_response_id = 0x00,
    sli_btmesh_prov_scan_unprov_beacons_response_id = 0x01,
    sli_btmesh_prov_create_provisioning_session_response_id = 0x41,
    sli_btmesh_prov_set_provisioning_suspend_event_response_id = 0x42,
    sli_btmesh_prov_provision_adv_device_response_id = 0x43,
    sli_btmesh_prov_provision_gatt_device_response_id = 0x44,
    sli_btmesh_prov_continue_provisioning_response_id = 0x45,
    sli_btmesh_prov_abort_provisioning_response_id = 0x47,
    sli_btmesh_prov_set_device_address_response_id = 0x46,
    sli_btmesh_prov_create_network_response_id = 0x03,
    sli_btmesh_prov_create_appkey_response_id = 0x07,
    sli_btmesh_prov_send_oob_pkey_response_response_id = 0x08,
    sli_btmesh_prov_send_oob_auth_response_response_id = 0x09,
    sli_btmesh_prov_set_oob_requirements_response_id = 0x0a,
    sli_btmesh_prov_start_key_refresh_response_id = 0x0b,
    sli_btmesh_prov_get_key_refresh_exclusion_response_id = 0x0c,
    sli_btmesh_prov_set_key_refresh_exclusion_response_id = 0x0d,
    sli_btmesh_prov_get_ddb_entry_response_id = 0x16,
    sli_btmesh_prov_delete_ddb_entry_response_id = 0x17,
    sli_btmesh_prov_add_ddb_entry_response_id = 0x18,
    sli_btmesh_prov_list_ddb_entries_response_id = 0x19,
    sli_btmesh_prov_initialize_network_response_id = 0x37,
    sli_btmesh_prov_get_key_refresh_appkey_exclusion_response_id = 0x38,
    sli_btmesh_prov_set_key_refresh_appkey_exclusion_response_id = 0x39,
    sli_btmesh_prov_stop_scan_unprov_beacons_response_id = 0x3A,
    sli_btmesh_prov_update_device_netkey_index_response_id = 0x3b,
    sli_btmesh_prov_suspend_key_refresh_response_id = 0x3c,
    sli_btmesh_prov_resume_key_refresh_response_id = 0x3d,
    sli_btmesh_prov_get_key_refresh_phase_response_id = 0x3e,
    sli_btmesh_prov_start_key_refresh_from_phase_response_id = 0x3f,
    sli_btmesh_prov_flush_key_refresh_state_response_id = 0x40,
    sli_btmesh_prov_test_identity_response_id = 0x48,
    sli_btmesh_proxy_connect_response_id = 0x00,
    sli_btmesh_proxy_disconnect_response_id = 0x01,
    sli_btmesh_proxy_set_filter_type_response_id = 0x02,
    sli_btmesh_proxy_allow_response_id = 0x03,
    sli_btmesh_proxy_deny_response_id = 0x04,
    sli_btmesh_proxy_optimisation_toggle_response_id = 0x05,
    sli_btmesh_vendor_model_send_response_id = 0x00,
    sli_btmesh_vendor_model_set_publication_response_id = 0x01,
    sli_btmesh_vendor_model_clear_publication_response_id = 0x02,
    sli_btmesh_vendor_model_publish_response_id = 0x03,
    sli_btmesh_vendor_model_init_response_id = 0x04,
    sli_btmesh_vendor_model_deinit_response_id = 0x05,
    sli_btmesh_vendor_model_send_tracked_response_id = 0x06,
    sli_btmesh_vendor_model_set_publication_tracked_response_id = 0x07,
    sli_btmesh_health_client_get_response_id = 0x00,
    sli_btmesh_health_client_clear_response_id = 0x01,
    sli_btmesh_health_client_test_response_id = 0x02,
    sli_btmesh_health_client_get_period_response_id = 0x03,
    sli_btmesh_health_client_set_period_response_id = 0x04,
    sli_btmesh_health_client_get_attention_response_id = 0x05,
    sli_btmesh_health_client_set_attention_response_id = 0x06,
    sli_btmesh_health_server_set_fault_response_id = 0x00,
    sli_btmesh_health_server_clear_fault_response_id = 0x01,
    sli_btmesh_health_server_send_test_response_response_id = 0x02,
    sli_btmesh_generic_client_get_response_id = 0x00,
    sli_btmesh_generic_client_set_response_id = 0x01,
    sli_btmesh_generic_client_publish_response_id = 0x02,
    sli_btmesh_generic_client_get_params_response_id = 0x03,
    sli_btmesh_generic_client_init_response_id = 0x04,
    sli_btmesh_generic_client_init_common_response_id = 0x05,
    sli_btmesh_generic_client_init_on_off_response_id = 0x06,
    sli_btmesh_generic_client_init_level_response_id = 0x07,
    sli_btmesh_generic_client_init_default_transition_time_response_id = 0x08,
    sli_btmesh_generic_client_init_power_on_off_response_id = 0x09,
    sli_btmesh_generic_client_init_power_level_response_id = 0x0a,
    sli_btmesh_generic_client_init_battery_response_id = 0x0b,
    sli_btmesh_generic_client_init_location_response_id = 0x0c,
    sli_btmesh_generic_client_init_property_response_id = 0x0d,
    sli_btmesh_generic_client_init_lightness_response_id = 0x0e,
    sli_btmesh_generic_client_init_ctl_response_id = 0x0f,
    sli_btmesh_generic_client_init_hsl_response_id = 0x10,
    sli_btmesh_generic_server_respond_response_id = 0x00,
    sli_btmesh_generic_server_update_response_id = 0x01,
    sli_btmesh_generic_server_publish_response_id = 0x02,
    sli_btmesh_generic_server_init_response_id = 0x04,
    sli_btmesh_generic_server_init_common_response_id = 0x05,
    sli_btmesh_generic_server_init_on_off_response_id = 0x06,
    sli_btmesh_generic_server_init_level_response_id = 0x07,
    sli_btmesh_generic_server_init_default_transition_time_response_id = 0x08,
    sli_btmesh_generic_server_init_power_on_off_response_id = 0x09,
    sli_btmesh_generic_server_init_power_level_response_id = 0x0a,
    sli_btmesh_generic_server_init_battery_response_id = 0x0b,
    sli_btmesh_generic_server_init_location_response_id = 0x0c,
    sli_btmesh_generic_server_init_property_response_id = 0x0d,
    sli_btmesh_generic_server_init_lightness_response_id = 0x0e,
    sli_btmesh_generic_server_init_ctl_response_id = 0x0f,
    sli_btmesh_generic_server_init_hsl_response_id = 0x10,
    sli_btmesh_generic_server_get_cached_state_response_id = 0x11,
    sli_btmesh_test_get_nettx_response_id = 0x00,
    sli_btmesh_test_set_nettx_response_id = 0x01,
    sli_btmesh_test_get_relay_response_id = 0x02,
    sli_btmesh_test_set_relay_response_id = 0x03,
    sli_btmesh_test_set_adv_scan_params_response_id = 0x4,
    sli_btmesh_test_set_ivupdate_test_mode_response_id = 0x05,
    sli_btmesh_test_get_ivupdate_test_mode_response_id = 0x06,
    sli_btmesh_test_set_segment_send_delay_response_id = 0x07,
    sli_btmesh_test_set_ivupdate_state_response_id = 0x08,
    sli_btmesh_test_send_beacons_response_id = 0x09,
    sli_btmesh_test_bind_local_model_app_response_id = 0x0a,
    sli_btmesh_test_unbind_local_model_app_response_id = 0x0b,
    sli_btmesh_test_add_local_model_sub_response_id = 0x0c,
    sli_btmesh_test_remove_local_model_sub_response_id = 0x0d,
    sli_btmesh_test_add_local_model_sub_va_response_id = 0x0e,
    sli_btmesh_test_remove_local_model_sub_va_response_id = 0x0f,
    sli_btmesh_test_get_local_model_sub_response_id = 0x10,
    sli_btmesh_test_set_local_model_pub_response_id = 0x11,
    sli_btmesh_test_set_local_model_pub_va_response_id = 0x12,
    sli_btmesh_test_get_local_model_pub_response_id = 0x13,
    sli_btmesh_test_set_local_heartbeat_subscription_response_id = 0x14,
    sli_btmesh_test_get_local_heartbeat_subscription_response_id = 0x15,
    sli_btmesh_test_get_local_heartbeat_publication_response_id = 0x16,
    sli_btmesh_test_set_local_heartbeat_publication_response_id = 0x17,
    sli_btmesh_test_set_local_config_response_id = 0x18,
    sli_btmesh_test_get_local_config_response_id = 0x19,
    sli_btmesh_test_add_local_key_response_id = 0x1a,
    sli_btmesh_test_remove_local_key_response_id = 0x1b,
    sli_btmesh_test_update_local_key_response_id = 0x1c,
    sli_btmesh_test_set_sar_config_response_id = 0x1d,
    sli_btmesh_test_set_adv_bearer_state_response_id = 0x1f,
    sli_btmesh_test_prov_get_device_key_response_id = 0x23,
    sli_btmesh_test_prov_prepare_key_refresh_response_id = 0x24,
    sli_btmesh_test_cancel_segmented_tx_response_id = 0x25,
    sli_btmesh_test_set_iv_index_response_id = 0x26,
    sli_btmesh_test_set_element_seqnum_response_id = 0x27,
    sli_btmesh_test_set_model_option_response_id = 0x28,
    sli_btmesh_test_get_local_model_app_bindings_response_id = 0x29,
    sli_btmesh_test_get_replay_protection_list_entry_response_id = 0x2a,
    sli_btmesh_test_clear_replay_protection_list_entry_response_id = 0x2b,
    sli_btmesh_test_set_replay_protection_list_diagnostics_response_id = 0x2c,
    sli_btmesh_test_get_model_option_response_id = 0x2d,
    sli_btmesh_test_get_default_ttl_response_id = 0x2e,
    sli_btmesh_test_set_default_ttl_response_id = 0x2f,
    sli_btmesh_test_get_gatt_proxy_response_id = 0x30,
    sli_btmesh_test_set_gatt_proxy_response_id = 0x31,
    sli_btmesh_test_get_identity_response_id = 0x32,
    sli_btmesh_test_set_identity_response_id = 0x33,
    sli_btmesh_test_get_friend_response_id = 0x34,
    sli_btmesh_test_set_friend_response_id = 0x35,
    sli_btmesh_test_get_beacon_response_id = 0x36,
    sli_btmesh_test_set_beacon_response_id = 0x37,
    sli_btmesh_lpn_init_response_id = 0x00,
    sli_btmesh_lpn_deinit_response_id = 0x01,
    sli_btmesh_lpn_establish_friendship_response_id = 0x03,
    sli_btmesh_lpn_poll_response_id = 0x04,
    sli_btmesh_lpn_terminate_friendship_response_id = 0x05,
    sli_btmesh_lpn_config_response_id = 0x06,
    sli_btmesh_friend_init_response_id = 0x00,
    sli_btmesh_friend_deinit_response_id = 0x01,
    sli_btmesh_config_client_cancel_request_response_id = 0x00,
    sli_btmesh_config_client_get_request_status_response_id = 0x01,
    sli_btmesh_config_client_get_default_timeout_response_id = 0x2e,
    sli_btmesh_config_client_set_default_timeout_response_id = 0x2f,
    sli_btmesh_config_client_add_netkey_response_id = 0x02,
    sli_btmesh_config_client_remove_netkey_response_id = 0x03,
    sli_btmesh_config_client_list_netkeys_response_id = 0x04,
    sli_btmesh_config_client_add_appkey_response_id = 0x05,
    sli_btmesh_config_client_remove_appkey_response_id = 0x06,
    sli_btmesh_config_client_list_appkeys_response_id = 0x07,
    sli_btmesh_config_client_bind_model_response_id = 0x08,
    sli_btmesh_config_client_unbind_model_response_id = 0x09,
    sli_btmesh_config_client_list_bindings_response_id = 0x0a,
    sli_btmesh_config_client_get_model_pub_response_id = 0x0b,
    sli_btmesh_config_client_set_model_pub_response_id = 0x0c,
    sli_btmesh_config_client_set_model_pub_va_response_id = 0x0d,
    sli_btmesh_config_client_add_model_sub_response_id = 0x0e,
    sli_btmesh_config_client_add_model_sub_va_response_id = 0x0f,
    sli_btmesh_config_client_remove_model_sub_response_id = 0x10,
    sli_btmesh_config_client_remove_model_sub_va_response_id = 0x11,
    sli_btmesh_config_client_set_model_sub_response_id = 0x12,
    sli_btmesh_config_client_set_model_sub_va_response_id = 0x13,
    sli_btmesh_config_client_clear_model_sub_response_id = 0x14,
    sli_btmesh_config_client_list_subs_response_id = 0x15,
    sli_btmesh_config_client_get_heartbeat_pub_response_id = 0x16,
    sli_btmesh_config_client_set_heartbeat_pub_response_id = 0x17,
    sli_btmesh_config_client_get_heartbeat_sub_response_id = 0x19,
    sli_btmesh_config_client_set_heartbeat_sub_response_id = 0x1a,
    sli_btmesh_config_client_get_beacon_response_id = 0x1b,
    sli_btmesh_config_client_set_beacon_response_id = 0x1c,
    sli_btmesh_config_client_get_default_ttl_response_id = 0x1d,
    sli_btmesh_config_client_set_default_ttl_response_id = 0x1e,
    sli_btmesh_config_client_get_gatt_proxy_response_id = 0x1f,
    sli_btmesh_config_client_set_gatt_proxy_response_id = 0x20,
    sli_btmesh_config_client_get_relay_response_id = 0x21,
    sli_btmesh_config_client_set_relay_response_id = 0x22,
    sli_btmesh_config_client_get_network_transmit_response_id = 0x23,
    sli_btmesh_config_client_set_network_transmit_response_id = 0x24,
    sli_btmesh_config_client_get_identity_response_id = 0x25,
    sli_btmesh_config_client_set_identity_response_id = 0x26,
    sli_btmesh_config_client_get_friend_response_id = 0x27,
    sli_btmesh_config_client_set_friend_response_id = 0x28,
    sli_btmesh_config_client_get_key_refresh_phase_response_id = 0x29,
    sli_btmesh_config_client_get_lpn_polltimeout_response_id = 0x2b,
    sli_btmesh_config_client_get_dcd_response_id = 0x2c,
    sli_btmesh_config_client_reset_node_response_id = 0x2d,
    sli_btmesh_sensor_server_init_response_id = 0x00,
    sli_btmesh_sensor_server_deinit_response_id = 0x01,
    sli_btmesh_sensor_server_send_descriptor_status_response_id = 0x02,
    sli_btmesh_sensor_server_send_status_response_id = 0x03,
    sli_btmesh_sensor_server_send_column_status_response_id = 0x04,
    sli_btmesh_sensor_server_send_series_status_response_id = 0x05,
    sli_btmesh_sensor_setup_server_send_cadence_status_response_id = 0x00,
    sli_btmesh_sensor_setup_server_send_settings_status_response_id = 0x01,
    sli_btmesh_sensor_setup_server_send_setting_status_response_id = 0x02,
    sli_btmesh_sensor_client_init_response_id = 0x00,
    sli_btmesh_sensor_client_deinit_response_id = 0x01,
    sli_btmesh_sensor_client_get_descriptor_response_id = 0x02,
    sli_btmesh_sensor_client_get_response_id = 0x03,
    sli_btmesh_sensor_client_get_column_response_id = 0x04,
    sli_btmesh_sensor_client_get_series_response_id = 0x05,
    sli_btmesh_sensor_client_get_cadence_response_id = 0x06,
    sli_btmesh_sensor_client_set_cadence_response_id = 0x07,
    sli_btmesh_sensor_client_get_settings_response_id = 0x08,
    sli_btmesh_sensor_client_get_setting_response_id = 0x09,
    sli_btmesh_sensor_client_set_setting_response_id = 0x0a,
    sli_btmesh_lc_client_init_response_id = 0x00,
    sli_btmesh_lc_client_get_mode_response_id = 0x01,
    sli_btmesh_lc_client_set_mode_response_id = 0x02,
    sli_btmesh_lc_client_get_om_response_id = 0x04,
    sli_btmesh_lc_client_set_om_response_id = 0x05,
    sli_btmesh_lc_client_get_light_onoff_response_id = 0x07,
    sli_btmesh_lc_client_set_light_onoff_response_id = 0x08,
    sli_btmesh_lc_client_get_property_response_id = 0x09,
    sli_btmesh_lc_client_set_property_response_id = 0x0a,
    sli_btmesh_lc_server_init_response_id = 0x00,
    sli_btmesh_lc_server_deinit_response_id = 0x01,
    sli_btmesh_lc_server_update_mode_response_id = 0x02,
    sli_btmesh_lc_server_update_om_response_id = 0x03,
    sli_btmesh_lc_server_update_light_onoff_response_id = 0x04,
    sli_btmesh_lc_server_init_all_properties_response_id = 0x05,
    sli_btmesh_lc_server_set_publish_mask_response_id = 0x06,
    sli_btmesh_lc_server_set_regulator_interval_response_id = 0x07,
    sli_btmesh_lc_server_set_event_mask_response_id = 0x08,
    sli_btmesh_lc_server_get_lc_state_response_id = 0x09,
    sli_btmesh_lc_setup_server_update_property_response_id = 0x00,
    sli_btmesh_scene_client_init_response_id = 0x00,
    sli_btmesh_scene_client_get_response_id = 0x01,
    sli_btmesh_scene_client_get_register_response_id = 0x02,
    sli_btmesh_scene_client_recall_response_id = 0x03,
    sli_btmesh_scene_client_store_response_id = 0x04,
    sli_btmesh_scene_client_delete_response_id = 0x05,
    sli_btmesh_scene_server_init_response_id = 0x00,
    sli_btmesh_scene_server_deinit_response_id = 0x01,
    sli_btmesh_scene_server_reset_register_response_id = 0x2,
    sli_btmesh_scene_server_enable_compact_recall_events_response_id = 0x3,
    sli_btmesh_scene_setup_server_init_response_id = 0x00,
    sli_btmesh_scheduler_client_init_response_id = 0x00,
    sli_btmesh_scheduler_client_deinit_response_id = 0x01,
    sli_btmesh_scheduler_client_get_response_id = 0x02,
    sli_btmesh_scheduler_client_get_action_response_id = 0x03,
    sli_btmesh_scheduler_client_set_action_response_id = 0x04,
    sli_btmesh_scheduler_server_init_response_id = 0x00,
    sli_btmesh_scheduler_server_deinit_response_id = 0x01,
    sli_btmesh_scheduler_server_get_response_id = 0x02,
    sli_btmesh_scheduler_server_get_action_response_id = 0x03,
    sli_btmesh_scheduler_server_set_action_response_id = 0x04,
    sli_btmesh_time_server_init_response_id = 0x00,
    sli_btmesh_time_server_deinit_response_id = 0x01,
    sli_btmesh_time_server_get_time_response_id = 0x02,
    sli_btmesh_time_server_set_time_response_id = 0x03,
    sli_btmesh_time_server_get_time_zone_offset_new_response_id = 0x04,
    sli_btmesh_time_server_set_time_zone_offset_new_response_id = 0x05,
    sli_btmesh_time_server_get_tai_utc_delta_new_response_id = 0x06,
    sli_btmesh_time_server_set_tai_utc_delta_new_response_id = 0x07,
    sli_btmesh_time_server_get_time_role_response_id = 0x08,
    sli_btmesh_time_server_set_time_role_response_id = 0x09,
    sli_btmesh_time_server_get_datetime_response_id = 0x0A,
    sli_btmesh_time_server_publish_response_id = 0x0B,
    sli_btmesh_time_server_status_response_id = 0x0C,
    sli_btmesh_time_client_init_response_id = 0x00,
    sli_btmesh_time_client_deinit_response_id = 0x01,
    sli_btmesh_time_client_get_time_response_id = 0x02,
    sli_btmesh_time_client_set_time_response_id = 0x03,
    sli_btmesh_time_client_get_time_zone_response_id = 0x04,
    sli_btmesh_time_client_set_time_zone_response_id = 0x05,
    sli_btmesh_time_client_get_tai_utc_delta_response_id = 0x06,
    sli_btmesh_time_client_set_tai_utc_delta_response_id = 0x07,
    sli_btmesh_time_client_get_time_role_response_id = 0x08,
    sli_btmesh_time_client_set_time_role_response_id = 0x09,
    sli_btmesh_migration_migrate_keys_response_id = 0x1,
    sli_btmesh_migration_migrate_ddb_response_id = 0x2,
};

