espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
enum sli_btmesh_event_id
{
    sli_btmesh_node_initialized_event_id = 0x00,
    sli_btmesh_node_provisioned_event_id = 0x01,
    sli_btmesh_node_config_get_event_id = 0x02,
    sli_btmesh_node_config_set_event_id = 0x03,
    sli_btmesh_node_display_output_oob_event_id = 0x04,
    sli_btmesh_node_input_oob_request_event_id = 0x05,
    sli_btmesh_node_provisioning_started_event_id = 0x06,
    sli_btmesh_node_provisioning_failed_event_id = 0x07,
    sli_btmesh_node_key_added_event_id = 0x08,
    sli_btmesh_node_model_config_changed_event_id = 0x09,
    sli_btmesh_node_reset_event_id = 0x0a,
    sli_btmesh_node_ivrecovery_needed_event_id = 0x0b,
    sli_btmesh_node_changed_ivupdate_state_event_id = 0x0c,
    sli_btmesh_node_static_oob_request_event_id = 0x0d,
    sli_btmesh_node_key_removed_event_id = 0x0e,
    sli_btmesh_node_key_updated_event_id = 0x0f,
    sli_btmesh_node_heartbeat_event_id = 0x10,
    sli_btmesh_node_heartbeat_start_event_id = 0x11,
    sli_btmesh_node_heartbeat_stop_event_id = 0x12,
    sli_btmesh_node_beacon_received_event_id = 0x13,
    sli_btmesh_node_local_dcd_data_event_id = 0x14,
    sli_btmesh_node_local_dcd_data_end_event_id = 0x15,
    sli_btmesh_node_start_received_event_id = 0x16,
    sli_btmesh_prov_initialized_event_id = 0x00,
    sli_btmesh_prov_provisioning_suspended_event_id = 0x18,
    sli_btmesh_prov_capabilities_event_id = 0x17,
    sli_btmesh_prov_provisioning_failed_event_id = 0x01,
    sli_btmesh_prov_device_provisioned_event_id = 0x02,
    sli_btmesh_prov_unprov_beacon_event_id = 0x03,
    sli_btmesh_prov_oob_pkey_request_event_id = 0x06,
    sli_btmesh_prov_oob_auth_request_event_id = 0x07,
    sli_btmesh_prov_oob_display_input_event_id = 0x08,
    sli_btmesh_prov_ddb_list_event_id = 0x09,
    sli_btmesh_prov_uri_event_id = 0x0d,
    sli_btmesh_prov_key_refresh_phase_update_event_id = 0x14,
    sli_btmesh_prov_key_refresh_node_update_event_id = 0x15,
    sli_btmesh_prov_key_refresh_complete_event_id = 0x16,
    sli_btmesh_prov_add_ddb_entry_complete_event_id = 0x19,
    sli_btmesh_prov_delete_ddb_entry_complete_event_id = 0x1a,
    sli_btmesh_prov_initialization_failed_event_id = 0x1b,
    sli_btmesh_prov_start_sent_event_id = 0x1e,
    sli_btmesh_proxy_connected_event_id = 0x00,
    sli_btmesh_proxy_disconnected_event_id = 0x01,
    sli_btmesh_proxy_filter_status_event_id = 0x02,
    sli_btmesh_vendor_model_receive_event_id = 0x00,
    sli_btmesh_vendor_model_send_complete_event_id = 0x01,
    sli_btmesh_health_client_server_status_event_id = 0x00,
    sli_btmesh_health_client_server_status_period_event_id = 0x01,
    sli_btmesh_health_client_server_status_attention_event_id = 0x02,
    sli_btmesh_health_server_attention_event_id = 0x00,
    sli_btmesh_health_server_test_request_event_id = 0x01,
    sli_btmesh_generic_client_server_status_event_id = 0x00,
    sli_btmesh_generic_server_client_request_event_id = 0x00,
    sli_btmesh_generic_server_state_changed_event_id = 0x01,
    sli_btmesh_generic_server_state_recall_event_id = 0x02,
    sli_btmesh_test_local_heartbeat_subscription_complete_event_id = 0x00,
    sli_btmesh_test_replay_protection_list_entry_set_event_id = 0x01,
    sli_btmesh_test_replay_protection_list_entry_cleared_event_id = 0x02,
    sli_btmesh_test_replay_protection_list_saved_event_id = 0x03,
    sli_btmesh_test_replay_protection_list_full_event_id = 0x04,
    sli_btmesh_lpn_friendship_established_event_id = 0x00,
    sli_btmesh_lpn_friendship_failed_event_id = 0x01,
    sli_btmesh_lpn_friendship_terminated_event_id = 0x02,
    sli_btmesh_friend_friendship_established_event_id = 0x00,
    sli_btmesh_friend_friendship_terminated_event_id = 0x01,
    sli_btmesh_config_client_request_modified_event_id = 0x00,
    sli_btmesh_config_client_netkey_status_event_id = 0x01,
    sli_btmesh_config_client_netkey_list_event_id = 0x02,
    sli_btmesh_config_client_netkey_list_end_event_id = 0x03,
    sli_btmesh_config_client_appkey_status_event_id = 0x04,
    sli_btmesh_config_client_appkey_list_event_id = 0x05,
    sli_btmesh_config_client_appkey_list_end_event_id = 0x06,
    sli_btmesh_config_client_binding_status_event_id = 0x07,
    sli_btmesh_config_client_bindings_list_event_id = 0x08,
    sli_btmesh_config_client_bindings_list_end_event_id = 0x09,
    sli_btmesh_config_client_model_pub_status_event_id = 0x0a,
    sli_btmesh_config_client_model_sub_status_event_id = 0x0b,
    sli_btmesh_config_client_subs_list_event_id = 0x0c,
    sli_btmesh_config_client_subs_list_end_event_id = 0x0d,
    sli_btmesh_config_client_heartbeat_pub_status_event_id = 0x0e,
    sli_btmesh_config_client_heartbeat_sub_status_event_id = 0x0f,
    sli_btmesh_config_client_beacon_status_event_id = 0x10,
    sli_btmesh_config_client_default_ttl_status_event_id = 0x11,
    sli_btmesh_config_client_gatt_proxy_status_event_id = 0x12,
    sli_btmesh_config_client_relay_status_event_id = 0x13,
    sli_btmesh_config_client_network_transmit_status_event_id = 0x14,
    sli_btmesh_config_client_identity_status_event_id = 0x15,
    sli_btmesh_config_client_friend_status_event_id = 0x16,
    sli_btmesh_config_client_key_refresh_phase_status_event_id = 0x17,
    sli_btmesh_config_client_lpn_polltimeout_status_event_id = 0x18,
    sli_btmesh_config_client_dcd_data_event_id = 0x19,
    sli_btmesh_config_client_dcd_data_end_event_id = 0x1a,
    sli_btmesh_config_client_reset_status_event_id = 0x1b,
    sli_btmesh_sensor_server_get_request_event_id = 0x01,
    sli_btmesh_sensor_server_get_column_request_event_id = 0x02,
    sli_btmesh_sensor_server_get_series_request_event_id = 0x03,
    sli_btmesh_sensor_server_publish_event_id = 0x04,
    sli_btmesh_sensor_setup_server_get_cadence_request_event_id = 0x00,
    sli_btmesh_sensor_setup_server_set_cadence_request_event_id = 0x01,
    sli_btmesh_sensor_setup_server_get_settings_request_event_id = 0x02,
    sli_btmesh_sensor_setup_server_get_setting_request_event_id = 0x03,
    sli_btmesh_sensor_setup_server_set_setting_request_event_id = 0x04,
    sli_btmesh_sensor_setup_server_publish_event_id = 0x05,
    sli_btmesh_sensor_client_descriptor_status_event_id = 0x00,
    sli_btmesh_sensor_client_cadence_status_event_id = 0x01,
    sli_btmesh_sensor_client_settings_status_event_id = 0x02,
    sli_btmesh_sensor_client_setting_status_event_id = 0x03,
    sli_btmesh_sensor_client_status_event_id = 0x04,
    sli_btmesh_sensor_client_column_status_event_id = 0x05,
    sli_btmesh_sensor_client_series_status_event_id = 0x06,
    sli_btmesh_sensor_client_publish_event_id = 0x07,
    sli_btmesh_lc_client_mode_status_event_id = 0x00,
    sli_btmesh_lc_client_om_status_event_id = 0x01,
    sli_btmesh_lc_client_light_onoff_status_event_id = 0x02,
    sli_btmesh_lc_client_property_status_event_id = 0x03,
    sli_btmesh_lc_server_mode_updated_event_id = 0x00,
    sli_btmesh_lc_server_om_updated_event_id = 0x01,
    sli_btmesh_lc_server_light_onoff_updated_event_id = 0x02,
    sli_btmesh_lc_server_occupancy_updated_event_id = 0x03,
    sli_btmesh_lc_server_ambient_lux_level_updated_event_id = 0x04,
    sli_btmesh_lc_server_linear_output_updated_event_id = 0x05,
    sli_btmesh_lc_server_state_updated_event_id = 0x06,
    sli_btmesh_lc_server_regulator_debug_info_event_id = 0x07,
    sli_btmesh_lc_setup_server_set_property_event_id = 0x00,
    sli_btmesh_scene_client_status_event_id = 0x00,
    sli_btmesh_scene_client_register_status_event_id = 0x01,
    sli_btmesh_scene_server_get_event_id = 0x01,
    sli_btmesh_scene_server_register_get_event_id = 0x02,
    sli_btmesh_scene_server_recall_event_id = 0x03,
    sli_btmesh_scene_server_publish_event_id = 0x04,
    sli_btmesh_scene_server_compact_recall_event_id = 0x05,
    sli_btmesh_scene_setup_server_store_event_id = 0x00,
    sli_btmesh_scene_setup_server_delete_event_id = 0x01,
    sli_btmesh_scene_setup_server_publish_event_id = 0x02,
    sli_btmesh_scheduler_client_status_event_id = 0x00,
    sli_btmesh_scheduler_client_action_status_event_id = 0x01,
    sli_btmesh_scheduler_server_action_changed_event_id = 0x01,
    sli_btmesh_scheduler_server_scene_changed_event_id = 0x02,
    sli_btmesh_scheduler_server_action_triggered_event_id = 0x03,
    sli_btmesh_time_server_time_updated_event_id = 0x00,
    sli_btmesh_time_server_time_zone_offset_updated_event_id = 0x01,
    sli_btmesh_time_server_tai_utc_delta_updated_event_id = 0x02,
    sli_btmesh_time_server_time_role_updated_event_id = 0x03,
    sli_btmesh_time_client_time_status_event_id = 0x00,
    sli_btmesh_time_client_time_zone_status_event_id = 0x01,
    sli_btmesh_time_client_tai_utc_delta_status_event_id = 0x02,
    sli_btmesh_time_client_time_role_status_event_id = 0x03,
};

PACKSTRUCT( struct sl_bt_rsp_error_s
{
    uint16_t            result;
});

typedef struct sl_bt_rsp_error_s sl_bt_rsp_error_t;

PACKSTRUCT( struct sl_btmesh_cmd_node_start_unprov_beaconing_s
{
    uint8_t bearer;
});

typedef struct sl_btmesh_cmd_node_start_unprov_beaconing_s sl_btmesh_cmd_node_start_unprov_beaconing_t;


