espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
PACKSTRUCT( struct sl_btmesh_cmd_node_send_input_oob_request_response_s
{
    uint8array data;
});

typedef struct sl_btmesh_cmd_node_send_input_oob_request_response_s sl_btmesh_cmd_node_send_input_oob_request_response_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_set_provisioning_data_s
{
    aes_key_128 device_key;
    aes_key_128 network_key;
    uint16_t netkey_index;
    uint32_t iv_index;
    uint16_t address;
    uint8_t kr_in_progress;
});

typedef struct sl_btmesh_cmd_node_set_provisioning_data_s sl_btmesh_cmd_node_set_provisioning_data_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_init_oob_s
{
    uint8_t public_key;
    uint8_t auth_methods;
    uint16_t output_actions;
    uint8_t output_size;
    uint16_t input_actions;
    uint8_t input_size;
    uint16_t oob_location;
});

typedef struct sl_btmesh_cmd_node_init_oob_s sl_btmesh_cmd_node_init_oob_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_set_ivrecovery_mode_s
{
    uint8_t mode;
});

typedef struct sl_btmesh_cmd_node_set_ivrecovery_mode_s sl_btmesh_cmd_node_set_ivrecovery_mode_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_set_net_relay_delay_s
{
    uint8_t min_ms;
    uint8_t max_ms;
});

typedef struct sl_btmesh_cmd_node_set_net_relay_delay_s sl_btmesh_cmd_node_set_net_relay_delay_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_get_seq_remaining_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_node_get_seq_remaining_s sl_btmesh_cmd_node_get_seq_remaining_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_set_uuid_s
{
    uuid_128 uuid;
});

typedef struct sl_btmesh_cmd_node_set_uuid_s sl_btmesh_cmd_node_set_uuid_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_get_element_address_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_node_get_element_address_s sl_btmesh_cmd_node_get_element_address_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_send_static_oob_request_response_s
{
    uint8array data;
});

typedef struct sl_btmesh_cmd_node_send_static_oob_request_response_s sl_btmesh_cmd_node_send_static_oob_request_response_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_set_beacon_reporting_s
{
    uint8_t report;
});

typedef struct sl_btmesh_cmd_node_set_beacon_reporting_s sl_btmesh_cmd_node_set_beacon_reporting_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_set_iv_update_age_s
{
    uint32_t age_sec;
});

typedef struct sl_btmesh_cmd_node_set_iv_update_age_s sl_btmesh_cmd_node_set_iv_update_age_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_get_key_count_s
{
    uint8_t type;
});

typedef struct sl_btmesh_cmd_node_get_key_count_s sl_btmesh_cmd_node_get_key_count_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_get_key_s
{
    uint8_t type;
    uint32_t index;
    uint8_t current;
});

typedef struct sl_btmesh_cmd_node_get_key_s sl_btmesh_cmd_node_get_key_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_get_element_seqnum_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_node_get_element_seqnum_s sl_btmesh_cmd_node_get_element_seqnum_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_set_model_option_s
{
    uint16_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint8_t option;
    uint32_t value;
});

typedef struct sl_btmesh_cmd_node_set_model_option_s sl_btmesh_cmd_node_set_model_option_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_get_local_dcd_s
{
    uint8_t page;
});

typedef struct sl_btmesh_cmd_node_get_local_dcd_s sl_btmesh_cmd_node_get_local_dcd_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_set_adv_phy_s
{
    uint8_t phy;
});

typedef struct sl_btmesh_cmd_node_set_adv_phy_s sl_btmesh_cmd_node_set_adv_phy_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_set_unprov_beaconing_adv_interval_s
{
    uint16_t adv_interval_min;
    uint16_t adv_interval_max;
});

typedef struct sl_btmesh_cmd_node_set_unprov_beaconing_adv_interval_s sl_btmesh_cmd_node_set_unprov_beaconing_adv_interval_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_set_proxy_service_adv_interval_s
{
    uint16_t adv_interval_min;
    uint16_t adv_interval_max;
});

typedef struct sl_btmesh_cmd_node_set_proxy_service_adv_interval_s sl_btmesh_cmd_node_set_proxy_service_adv_interval_t;


PACKSTRUCT( struct sl_btmesh_cmd_node_set_provisioning_service_adv_interval_s
{
    uint16_t adv_interval_min;
    uint16_t adv_interval_max;
});

typedef struct sl_btmesh_cmd_node_set_provisioning_service_adv_interval_s sl_btmesh_cmd_node_set_provisioning_service_adv_interval_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_create_provisioning_session_s
{
    uint16_t netkey_index;
    uuid_128 uuid;
    uint8_t attention_timer_sec;
});

typedef struct sl_btmesh_cmd_prov_create_provisioning_session_s sl_btmesh_cmd_prov_create_provisioning_session_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_set_provisioning_suspend_event_s
{
    uint8_t status;
});

typedef struct sl_btmesh_cmd_prov_set_provisioning_suspend_event_s sl_btmesh_cmd_prov_set_provisioning_suspend_event_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_provision_adv_device_s
{
    uuid_128 uuid;
});

typedef struct sl_btmesh_cmd_prov_provision_adv_device_s sl_btmesh_cmd_prov_provision_adv_device_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_provision_gatt_device_s
{
    uuid_128 uuid;
    uint8_t connection;
});

typedef struct sl_btmesh_cmd_prov_provision_gatt_device_s sl_btmesh_cmd_prov_provision_gatt_device_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_continue_provisioning_s
{
    uuid_128 uuid;
});

typedef struct sl_btmesh_cmd_prov_continue_provisioning_s sl_btmesh_cmd_prov_continue_provisioning_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_abort_provisioning_s
{
    uuid_128 uuid;
    uint8_t reason;
});

typedef struct sl_btmesh_cmd_prov_abort_provisioning_s sl_btmesh_cmd_prov_abort_provisioning_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_set_device_address_s
{
    uuid_128 uuid;
    uint16_t address;
});

typedef struct sl_btmesh_cmd_prov_set_device_address_s sl_btmesh_cmd_prov_set_device_address_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_create_network_s
{
    uint16_t netkey_index;
    uint8array key;
});

typedef struct sl_btmesh_cmd_prov_create_network_s sl_btmesh_cmd_prov_create_network_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_create_appkey_s
{
    uint16_t netkey_index;
    uint16_t appkey_index;
    uint8array key;
});

typedef struct sl_btmesh_cmd_prov_create_appkey_s sl_btmesh_cmd_prov_create_appkey_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_send_oob_pkey_response_s
{
    uuid_128 uuid;
    uint8array pkey;
});

typedef struct sl_btmesh_cmd_prov_send_oob_pkey_response_s sl_btmesh_cmd_prov_send_oob_pkey_response_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_send_oob_auth_response_s
{
    uuid_128 uuid;
    uint8array data;
});

typedef struct sl_btmesh_cmd_prov_send_oob_auth_response_s sl_btmesh_cmd_prov_send_oob_auth_response_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_set_oob_requirements_s
{
    uuid_128 uuid;
    uint8_t public_key;
    uint8_t auth_methods;
    uint16_t output_actions;
    uint16_t input_actions;
    uint8_t min_size;
    uint8_t max_size;
});

typedef struct sl_btmesh_cmd_prov_set_oob_requirements_s sl_btmesh_cmd_prov_set_oob_requirements_t;


