espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
PACKSTRUCT( struct sl_btmesh_cmd_prov_start_key_refresh_s
{
    uint16_t netkey_index;
    uint8_t num_appkeys;
    uint8array appkey_indices;
});

typedef struct sl_btmesh_cmd_prov_start_key_refresh_s sl_btmesh_cmd_prov_start_key_refresh_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_get_key_refresh_exclusion_s
{
    uint16_t key;
    uuid_128 uuid;
});

typedef struct sl_btmesh_cmd_prov_get_key_refresh_exclusion_s sl_btmesh_cmd_prov_get_key_refresh_exclusion_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_set_key_refresh_exclusion_s
{
    uint16_t key;
    uint8_t status;
    uuid_128 uuid;
});

typedef struct sl_btmesh_cmd_prov_set_key_refresh_exclusion_s sl_btmesh_cmd_prov_set_key_refresh_exclusion_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_get_ddb_entry_s
{
    uuid_128 uuid;
});

typedef struct sl_btmesh_cmd_prov_get_ddb_entry_s sl_btmesh_cmd_prov_get_ddb_entry_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_delete_ddb_entry_s
{
    uuid_128 uuid;
});

typedef struct sl_btmesh_cmd_prov_delete_ddb_entry_s sl_btmesh_cmd_prov_delete_ddb_entry_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_add_ddb_entry_s
{
    uuid_128 uuid;
    aes_key_128 device_key;
    uint16_t netkey_index;
    uint16_t address;
    uint8_t elements;
});

typedef struct sl_btmesh_cmd_prov_add_ddb_entry_s sl_btmesh_cmd_prov_add_ddb_entry_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_initialize_network_s
{
    uint16_t address;
    uint32_t ivi;
});

typedef struct sl_btmesh_cmd_prov_initialize_network_s sl_btmesh_cmd_prov_initialize_network_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_get_key_refresh_appkey_exclusion_s
{
    uint16_t netkey_index;
    uint16_t appkey_index;
    uuid_128 uuid;
});

typedef struct sl_btmesh_cmd_prov_get_key_refresh_appkey_exclusion_s sl_btmesh_cmd_prov_get_key_refresh_appkey_exclusion_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_set_key_refresh_appkey_exclusion_s
{
    uint16_t netkey_index;
    uint16_t appkey_index;
    uint8_t status;
    uuid_128 uuid;
});

typedef struct sl_btmesh_cmd_prov_set_key_refresh_appkey_exclusion_s sl_btmesh_cmd_prov_set_key_refresh_appkey_exclusion_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_update_device_netkey_index_s
{
    uuid_128 uuid;
    uint16_t netkey_index;
});

typedef struct sl_btmesh_cmd_prov_update_device_netkey_index_s sl_btmesh_cmd_prov_update_device_netkey_index_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_suspend_key_refresh_s
{
    uint16_t netkey_index;
});

typedef struct sl_btmesh_cmd_prov_suspend_key_refresh_s sl_btmesh_cmd_prov_suspend_key_refresh_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_resume_key_refresh_s
{
    uint16_t netkey_index;
});

typedef struct sl_btmesh_cmd_prov_resume_key_refresh_s sl_btmesh_cmd_prov_resume_key_refresh_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_get_key_refresh_phase_s
{
    uint16_t netkey_index;
});

typedef struct sl_btmesh_cmd_prov_get_key_refresh_phase_s sl_btmesh_cmd_prov_get_key_refresh_phase_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_start_key_refresh_from_phase_s
{
    uint8_t phase;
    uint16_t netkey_index;
    uint8_t num_appkeys;
    uint8array appkey_indices;
});

typedef struct sl_btmesh_cmd_prov_start_key_refresh_from_phase_s sl_btmesh_cmd_prov_start_key_refresh_from_phase_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_flush_key_refresh_state_s
{
    uint16_t netkey_index;
});

typedef struct sl_btmesh_cmd_prov_flush_key_refresh_state_s sl_btmesh_cmd_prov_flush_key_refresh_state_t;


PACKSTRUCT( struct sl_btmesh_cmd_prov_test_identity_s
{
    uint16_t address;
    uint16_t netkey_index;
    uint8array data;
});

typedef struct sl_btmesh_cmd_prov_test_identity_s sl_btmesh_cmd_prov_test_identity_t;


PACKSTRUCT( struct sl_btmesh_cmd_proxy_connect_s
{
    uint8_t connection;
});

typedef struct sl_btmesh_cmd_proxy_connect_s sl_btmesh_cmd_proxy_connect_t;


PACKSTRUCT( struct sl_btmesh_cmd_proxy_disconnect_s
{
    uint32_t handle;
});

typedef struct sl_btmesh_cmd_proxy_disconnect_s sl_btmesh_cmd_proxy_disconnect_t;


PACKSTRUCT( struct sl_btmesh_cmd_proxy_set_filter_type_s
{
    uint32_t handle;
    uint16_t netkey_index;
    uint8_t type;
});

typedef struct sl_btmesh_cmd_proxy_set_filter_type_s sl_btmesh_cmd_proxy_set_filter_type_t;


PACKSTRUCT( struct sl_btmesh_cmd_proxy_allow_s
{
    uint32_t handle;
    uint16_t netkey_index;
    uint16_t address;
});

typedef struct sl_btmesh_cmd_proxy_allow_s sl_btmesh_cmd_proxy_allow_t;


PACKSTRUCT( struct sl_btmesh_cmd_proxy_deny_s
{
    uint32_t handle;
    uint16_t netkey_index;
    uint16_t address;
});

typedef struct sl_btmesh_cmd_proxy_deny_s sl_btmesh_cmd_proxy_deny_t;


PACKSTRUCT( struct sl_btmesh_cmd_proxy_optimisation_toggle_s
{
    uint8_t enable;
});

typedef struct sl_btmesh_cmd_proxy_optimisation_toggle_s sl_btmesh_cmd_proxy_optimisation_toggle_t;


PACKSTRUCT( struct sl_btmesh_cmd_vendor_model_send_s
{
    uint16_t destination_address;
    int8_t va_index;
    uint16_t appkey_index;
    uint16_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint8_t nonrelayed;
    uint8_t opcode;
    uint8_t final;
    uint8array payload;
});

typedef struct sl_btmesh_cmd_vendor_model_send_s sl_btmesh_cmd_vendor_model_send_t;


PACKSTRUCT( struct sl_btmesh_cmd_vendor_model_set_publication_s
{
    uint16_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint8_t opcode;
    uint8_t final;
    uint8array payload;
});

typedef struct sl_btmesh_cmd_vendor_model_set_publication_s sl_btmesh_cmd_vendor_model_set_publication_t;


PACKSTRUCT( struct sl_btmesh_cmd_vendor_model_clear_publication_s
{
    uint16_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
});

typedef struct sl_btmesh_cmd_vendor_model_clear_publication_s sl_btmesh_cmd_vendor_model_clear_publication_t;


PACKSTRUCT( struct sl_btmesh_cmd_vendor_model_publish_s
{
    uint16_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
});

typedef struct sl_btmesh_cmd_vendor_model_publish_s sl_btmesh_cmd_vendor_model_publish_t;


PACKSTRUCT( struct sl_btmesh_cmd_vendor_model_init_s
{
    uint16_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint8_t publish;
    uint8array opcodes;
});

typedef struct sl_btmesh_cmd_vendor_model_init_s sl_btmesh_cmd_vendor_model_init_t;


PACKSTRUCT( struct sl_btmesh_cmd_vendor_model_deinit_s
{
    uint16_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
});

typedef struct sl_btmesh_cmd_vendor_model_deinit_s sl_btmesh_cmd_vendor_model_deinit_t;


PACKSTRUCT( struct sl_btmesh_cmd_vendor_model_send_tracked_s
{
    uint16_t destination_address;
    int8_t va_index;
    uint16_t appkey_index;
    uint16_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint8_t nonrelayed;
    uint8_t segment;
    uint8_t opcode;
    uint8_t final;
    uint8array payload;
});

typedef struct sl_btmesh_cmd_vendor_model_send_tracked_s sl_btmesh_cmd_vendor_model_send_tracked_t;


