espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
PACKSTRUCT( struct sl_btmesh_cmd_vendor_model_set_publication_tracked_s
{
    uint16_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint8_t segment;
    uint8_t opcode;
    uint8_t final;
    uint8array payload;
});

typedef struct sl_btmesh_cmd_vendor_model_set_publication_tracked_s sl_btmesh_cmd_vendor_model_set_publication_tracked_t;


PACKSTRUCT( struct sl_btmesh_cmd_health_client_get_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint16_t vendor_id;
});

typedef struct sl_btmesh_cmd_health_client_get_s sl_btmesh_cmd_health_client_get_t;


PACKSTRUCT( struct sl_btmesh_cmd_health_client_clear_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint16_t vendor_id;
    uint8_t reliable;
});

typedef struct sl_btmesh_cmd_health_client_clear_s sl_btmesh_cmd_health_client_clear_t;


PACKSTRUCT( struct sl_btmesh_cmd_health_client_test_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t test_id;
    uint16_t vendor_id;
    uint8_t reliable;
});

typedef struct sl_btmesh_cmd_health_client_test_s sl_btmesh_cmd_health_client_test_t;


PACKSTRUCT( struct sl_btmesh_cmd_health_client_get_period_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
});

typedef struct sl_btmesh_cmd_health_client_get_period_s sl_btmesh_cmd_health_client_get_period_t;


PACKSTRUCT( struct sl_btmesh_cmd_health_client_set_period_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t period;
    uint8_t reliable;
});

typedef struct sl_btmesh_cmd_health_client_set_period_s sl_btmesh_cmd_health_client_set_period_t;


PACKSTRUCT( struct sl_btmesh_cmd_health_client_get_attention_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
});

typedef struct sl_btmesh_cmd_health_client_get_attention_s sl_btmesh_cmd_health_client_get_attention_t;


PACKSTRUCT( struct sl_btmesh_cmd_health_client_set_attention_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t attention_sec;
    uint8_t reliable;
});

typedef struct sl_btmesh_cmd_health_client_set_attention_s sl_btmesh_cmd_health_client_set_attention_t;


PACKSTRUCT( struct sl_btmesh_cmd_health_server_set_fault_s
{
    uint16_t elem_index;
    uint8_t id;
});

typedef struct sl_btmesh_cmd_health_server_set_fault_s sl_btmesh_cmd_health_server_set_fault_t;


PACKSTRUCT( struct sl_btmesh_cmd_health_server_clear_fault_s
{
    uint16_t elem_index;
    uint8_t id;
});

typedef struct sl_btmesh_cmd_health_server_clear_fault_s sl_btmesh_cmd_health_server_clear_fault_t;


PACKSTRUCT( struct sl_btmesh_cmd_health_server_send_test_response_s
{
    uint16_t client_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint16_t vendor_id;
});

typedef struct sl_btmesh_cmd_health_server_send_test_response_s sl_btmesh_cmd_health_server_send_test_response_t;


PACKSTRUCT( struct sl_btmesh_cmd_generic_client_get_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t model_id;
    uint16_t appkey_index;
    uint8_t type;
});

typedef struct sl_btmesh_cmd_generic_client_get_s sl_btmesh_cmd_generic_client_get_t;


PACKSTRUCT( struct sl_btmesh_cmd_generic_client_set_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t model_id;
    uint16_t appkey_index;
    uint8_t tid;
    uint32_t transition_ms;
    uint16_t delay_ms;
    uint16_t flags;
    uint8_t type;
    uint8array parameters;
});

typedef struct sl_btmesh_cmd_generic_client_set_s sl_btmesh_cmd_generic_client_set_t;


PACKSTRUCT( struct sl_btmesh_cmd_generic_client_publish_s
{
    uint16_t elem_index;
    uint16_t model_id;
    uint8_t tid;
    uint32_t transition_ms;
    uint16_t delay_ms;
    uint16_t flags;
    uint8_t type;
    uint8array parameters;
});

typedef struct sl_btmesh_cmd_generic_client_publish_s sl_btmesh_cmd_generic_client_publish_t;


PACKSTRUCT( struct sl_btmesh_cmd_generic_client_get_params_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t model_id;
    uint16_t appkey_index;
    uint8_t type;
    uint8array parameters;
});

typedef struct sl_btmesh_cmd_generic_client_get_params_s sl_btmesh_cmd_generic_client_get_params_t;


PACKSTRUCT( struct sl_btmesh_cmd_generic_server_respond_s
{
    uint16_t client_address;
    uint16_t elem_index;
    uint16_t model_id;
    uint16_t appkey_index;
    uint32_t remaining_ms;
    uint16_t flags;
    uint8_t type;
    uint8array parameters;
});

typedef struct sl_btmesh_cmd_generic_server_respond_s sl_btmesh_cmd_generic_server_respond_t;


PACKSTRUCT( struct sl_btmesh_cmd_generic_server_update_s
{
    uint16_t elem_index;
    uint16_t model_id;
    uint32_t remaining_ms;
    uint8_t type;
    uint8array parameters;
});

typedef struct sl_btmesh_cmd_generic_server_update_s sl_btmesh_cmd_generic_server_update_t;


PACKSTRUCT( struct sl_btmesh_cmd_generic_server_publish_s
{
    uint16_t elem_index;
    uint16_t model_id;
    uint8_t type;
});

typedef struct sl_btmesh_cmd_generic_server_publish_s sl_btmesh_cmd_generic_server_publish_t;


PACKSTRUCT( struct sl_btmesh_cmd_generic_server_get_cached_state_s
{
    uint16_t elem_index;
    uint16_t model_id;
    uint8_t type;
});

typedef struct sl_btmesh_cmd_generic_server_get_cached_state_s sl_btmesh_cmd_generic_server_get_cached_state_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_nettx_s
{
    uint8_t count;
    uint8_t interval;
});

typedef struct sl_btmesh_cmd_test_set_nettx_s sl_btmesh_cmd_test_set_nettx_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_relay_s
{
    uint8_t enabled;
    uint8_t count;
    uint8_t interval;
});

typedef struct sl_btmesh_cmd_test_set_relay_s sl_btmesh_cmd_test_set_relay_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_adv_scan_params_s
{
    uint16_t adv_interval_min;
    uint16_t adv_interval_max;
    uint8_t adv_repeat_packets;
    uint8_t adv_use_random_address;
    uint8_t adv_channel_map;
    uint16_t scan_interval;
    uint16_t scan_window;
});

