espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
typedef struct sl_btmesh_cmd_test_set_adv_scan_params_s sl_btmesh_cmd_test_set_adv_scan_params_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_ivupdate_test_mode_s
{
    uint8_t mode;
});

typedef struct sl_btmesh_cmd_test_set_ivupdate_test_mode_s sl_btmesh_cmd_test_set_ivupdate_test_mode_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_segment_send_delay_s
{
    uint8_t delay;
});

typedef struct sl_btmesh_cmd_test_set_segment_send_delay_s sl_btmesh_cmd_test_set_segment_send_delay_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_ivupdate_state_s
{
    uint8_t state;
});

typedef struct sl_btmesh_cmd_test_set_ivupdate_state_s sl_btmesh_cmd_test_set_ivupdate_state_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_bind_local_model_app_s
{
    uint16_t elem_index;
    uint16_t appkey_index;
    uint16_t vendor_id;
    uint16_t model_id;
});

typedef struct sl_btmesh_cmd_test_bind_local_model_app_s sl_btmesh_cmd_test_bind_local_model_app_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_unbind_local_model_app_s
{
    uint16_t elem_index;
    uint16_t appkey_index;
    uint16_t vendor_id;
    uint16_t model_id;
});

typedef struct sl_btmesh_cmd_test_unbind_local_model_app_s sl_btmesh_cmd_test_unbind_local_model_app_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_add_local_model_sub_s
{
    uint16_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint16_t sub_address;
});

typedef struct sl_btmesh_cmd_test_add_local_model_sub_s sl_btmesh_cmd_test_add_local_model_sub_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_remove_local_model_sub_s
{
    uint16_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint16_t sub_address;
});

typedef struct sl_btmesh_cmd_test_remove_local_model_sub_s sl_btmesh_cmd_test_remove_local_model_sub_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_add_local_model_sub_va_s
{
    uint16_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint8array sub_address;
});

typedef struct sl_btmesh_cmd_test_add_local_model_sub_va_s sl_btmesh_cmd_test_add_local_model_sub_va_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_remove_local_model_sub_va_s
{
    uint16_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint8array sub_address;
});

typedef struct sl_btmesh_cmd_test_remove_local_model_sub_va_s sl_btmesh_cmd_test_remove_local_model_sub_va_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_get_local_model_sub_s
{
    uint16_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
});

typedef struct sl_btmesh_cmd_test_get_local_model_sub_s sl_btmesh_cmd_test_get_local_model_sub_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_local_model_pub_s
{
    uint16_t elem_index;
    uint16_t appkey_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint16_t pub_address;
    uint8_t ttl;
    uint8_t period;
    uint8_t retrans;
    uint8_t credentials;
});

typedef struct sl_btmesh_cmd_test_set_local_model_pub_s sl_btmesh_cmd_test_set_local_model_pub_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_local_model_pub_va_s
{
    uint16_t elem_index;
    uint16_t appkey_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint8_t ttl;
    uint8_t period;
    uint8_t retrans;
    uint8_t credentials;
    uint8array pub_address;
});

typedef struct sl_btmesh_cmd_test_set_local_model_pub_va_s sl_btmesh_cmd_test_set_local_model_pub_va_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_get_local_model_pub_s
{
    uint16_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
});

typedef struct sl_btmesh_cmd_test_get_local_model_pub_s sl_btmesh_cmd_test_get_local_model_pub_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_local_heartbeat_subscription_s
{
    uint16_t subscription_source;
    uint16_t subscription_destination;
    uint8_t period_log;
});

typedef struct sl_btmesh_cmd_test_set_local_heartbeat_subscription_s sl_btmesh_cmd_test_set_local_heartbeat_subscription_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_local_heartbeat_publication_s
{
    uint16_t publication_address;
    uint8_t count_log;
    uint8_t period_log;
    uint8_t ttl;
    uint16_t features;
    uint16_t publication_netkey_index;
});

typedef struct sl_btmesh_cmd_test_set_local_heartbeat_publication_s sl_btmesh_cmd_test_set_local_heartbeat_publication_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_local_config_s
{
    uint16_t id;
    uint16_t netkey_index;
    uint8array value;
});

typedef struct sl_btmesh_cmd_test_set_local_config_s sl_btmesh_cmd_test_set_local_config_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_get_local_config_s
{
    uint16_t id;
    uint16_t netkey_index;
});

typedef struct sl_btmesh_cmd_test_get_local_config_s sl_btmesh_cmd_test_get_local_config_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_add_local_key_s
{
    uint8_t key_type;
    aes_key_128 key;
    uint16_t key_index;
    uint16_t netkey_index;
});

typedef struct sl_btmesh_cmd_test_add_local_key_s sl_btmesh_cmd_test_add_local_key_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_remove_local_key_s
{
    uint8_t key_type;
    uint16_t key_index;
});

typedef struct sl_btmesh_cmd_test_remove_local_key_s sl_btmesh_cmd_test_remove_local_key_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_update_local_key_s
{
    uint8_t key_type;
    aes_key_128 key;
    uint16_t key_index;
});

typedef struct sl_btmesh_cmd_test_update_local_key_s sl_btmesh_cmd_test_update_local_key_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_sar_config_s
{
    uint32_t incomplete_timer_ms;
    uint32_t pending_ack_base_ms;
    uint32_t pending_ack_mul_ms;
    uint32_t wait_for_ack_base_ms;
    uint32_t wait_for_ack_mul_ms;
    uint8_t max_send_rounds;
});

typedef struct sl_btmesh_cmd_test_set_sar_config_s sl_btmesh_cmd_test_set_sar_config_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_adv_bearer_state_s
{
    uint8_t state;
});

typedef struct sl_btmesh_cmd_test_set_adv_bearer_state_s sl_btmesh_cmd_test_set_adv_bearer_state_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_prov_get_device_key_s
{
    uint16_t address;
});

typedef struct sl_btmesh_cmd_test_prov_get_device_key_s sl_btmesh_cmd_test_prov_get_device_key_t;


