espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
PACKSTRUCT( struct sl_btmesh_cmd_test_prov_prepare_key_refresh_s
{
    aes_key_128 net_key;
    uint8array app_keys;
});

typedef struct sl_btmesh_cmd_test_prov_prepare_key_refresh_s sl_btmesh_cmd_test_prov_prepare_key_refresh_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_cancel_segmented_tx_s
{
    uint16_t src_addr;
    uint16_t dst_addr;
});

typedef struct sl_btmesh_cmd_test_cancel_segmented_tx_s sl_btmesh_cmd_test_cancel_segmented_tx_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_iv_index_s
{
    uint32_t iv_index;
});

typedef struct sl_btmesh_cmd_test_set_iv_index_s sl_btmesh_cmd_test_set_iv_index_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_element_seqnum_s
{
    uint16_t elem_index;
    uint32_t seqnum;
});

typedef struct sl_btmesh_cmd_test_set_element_seqnum_s sl_btmesh_cmd_test_set_element_seqnum_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_model_option_s
{
    uint16_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint8_t option;
    uint32_t value;
});

typedef struct sl_btmesh_cmd_test_set_model_option_s sl_btmesh_cmd_test_set_model_option_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_get_local_model_app_bindings_s
{
    uint16_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
});

typedef struct sl_btmesh_cmd_test_get_local_model_app_bindings_s sl_btmesh_cmd_test_get_local_model_app_bindings_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_get_replay_protection_list_entry_s
{
    uint16_t address;
});

typedef struct sl_btmesh_cmd_test_get_replay_protection_list_entry_s sl_btmesh_cmd_test_get_replay_protection_list_entry_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_clear_replay_protection_list_entry_s
{
    uint16_t address;
});

typedef struct sl_btmesh_cmd_test_clear_replay_protection_list_entry_s sl_btmesh_cmd_test_clear_replay_protection_list_entry_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_replay_protection_list_diagnostics_s
{
    uint8_t enable;
});

typedef struct sl_btmesh_cmd_test_set_replay_protection_list_diagnostics_s sl_btmesh_cmd_test_set_replay_protection_list_diagnostics_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_get_model_option_s
{
    uint16_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint8_t option;
});

typedef struct sl_btmesh_cmd_test_get_model_option_s sl_btmesh_cmd_test_get_model_option_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_default_ttl_s
{
    uint8_t set_value;
});

typedef struct sl_btmesh_cmd_test_set_default_ttl_s sl_btmesh_cmd_test_set_default_ttl_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_gatt_proxy_s
{
    uint8_t set_value;
});

typedef struct sl_btmesh_cmd_test_set_gatt_proxy_s sl_btmesh_cmd_test_set_gatt_proxy_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_get_identity_s
{
    uint16_t get_netkey_index;
});

typedef struct sl_btmesh_cmd_test_get_identity_s sl_btmesh_cmd_test_get_identity_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_identity_s
{
    uint16_t set_netkey_index;
    uint8_t set_value;
});

typedef struct sl_btmesh_cmd_test_set_identity_s sl_btmesh_cmd_test_set_identity_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_friend_s
{
    uint8_t set_value;
});

typedef struct sl_btmesh_cmd_test_set_friend_s sl_btmesh_cmd_test_set_friend_t;


PACKSTRUCT( struct sl_btmesh_cmd_test_set_beacon_s
{
    uint8_t set_value;
});

typedef struct sl_btmesh_cmd_test_set_beacon_s sl_btmesh_cmd_test_set_beacon_t;


PACKSTRUCT( struct sl_btmesh_cmd_lpn_establish_friendship_s
{
    uint16_t netkey_index;
});

typedef struct sl_btmesh_cmd_lpn_establish_friendship_s sl_btmesh_cmd_lpn_establish_friendship_t;


PACKSTRUCT( struct sl_btmesh_cmd_lpn_poll_s
{
    uint16_t netkey_index;
});

typedef struct sl_btmesh_cmd_lpn_poll_s sl_btmesh_cmd_lpn_poll_t;


PACKSTRUCT( struct sl_btmesh_cmd_lpn_terminate_friendship_s
{
    uint16_t netkey_index;
});

typedef struct sl_btmesh_cmd_lpn_terminate_friendship_s sl_btmesh_cmd_lpn_terminate_friendship_t;


PACKSTRUCT( struct sl_btmesh_cmd_lpn_config_s
{
    uint8_t setting_id;
    uint32_t value;
});

typedef struct sl_btmesh_cmd_lpn_config_s sl_btmesh_cmd_lpn_config_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_cancel_request_s
{
    uint32_t handle;
});

typedef struct sl_btmesh_cmd_config_client_cancel_request_s sl_btmesh_cmd_config_client_cancel_request_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_get_request_status_s
{
    uint32_t handle;
});

typedef struct sl_btmesh_cmd_config_client_get_request_status_s sl_btmesh_cmd_config_client_get_request_status_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_set_default_timeout_s
{
    uint32_t timeout_ms;
    uint32_t lpn_timeout_ms;
});

typedef struct sl_btmesh_cmd_config_client_set_default_timeout_s sl_btmesh_cmd_config_client_set_default_timeout_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_add_netkey_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint16_t netkey_index;
});

typedef struct sl_btmesh_cmd_config_client_add_netkey_s sl_btmesh_cmd_config_client_add_netkey_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_remove_netkey_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint16_t netkey_index;
});

typedef struct sl_btmesh_cmd_config_client_remove_netkey_s sl_btmesh_cmd_config_client_remove_netkey_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_list_netkeys_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
});

typedef struct sl_btmesh_cmd_config_client_list_netkeys_s sl_btmesh_cmd_config_client_list_netkeys_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_add_appkey_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint16_t appkey_index;
    uint16_t netkey_index;
});

typedef struct sl_btmesh_cmd_config_client_add_appkey_s sl_btmesh_cmd_config_client_add_appkey_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_remove_appkey_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint16_t appkey_index;
    uint16_t netkey_index;
});

typedef struct sl_btmesh_cmd_config_client_remove_appkey_s sl_btmesh_cmd_config_client_remove_appkey_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_list_appkeys_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint16_t netkey_index;
});

typedef struct sl_btmesh_cmd_config_client_list_appkeys_s sl_btmesh_cmd_config_client_list_appkeys_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_bind_model_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint16_t appkey_index;
});

typedef struct sl_btmesh_cmd_config_client_bind_model_s sl_btmesh_cmd_config_client_bind_model_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_unbind_model_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint16_t appkey_index;
});

typedef struct sl_btmesh_cmd_config_client_unbind_model_s sl_btmesh_cmd_config_client_unbind_model_t;


