espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
PACKSTRUCT( struct sl_btmesh_cmd_config_client_list_bindings_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
});

typedef struct sl_btmesh_cmd_config_client_list_bindings_s sl_btmesh_cmd_config_client_list_bindings_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_get_model_pub_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
});

typedef struct sl_btmesh_cmd_config_client_get_model_pub_s sl_btmesh_cmd_config_client_get_model_pub_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_set_model_pub_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint16_t address;
    uint16_t appkey_index;
    uint8_t credentials;
    uint8_t ttl;
    uint32_t period_ms;
    uint8_t retransmit_count;
    uint16_t retransmit_interval_ms;
});

typedef struct sl_btmesh_cmd_config_client_set_model_pub_s sl_btmesh_cmd_config_client_set_model_pub_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_set_model_pub_va_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uuid_128 address;
    uint16_t appkey_index;
    uint8_t credentials;
    uint8_t ttl;
    uint32_t period_ms;
    uint8_t retransmit_count;
    uint16_t retransmit_interval_ms;
});

typedef struct sl_btmesh_cmd_config_client_set_model_pub_va_s sl_btmesh_cmd_config_client_set_model_pub_va_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_add_model_sub_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint16_t sub_address;
});

typedef struct sl_btmesh_cmd_config_client_add_model_sub_s sl_btmesh_cmd_config_client_add_model_sub_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_add_model_sub_va_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uuid_128 sub_address;
});

typedef struct sl_btmesh_cmd_config_client_add_model_sub_va_s sl_btmesh_cmd_config_client_add_model_sub_va_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_remove_model_sub_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint16_t sub_address;
});

typedef struct sl_btmesh_cmd_config_client_remove_model_sub_s sl_btmesh_cmd_config_client_remove_model_sub_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_remove_model_sub_va_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uuid_128 sub_address;
});

typedef struct sl_btmesh_cmd_config_client_remove_model_sub_va_s sl_btmesh_cmd_config_client_remove_model_sub_va_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_set_model_sub_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uint16_t sub_address;
});

typedef struct sl_btmesh_cmd_config_client_set_model_sub_s sl_btmesh_cmd_config_client_set_model_sub_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_set_model_sub_va_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
    uuid_128 sub_address;
});

typedef struct sl_btmesh_cmd_config_client_set_model_sub_va_s sl_btmesh_cmd_config_client_set_model_sub_va_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_clear_model_sub_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
});

typedef struct sl_btmesh_cmd_config_client_clear_model_sub_s sl_btmesh_cmd_config_client_clear_model_sub_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_list_subs_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t elem_index;
    uint16_t vendor_id;
    uint16_t model_id;
});

typedef struct sl_btmesh_cmd_config_client_list_subs_s sl_btmesh_cmd_config_client_list_subs_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_get_heartbeat_pub_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
});

typedef struct sl_btmesh_cmd_config_client_get_heartbeat_pub_s sl_btmesh_cmd_config_client_get_heartbeat_pub_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_set_heartbeat_pub_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint16_t destination_address;
    uint16_t netkey_index;
    uint8_t count_log;
    uint8_t period_log;
    uint8_t ttl;
    uint16_t features;
});

typedef struct sl_btmesh_cmd_config_client_set_heartbeat_pub_s sl_btmesh_cmd_config_client_set_heartbeat_pub_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_get_heartbeat_sub_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
});

typedef struct sl_btmesh_cmd_config_client_get_heartbeat_sub_s sl_btmesh_cmd_config_client_get_heartbeat_sub_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_set_heartbeat_sub_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint16_t source_address;
    uint16_t destination_address;
    uint8_t period_log;
});

typedef struct sl_btmesh_cmd_config_client_set_heartbeat_sub_s sl_btmesh_cmd_config_client_set_heartbeat_sub_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_get_beacon_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
});

typedef struct sl_btmesh_cmd_config_client_get_beacon_s sl_btmesh_cmd_config_client_get_beacon_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_set_beacon_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t value;
});

typedef struct sl_btmesh_cmd_config_client_set_beacon_s sl_btmesh_cmd_config_client_set_beacon_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_get_default_ttl_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
});

typedef struct sl_btmesh_cmd_config_client_get_default_ttl_s sl_btmesh_cmd_config_client_get_default_ttl_t;


