espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
PACKSTRUCT( struct sl_btmesh_cmd_config_client_set_default_ttl_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t value;
});

typedef struct sl_btmesh_cmd_config_client_set_default_ttl_s sl_btmesh_cmd_config_client_set_default_ttl_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_get_gatt_proxy_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
});

typedef struct sl_btmesh_cmd_config_client_get_gatt_proxy_s sl_btmesh_cmd_config_client_get_gatt_proxy_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_set_gatt_proxy_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t value;
});

typedef struct sl_btmesh_cmd_config_client_set_gatt_proxy_s sl_btmesh_cmd_config_client_set_gatt_proxy_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_get_relay_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
});

typedef struct sl_btmesh_cmd_config_client_get_relay_s sl_btmesh_cmd_config_client_get_relay_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_set_relay_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t value;
    uint8_t retransmit_count;
    uint16_t retransmit_interval_ms;
});

typedef struct sl_btmesh_cmd_config_client_set_relay_s sl_btmesh_cmd_config_client_set_relay_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_get_network_transmit_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
});

typedef struct sl_btmesh_cmd_config_client_get_network_transmit_s sl_btmesh_cmd_config_client_get_network_transmit_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_set_network_transmit_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t transmit_count;
    uint16_t transmit_interval_ms;
});

typedef struct sl_btmesh_cmd_config_client_set_network_transmit_s sl_btmesh_cmd_config_client_set_network_transmit_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_get_identity_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint16_t netkey_index;
});

typedef struct sl_btmesh_cmd_config_client_get_identity_s sl_btmesh_cmd_config_client_get_identity_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_set_identity_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint16_t netkey_index;
    uint8_t value;
});

typedef struct sl_btmesh_cmd_config_client_set_identity_s sl_btmesh_cmd_config_client_set_identity_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_get_friend_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
});

typedef struct sl_btmesh_cmd_config_client_get_friend_s sl_btmesh_cmd_config_client_get_friend_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_set_friend_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t value;
});

typedef struct sl_btmesh_cmd_config_client_set_friend_s sl_btmesh_cmd_config_client_set_friend_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_get_key_refresh_phase_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint16_t netkey_index;
});

typedef struct sl_btmesh_cmd_config_client_get_key_refresh_phase_s sl_btmesh_cmd_config_client_get_key_refresh_phase_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_get_lpn_polltimeout_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint16_t lpn_address;
});

typedef struct sl_btmesh_cmd_config_client_get_lpn_polltimeout_s sl_btmesh_cmd_config_client_get_lpn_polltimeout_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_get_dcd_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
    uint8_t page;
});

typedef struct sl_btmesh_cmd_config_client_get_dcd_s sl_btmesh_cmd_config_client_get_dcd_t;


PACKSTRUCT( struct sl_btmesh_cmd_config_client_reset_node_s
{
    uint16_t enc_netkey_index;
    uint16_t server_address;
});

typedef struct sl_btmesh_cmd_config_client_reset_node_s sl_btmesh_cmd_config_client_reset_node_t;


PACKSTRUCT( struct sl_btmesh_cmd_sensor_server_init_s
{
    uint16_t elem_index;
    uint8array descriptors;
});

typedef struct sl_btmesh_cmd_sensor_server_init_s sl_btmesh_cmd_sensor_server_init_t;


PACKSTRUCT( struct sl_btmesh_cmd_sensor_server_deinit_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_sensor_server_deinit_s sl_btmesh_cmd_sensor_server_deinit_t;


PACKSTRUCT( struct sl_btmesh_cmd_sensor_server_send_descriptor_status_s
{
    uint16_t client_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint8array descriptors;
});

typedef struct sl_btmesh_cmd_sensor_server_send_descriptor_status_s sl_btmesh_cmd_sensor_server_send_descriptor_status_t;


PACKSTRUCT( struct sl_btmesh_cmd_sensor_server_send_status_s
{
    uint16_t client_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint8array sensor_data;
});

typedef struct sl_btmesh_cmd_sensor_server_send_status_s sl_btmesh_cmd_sensor_server_send_status_t;


PACKSTRUCT( struct sl_btmesh_cmd_sensor_server_send_column_status_s
{
    uint16_t client_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint16_t property_id;
    uint8array sensor_data;
});

typedef struct sl_btmesh_cmd_sensor_server_send_column_status_s sl_btmesh_cmd_sensor_server_send_column_status_t;


PACKSTRUCT( struct sl_btmesh_cmd_sensor_server_send_series_status_s
{
    uint16_t client_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint16_t property_id;
    uint8array sensor_data;
});

typedef struct sl_btmesh_cmd_sensor_server_send_series_status_s sl_btmesh_cmd_sensor_server_send_series_status_t;


PACKSTRUCT( struct sl_btmesh_cmd_sensor_setup_server_send_cadence_status_s
{
    uint16_t client_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint16_t property_id;
    uint8array params;
});

typedef struct sl_btmesh_cmd_sensor_setup_server_send_cadence_status_s sl_btmesh_cmd_sensor_setup_server_send_cadence_status_t;


PACKSTRUCT( struct sl_btmesh_cmd_sensor_setup_server_send_settings_status_s
{
    uint16_t client_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint16_t property_id;
    uint8array setting_ids;
});

typedef struct sl_btmesh_cmd_sensor_setup_server_send_settings_status_s sl_btmesh_cmd_sensor_setup_server_send_settings_status_t;


PACKSTRUCT( struct sl_btmesh_cmd_sensor_setup_server_send_setting_status_s
{
    uint16_t client_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint16_t property_id;
    uint16_t setting_id;
    uint8array raw_value;
});

typedef struct sl_btmesh_cmd_sensor_setup_server_send_setting_status_s sl_btmesh_cmd_sensor_setup_server_send_setting_status_t;


PACKSTRUCT( struct sl_btmesh_cmd_sensor_client_get_descriptor_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint16_t property_id;
});

typedef struct sl_btmesh_cmd_sensor_client_get_descriptor_s sl_btmesh_cmd_sensor_client_get_descriptor_t;


PACKSTRUCT( struct sl_btmesh_cmd_sensor_client_get_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint16_t property_id;
});

