espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
typedef struct sl_btmesh_cmd_sensor_client_get_s sl_btmesh_cmd_sensor_client_get_t;


PACKSTRUCT( struct sl_btmesh_cmd_sensor_client_get_column_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint16_t property_id;
    uint8array column_id;
});

typedef struct sl_btmesh_cmd_sensor_client_get_column_s sl_btmesh_cmd_sensor_client_get_column_t;


PACKSTRUCT( struct sl_btmesh_cmd_sensor_client_get_series_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint16_t property_id;
    uint8array column_ids;
});

typedef struct sl_btmesh_cmd_sensor_client_get_series_s sl_btmesh_cmd_sensor_client_get_series_t;


PACKSTRUCT( struct sl_btmesh_cmd_sensor_client_get_cadence_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint16_t property_id;
});

typedef struct sl_btmesh_cmd_sensor_client_get_cadence_s sl_btmesh_cmd_sensor_client_get_cadence_t;


PACKSTRUCT( struct sl_btmesh_cmd_sensor_client_set_cadence_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint16_t property_id;
    uint8array params;
});

typedef struct sl_btmesh_cmd_sensor_client_set_cadence_s sl_btmesh_cmd_sensor_client_set_cadence_t;


PACKSTRUCT( struct sl_btmesh_cmd_sensor_client_get_settings_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint16_t property_id;
});

typedef struct sl_btmesh_cmd_sensor_client_get_settings_s sl_btmesh_cmd_sensor_client_get_settings_t;


PACKSTRUCT( struct sl_btmesh_cmd_sensor_client_get_setting_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint16_t property_id;
    uint16_t setting_id;
});

typedef struct sl_btmesh_cmd_sensor_client_get_setting_s sl_btmesh_cmd_sensor_client_get_setting_t;


PACKSTRUCT( struct sl_btmesh_cmd_sensor_client_set_setting_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint16_t property_id;
    uint16_t setting_id;
    uint8array raw_value;
});

typedef struct sl_btmesh_cmd_sensor_client_set_setting_s sl_btmesh_cmd_sensor_client_set_setting_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_client_init_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_lc_client_init_s sl_btmesh_cmd_lc_client_init_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_client_get_mode_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
});

typedef struct sl_btmesh_cmd_lc_client_get_mode_s sl_btmesh_cmd_lc_client_get_mode_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_client_set_mode_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint8_t mode;
});

typedef struct sl_btmesh_cmd_lc_client_set_mode_s sl_btmesh_cmd_lc_client_set_mode_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_client_get_om_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
});

typedef struct sl_btmesh_cmd_lc_client_get_om_s sl_btmesh_cmd_lc_client_get_om_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_client_set_om_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint8_t mode;
});

typedef struct sl_btmesh_cmd_lc_client_set_om_s sl_btmesh_cmd_lc_client_set_om_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_client_get_light_onoff_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
});

typedef struct sl_btmesh_cmd_lc_client_get_light_onoff_s sl_btmesh_cmd_lc_client_get_light_onoff_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_client_set_light_onoff_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint8_t target_state;
    uint8_t tid;
    uint32_t transition_time_ms;
    uint16_t message_delay_ms;
});

typedef struct sl_btmesh_cmd_lc_client_set_light_onoff_s sl_btmesh_cmd_lc_client_set_light_onoff_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_client_get_property_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint16_t property_id;
});

typedef struct sl_btmesh_cmd_lc_client_get_property_s sl_btmesh_cmd_lc_client_get_property_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_client_set_property_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint16_t property_id;
    uint8array params;
});

typedef struct sl_btmesh_cmd_lc_client_set_property_s sl_btmesh_cmd_lc_client_set_property_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_server_init_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_lc_server_init_s sl_btmesh_cmd_lc_server_init_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_server_deinit_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_lc_server_deinit_s sl_btmesh_cmd_lc_server_deinit_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_server_update_mode_s
{
    uint16_t elem_index;
    uint8_t mode;
});

typedef struct sl_btmesh_cmd_lc_server_update_mode_s sl_btmesh_cmd_lc_server_update_mode_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_server_update_om_s
{
    uint16_t elem_index;
    uint8_t om;
});

typedef struct sl_btmesh_cmd_lc_server_update_om_s sl_btmesh_cmd_lc_server_update_om_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_server_update_light_onoff_s
{
    uint16_t elem_index;
    uint8_t light_onoff;
    uint32_t transition_time_ms;
});

typedef struct sl_btmesh_cmd_lc_server_update_light_onoff_s sl_btmesh_cmd_lc_server_update_light_onoff_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_server_init_all_properties_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_lc_server_init_all_properties_s sl_btmesh_cmd_lc_server_init_all_properties_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_server_set_publish_mask_s
{
    uint16_t elem_index;
    uint16_t status_type;
    uint8_t value;
});

typedef struct sl_btmesh_cmd_lc_server_set_publish_mask_s sl_btmesh_cmd_lc_server_set_publish_mask_t;


