espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
PACKSTRUCT( struct sl_btmesh_cmd_lc_server_set_regulator_interval_s
{
    uint16_t elem_index;
    uint8_t value;
});

typedef struct sl_btmesh_cmd_lc_server_set_regulator_interval_s sl_btmesh_cmd_lc_server_set_regulator_interval_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_server_set_event_mask_s
{
    uint16_t elem_index;
    uint16_t event_type;
    uint8_t value;
});

typedef struct sl_btmesh_cmd_lc_server_set_event_mask_s sl_btmesh_cmd_lc_server_set_event_mask_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_server_get_lc_state_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_lc_server_get_lc_state_s sl_btmesh_cmd_lc_server_get_lc_state_t;


PACKSTRUCT( struct sl_btmesh_cmd_lc_setup_server_update_property_s
{
    uint16_t elem_index;
    uint16_t property_id;
    uint8array params;
});

typedef struct sl_btmesh_cmd_lc_setup_server_update_property_s sl_btmesh_cmd_lc_setup_server_update_property_t;


PACKSTRUCT( struct sl_btmesh_cmd_scene_client_init_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_scene_client_init_s sl_btmesh_cmd_scene_client_init_t;


PACKSTRUCT( struct sl_btmesh_cmd_scene_client_get_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
});

typedef struct sl_btmesh_cmd_scene_client_get_s sl_btmesh_cmd_scene_client_get_t;


PACKSTRUCT( struct sl_btmesh_cmd_scene_client_get_register_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
});

typedef struct sl_btmesh_cmd_scene_client_get_register_s sl_btmesh_cmd_scene_client_get_register_t;


PACKSTRUCT( struct sl_btmesh_cmd_scene_client_recall_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t selected_scene;
    uint16_t appkey_index;
    uint8_t flags;
    uint8_t tid;
    uint32_t transition_time_ms;
    uint16_t delay_ms;
});

typedef struct sl_btmesh_cmd_scene_client_recall_s sl_btmesh_cmd_scene_client_recall_t;


PACKSTRUCT( struct sl_btmesh_cmd_scene_client_store_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t selected_scene;
    uint16_t appkey_index;
    uint8_t flags;
});

typedef struct sl_btmesh_cmd_scene_client_store_s sl_btmesh_cmd_scene_client_store_t;


PACKSTRUCT( struct sl_btmesh_cmd_scene_client_delete_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t selected_scene;
    uint16_t appkey_index;
    uint8_t flags;
});

typedef struct sl_btmesh_cmd_scene_client_delete_s sl_btmesh_cmd_scene_client_delete_t;


PACKSTRUCT( struct sl_btmesh_cmd_scene_server_init_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_scene_server_init_s sl_btmesh_cmd_scene_server_init_t;


PACKSTRUCT( struct sl_btmesh_cmd_scene_server_deinit_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_scene_server_deinit_s sl_btmesh_cmd_scene_server_deinit_t;


PACKSTRUCT( struct sl_btmesh_cmd_scene_server_reset_register_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_scene_server_reset_register_s sl_btmesh_cmd_scene_server_reset_register_t;


PACKSTRUCT( struct sl_btmesh_cmd_scene_setup_server_init_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_scene_setup_server_init_s sl_btmesh_cmd_scene_setup_server_init_t;


PACKSTRUCT( struct sl_btmesh_cmd_scheduler_client_init_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_scheduler_client_init_s sl_btmesh_cmd_scheduler_client_init_t;


PACKSTRUCT( struct sl_btmesh_cmd_scheduler_client_deinit_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_scheduler_client_deinit_s sl_btmesh_cmd_scheduler_client_deinit_t;


PACKSTRUCT( struct sl_btmesh_cmd_scheduler_client_get_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
});

typedef struct sl_btmesh_cmd_scheduler_client_get_s sl_btmesh_cmd_scheduler_client_get_t;


PACKSTRUCT( struct sl_btmesh_cmd_scheduler_client_get_action_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t index;
});

typedef struct sl_btmesh_cmd_scheduler_client_get_action_s sl_btmesh_cmd_scheduler_client_get_action_t;


PACKSTRUCT( struct sl_btmesh_cmd_scheduler_client_set_action_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t flags;
    uint8_t index;
    uint8_t year;
    uint16_t month;
    uint8_t day;
    uint8_t hour;
    uint8_t minute;
    uint8_t second;
    uint8_t day_of_week;
    uint8_t action;
    uint32_t transition_time_ms;
    uint16_t scene_number;
});

typedef struct sl_btmesh_cmd_scheduler_client_set_action_s sl_btmesh_cmd_scheduler_client_set_action_t;


PACKSTRUCT( struct sl_btmesh_cmd_scheduler_server_init_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_scheduler_server_init_s sl_btmesh_cmd_scheduler_server_init_t;


PACKSTRUCT( struct sl_btmesh_cmd_scheduler_server_deinit_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_scheduler_server_deinit_s sl_btmesh_cmd_scheduler_server_deinit_t;


PACKSTRUCT( struct sl_btmesh_cmd_scheduler_server_get_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_scheduler_server_get_s sl_btmesh_cmd_scheduler_server_get_t;


PACKSTRUCT( struct sl_btmesh_cmd_scheduler_server_get_action_s
{
    uint16_t elem_index;
    uint8_t index;
});

typedef struct sl_btmesh_cmd_scheduler_server_get_action_s sl_btmesh_cmd_scheduler_server_get_action_t;


PACKSTRUCT( struct sl_btmesh_cmd_scheduler_server_set_action_s
{
    uint16_t elem_index;
    uint8_t index;
    uint8_t year;
    uint16_t month;
    uint8_t day;
    uint8_t hour;
    uint8_t minute;
    uint8_t second;
    uint8_t day_of_week;
    uint8_t action;
    uint32_t transition_time_ms;
    uint16_t scene_number;
});

typedef struct sl_btmesh_cmd_scheduler_server_set_action_s sl_btmesh_cmd_scheduler_server_set_action_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_server_init_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_time_server_init_s sl_btmesh_cmd_time_server_init_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_server_deinit_s
{
    uint16_t elem_index;
});

