espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
typedef struct sl_btmesh_cmd_time_server_deinit_s sl_btmesh_cmd_time_server_deinit_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_server_get_time_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_time_server_get_time_s sl_btmesh_cmd_time_server_get_time_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_server_set_time_s
{
    uint16_t elem_index;
    uint64_t tai_seconds;
    uint8_t subsecond;
    uint8_t uncertainty;
    uint8_t time_authority;
    int16_t time_zone_offset;
    int32_t tai_utc_delta;
});

typedef struct sl_btmesh_cmd_time_server_set_time_s sl_btmesh_cmd_time_server_set_time_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_server_get_time_zone_offset_new_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_time_server_get_time_zone_offset_new_s sl_btmesh_cmd_time_server_get_time_zone_offset_new_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_server_set_time_zone_offset_new_s
{
    uint16_t elem_index;
    int16_t new_offset;
    uint64_t tai_of_zone_change;
});

typedef struct sl_btmesh_cmd_time_server_set_time_zone_offset_new_s sl_btmesh_cmd_time_server_set_time_zone_offset_new_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_server_get_tai_utc_delta_new_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_time_server_get_tai_utc_delta_new_s sl_btmesh_cmd_time_server_get_tai_utc_delta_new_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_server_set_tai_utc_delta_new_s
{
    uint16_t elem_index;
    int32_t new_delta;
    uint64_t tai_of_delta_change;
});

typedef struct sl_btmesh_cmd_time_server_set_tai_utc_delta_new_s sl_btmesh_cmd_time_server_set_tai_utc_delta_new_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_server_get_time_role_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_time_server_get_time_role_s sl_btmesh_cmd_time_server_get_time_role_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_server_set_time_role_s
{
    uint16_t elem_index;
    uint8_t time_role;
});

typedef struct sl_btmesh_cmd_time_server_set_time_role_s sl_btmesh_cmd_time_server_set_time_role_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_server_get_datetime_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_time_server_get_datetime_s sl_btmesh_cmd_time_server_get_datetime_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_server_publish_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_time_server_publish_s sl_btmesh_cmd_time_server_publish_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_server_status_s
{
    uint16_t destination_address;
    uint16_t elem_index;
    uint16_t appkey_index;
});

typedef struct sl_btmesh_cmd_time_server_status_s sl_btmesh_cmd_time_server_status_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_client_init_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_time_client_init_s sl_btmesh_cmd_time_client_init_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_client_deinit_s
{
    uint16_t elem_index;
});

typedef struct sl_btmesh_cmd_time_client_deinit_s sl_btmesh_cmd_time_client_deinit_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_client_get_time_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
});

typedef struct sl_btmesh_cmd_time_client_get_time_s sl_btmesh_cmd_time_client_get_time_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_client_set_time_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint64_t tai_seconds;
    uint8_t subsecond;
    uint8_t uncertainty;
    uint8_t time_authority;
    int32_t tai_utc_delta;
    int16_t time_zone_offset;
});

typedef struct sl_btmesh_cmd_time_client_set_time_s sl_btmesh_cmd_time_client_set_time_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_client_get_time_zone_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
});

typedef struct sl_btmesh_cmd_time_client_get_time_zone_s sl_btmesh_cmd_time_client_get_time_zone_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_client_set_time_zone_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    int16_t time_zone_offset_new;
    uint64_t tai_of_zone_change;
});

typedef struct sl_btmesh_cmd_time_client_set_time_zone_s sl_btmesh_cmd_time_client_set_time_zone_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_client_get_tai_utc_delta_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
});

typedef struct sl_btmesh_cmd_time_client_get_tai_utc_delta_s sl_btmesh_cmd_time_client_get_tai_utc_delta_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_client_set_tai_utc_delta_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    int32_t tai_utc_delta_new;
    uint64_t tai_of_delta_change;
});

typedef struct sl_btmesh_cmd_time_client_set_tai_utc_delta_s sl_btmesh_cmd_time_client_set_tai_utc_delta_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_client_get_time_role_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
});

typedef struct sl_btmesh_cmd_time_client_get_time_role_s sl_btmesh_cmd_time_client_get_time_role_t;


PACKSTRUCT( struct sl_btmesh_cmd_time_client_set_time_role_s
{
    uint16_t server_address;
    uint16_t elem_index;
    uint16_t appkey_index;
    uint8_t time_role;
});

typedef struct sl_btmesh_cmd_time_client_set_time_role_s sl_btmesh_cmd_time_client_set_time_role_t;




PACKSTRUCT( struct sl_btmesh_rsp_node_init_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_init_s sl_btmesh_rsp_node_init_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_set_exportable_keys_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_set_exportable_keys_s sl_btmesh_rsp_node_set_exportable_keys_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_start_unprov_beaconing_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_start_unprov_beaconing_s sl_btmesh_rsp_node_start_unprov_beaconing_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_stop_unprov_beaconing_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_stop_unprov_beaconing_s sl_btmesh_rsp_node_stop_unprov_beaconing_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_get_rssi_s
{
    uint16_t result;
    int8_t rssi;
});

