espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
typedef struct sl_btmesh_rsp_node_get_rssi_s sl_btmesh_rsp_node_get_rssi_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_send_input_oob_request_response_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_send_input_oob_request_response_s sl_btmesh_rsp_node_send_input_oob_request_response_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_get_uuid_s
{
    uint16_t result;
    uuid_128 uuid;
});

typedef struct sl_btmesh_rsp_node_get_uuid_s sl_btmesh_rsp_node_get_uuid_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_set_provisioning_data_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_set_provisioning_data_s sl_btmesh_rsp_node_set_provisioning_data_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_init_oob_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_init_oob_s sl_btmesh_rsp_node_init_oob_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_set_ivrecovery_mode_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_set_ivrecovery_mode_s sl_btmesh_rsp_node_set_ivrecovery_mode_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_get_ivrecovery_mode_s
{
    uint16_t result;
    uint8_t mode;
});

typedef struct sl_btmesh_rsp_node_get_ivrecovery_mode_s sl_btmesh_rsp_node_get_ivrecovery_mode_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_get_statistics_s
{
    uint16_t result;
    uint8array statistics;
});

typedef struct sl_btmesh_rsp_node_get_statistics_s sl_btmesh_rsp_node_get_statistics_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_clear_statistics_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_clear_statistics_s sl_btmesh_rsp_node_clear_statistics_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_set_net_relay_delay_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_set_net_relay_delay_s sl_btmesh_rsp_node_set_net_relay_delay_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_get_net_relay_delay_s
{
    uint16_t result;
    uint8_t min_ms;
    uint8_t max_ms;
});

typedef struct sl_btmesh_rsp_node_get_net_relay_delay_s sl_btmesh_rsp_node_get_net_relay_delay_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_get_ivupdate_state_s
{
    uint16_t result;
    uint32_t iv_index;
    uint8_t state;
});

typedef struct sl_btmesh_rsp_node_get_ivupdate_state_s sl_btmesh_rsp_node_get_ivupdate_state_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_request_ivupdate_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_request_ivupdate_s sl_btmesh_rsp_node_request_ivupdate_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_get_seq_remaining_s
{
    uint16_t result;
    uint32_t count;
});

typedef struct sl_btmesh_rsp_node_get_seq_remaining_s sl_btmesh_rsp_node_get_seq_remaining_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_save_replay_protection_list_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_save_replay_protection_list_s sl_btmesh_rsp_node_save_replay_protection_list_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_set_uuid_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_set_uuid_s sl_btmesh_rsp_node_set_uuid_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_get_replay_protection_list_status_s
{
    uint16_t result;
    uint16_t total_entries;
    uint16_t unsaved_entries;
});

typedef struct sl_btmesh_rsp_node_get_replay_protection_list_status_s sl_btmesh_rsp_node_get_replay_protection_list_status_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_get_element_address_s
{
    uint16_t result;
    uint16_t address;
});

typedef struct sl_btmesh_rsp_node_get_element_address_s sl_btmesh_rsp_node_get_element_address_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_send_static_oob_request_response_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_send_static_oob_request_response_s sl_btmesh_rsp_node_send_static_oob_request_response_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_reset_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_reset_s sl_btmesh_rsp_node_reset_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_set_beacon_reporting_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_set_beacon_reporting_s sl_btmesh_rsp_node_set_beacon_reporting_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_set_iv_update_age_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_set_iv_update_age_s sl_btmesh_rsp_node_set_iv_update_age_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_get_key_count_s
{
    uint16_t result;
    uint32_t count;
});

typedef struct sl_btmesh_rsp_node_get_key_count_s sl_btmesh_rsp_node_get_key_count_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_get_key_s
{
    uint16_t result;
    uint16_t id;
    uint16_t netkey_index;
    aes_key_128 key;
});

typedef struct sl_btmesh_rsp_node_get_key_s sl_btmesh_rsp_node_get_key_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_get_networks_s
{
    uint16_t result;
    uint8array networks;
});

typedef struct sl_btmesh_rsp_node_get_networks_s sl_btmesh_rsp_node_get_networks_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_get_element_seqnum_s
{
    uint16_t result;
    uint32_t seqnum;
});

typedef struct sl_btmesh_rsp_node_get_element_seqnum_s sl_btmesh_rsp_node_get_element_seqnum_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_set_model_option_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_set_model_option_s sl_btmesh_rsp_node_set_model_option_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_get_local_dcd_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_get_local_dcd_s sl_btmesh_rsp_node_get_local_dcd_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_power_off_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_power_off_s sl_btmesh_rsp_node_power_off_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_set_adv_phy_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_set_adv_phy_s sl_btmesh_rsp_node_set_adv_phy_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_get_adv_phy_s
{
    uint16_t result;
    uint8_t phy;
});

typedef struct sl_btmesh_rsp_node_get_adv_phy_s sl_btmesh_rsp_node_get_adv_phy_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_set_unprov_beaconing_adv_interval_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_set_unprov_beaconing_adv_interval_s sl_btmesh_rsp_node_set_unprov_beaconing_adv_interval_t;


PACKSTRUCT( struct sl_btmesh_rsp_node_set_proxy_service_adv_interval_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_set_proxy_service_adv_interval_s sl_btmesh_rsp_node_set_proxy_service_adv_interval_t;


