espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
PACKSTRUCT( struct sl_btmesh_rsp_node_set_provisioning_service_adv_interval_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_node_set_provisioning_service_adv_interval_s sl_btmesh_rsp_node_set_provisioning_service_adv_interval_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_init_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_init_s sl_btmesh_rsp_prov_init_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_scan_unprov_beacons_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_scan_unprov_beacons_s sl_btmesh_rsp_prov_scan_unprov_beacons_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_create_provisioning_session_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_create_provisioning_session_s sl_btmesh_rsp_prov_create_provisioning_session_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_set_provisioning_suspend_event_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_set_provisioning_suspend_event_s sl_btmesh_rsp_prov_set_provisioning_suspend_event_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_provision_adv_device_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_provision_adv_device_s sl_btmesh_rsp_prov_provision_adv_device_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_provision_gatt_device_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_provision_gatt_device_s sl_btmesh_rsp_prov_provision_gatt_device_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_continue_provisioning_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_continue_provisioning_s sl_btmesh_rsp_prov_continue_provisioning_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_abort_provisioning_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_abort_provisioning_s sl_btmesh_rsp_prov_abort_provisioning_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_set_device_address_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_set_device_address_s sl_btmesh_rsp_prov_set_device_address_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_create_network_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_create_network_s sl_btmesh_rsp_prov_create_network_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_create_appkey_s
{
    uint16_t result;
    uint8array application_key;
});

typedef struct sl_btmesh_rsp_prov_create_appkey_s sl_btmesh_rsp_prov_create_appkey_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_send_oob_pkey_response_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_send_oob_pkey_response_s sl_btmesh_rsp_prov_send_oob_pkey_response_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_send_oob_auth_response_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_send_oob_auth_response_s sl_btmesh_rsp_prov_send_oob_auth_response_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_set_oob_requirements_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_set_oob_requirements_s sl_btmesh_rsp_prov_set_oob_requirements_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_start_key_refresh_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_start_key_refresh_s sl_btmesh_rsp_prov_start_key_refresh_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_get_key_refresh_exclusion_s
{
    uint16_t result;
    uint8_t status;
});

typedef struct sl_btmesh_rsp_prov_get_key_refresh_exclusion_s sl_btmesh_rsp_prov_get_key_refresh_exclusion_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_set_key_refresh_exclusion_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_set_key_refresh_exclusion_s sl_btmesh_rsp_prov_set_key_refresh_exclusion_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_get_ddb_entry_s
{
    uint16_t result;
    aes_key_128 device_key;
    uint16_t netkey_index;
    uint16_t address;
    uint8_t elements;
});

typedef struct sl_btmesh_rsp_prov_get_ddb_entry_s sl_btmesh_rsp_prov_get_ddb_entry_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_delete_ddb_entry_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_delete_ddb_entry_s sl_btmesh_rsp_prov_delete_ddb_entry_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_add_ddb_entry_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_add_ddb_entry_s sl_btmesh_rsp_prov_add_ddb_entry_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_list_ddb_entries_s
{
    uint16_t result;
    uint16_t count;
});

typedef struct sl_btmesh_rsp_prov_list_ddb_entries_s sl_btmesh_rsp_prov_list_ddb_entries_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_initialize_network_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_initialize_network_s sl_btmesh_rsp_prov_initialize_network_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_get_key_refresh_appkey_exclusion_s
{
    uint16_t result;
    uint8_t status;
});

typedef struct sl_btmesh_rsp_prov_get_key_refresh_appkey_exclusion_s sl_btmesh_rsp_prov_get_key_refresh_appkey_exclusion_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_set_key_refresh_appkey_exclusion_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_set_key_refresh_appkey_exclusion_s sl_btmesh_rsp_prov_set_key_refresh_appkey_exclusion_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_stop_scan_unprov_beacons_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_stop_scan_unprov_beacons_s sl_btmesh_rsp_prov_stop_scan_unprov_beacons_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_update_device_netkey_index_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_update_device_netkey_index_s sl_btmesh_rsp_prov_update_device_netkey_index_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_suspend_key_refresh_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_suspend_key_refresh_s sl_btmesh_rsp_prov_suspend_key_refresh_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_resume_key_refresh_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_resume_key_refresh_s sl_btmesh_rsp_prov_resume_key_refresh_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_get_key_refresh_phase_s
{
    uint16_t result;
    uint8_t phase;
});

typedef struct sl_btmesh_rsp_prov_get_key_refresh_phase_s sl_btmesh_rsp_prov_get_key_refresh_phase_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_start_key_refresh_from_phase_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_start_key_refresh_from_phase_s sl_btmesh_rsp_prov_start_key_refresh_from_phase_t;


PACKSTRUCT( struct sl_btmesh_rsp_prov_flush_key_refresh_state_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_prov_flush_key_refresh_state_s sl_btmesh_rsp_prov_flush_key_refresh_state_t;


