espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
PACKSTRUCT( struct sl_btmesh_rsp_prov_test_identity_s
{
    uint16_t result;
    uint8_t match;
});

typedef struct sl_btmesh_rsp_prov_test_identity_s sl_btmesh_rsp_prov_test_identity_t;


PACKSTRUCT( struct sl_btmesh_rsp_proxy_connect_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_proxy_connect_s sl_btmesh_rsp_proxy_connect_t;


PACKSTRUCT( struct sl_btmesh_rsp_proxy_disconnect_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_proxy_disconnect_s sl_btmesh_rsp_proxy_disconnect_t;


PACKSTRUCT( struct sl_btmesh_rsp_proxy_set_filter_type_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_proxy_set_filter_type_s sl_btmesh_rsp_proxy_set_filter_type_t;


PACKSTRUCT( struct sl_btmesh_rsp_proxy_allow_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_proxy_allow_s sl_btmesh_rsp_proxy_allow_t;


PACKSTRUCT( struct sl_btmesh_rsp_proxy_deny_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_proxy_deny_s sl_btmesh_rsp_proxy_deny_t;


PACKSTRUCT( struct sl_btmesh_rsp_proxy_optimisation_toggle_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_proxy_optimisation_toggle_s sl_btmesh_rsp_proxy_optimisation_toggle_t;


PACKSTRUCT( struct sl_btmesh_rsp_vendor_model_send_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_vendor_model_send_s sl_btmesh_rsp_vendor_model_send_t;


PACKSTRUCT( struct sl_btmesh_rsp_vendor_model_set_publication_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_vendor_model_set_publication_s sl_btmesh_rsp_vendor_model_set_publication_t;


PACKSTRUCT( struct sl_btmesh_rsp_vendor_model_clear_publication_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_vendor_model_clear_publication_s sl_btmesh_rsp_vendor_model_clear_publication_t;


PACKSTRUCT( struct sl_btmesh_rsp_vendor_model_publish_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_vendor_model_publish_s sl_btmesh_rsp_vendor_model_publish_t;


PACKSTRUCT( struct sl_btmesh_rsp_vendor_model_init_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_vendor_model_init_s sl_btmesh_rsp_vendor_model_init_t;


PACKSTRUCT( struct sl_btmesh_rsp_vendor_model_deinit_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_vendor_model_deinit_s sl_btmesh_rsp_vendor_model_deinit_t;


PACKSTRUCT( struct sl_btmesh_rsp_vendor_model_send_tracked_s
{
    uint16_t result;
    uint16_t handle;
});

typedef struct sl_btmesh_rsp_vendor_model_send_tracked_s sl_btmesh_rsp_vendor_model_send_tracked_t;


PACKSTRUCT( struct sl_btmesh_rsp_vendor_model_set_publication_tracked_s
{
    uint16_t result;
    uint16_t handle;
});

typedef struct sl_btmesh_rsp_vendor_model_set_publication_tracked_s sl_btmesh_rsp_vendor_model_set_publication_tracked_t;


PACKSTRUCT( struct sl_btmesh_rsp_health_client_get_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_health_client_get_s sl_btmesh_rsp_health_client_get_t;


PACKSTRUCT( struct sl_btmesh_rsp_health_client_clear_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_health_client_clear_s sl_btmesh_rsp_health_client_clear_t;


PACKSTRUCT( struct sl_btmesh_rsp_health_client_test_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_health_client_test_s sl_btmesh_rsp_health_client_test_t;


PACKSTRUCT( struct sl_btmesh_rsp_health_client_get_period_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_health_client_get_period_s sl_btmesh_rsp_health_client_get_period_t;


PACKSTRUCT( struct sl_btmesh_rsp_health_client_set_period_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_health_client_set_period_s sl_btmesh_rsp_health_client_set_period_t;


PACKSTRUCT( struct sl_btmesh_rsp_health_client_get_attention_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_health_client_get_attention_s sl_btmesh_rsp_health_client_get_attention_t;


PACKSTRUCT( struct sl_btmesh_rsp_health_client_set_attention_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_health_client_set_attention_s sl_btmesh_rsp_health_client_set_attention_t;


PACKSTRUCT( struct sl_btmesh_rsp_health_server_set_fault_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_health_server_set_fault_s sl_btmesh_rsp_health_server_set_fault_t;


PACKSTRUCT( struct sl_btmesh_rsp_health_server_clear_fault_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_health_server_clear_fault_s sl_btmesh_rsp_health_server_clear_fault_t;


PACKSTRUCT( struct sl_btmesh_rsp_health_server_send_test_response_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_health_server_send_test_response_s sl_btmesh_rsp_health_server_send_test_response_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_client_get_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_client_get_s sl_btmesh_rsp_generic_client_get_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_client_set_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_client_set_s sl_btmesh_rsp_generic_client_set_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_client_publish_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_client_publish_s sl_btmesh_rsp_generic_client_publish_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_client_get_params_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_client_get_params_s sl_btmesh_rsp_generic_client_get_params_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_client_init_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_client_init_s sl_btmesh_rsp_generic_client_init_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_client_init_common_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_client_init_common_s sl_btmesh_rsp_generic_client_init_common_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_client_init_on_off_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_client_init_on_off_s sl_btmesh_rsp_generic_client_init_on_off_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_client_init_level_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_client_init_level_s sl_btmesh_rsp_generic_client_init_level_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_client_init_default_transition_time_s
{
    uint16_t result;
});

