espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
typedef struct sl_btmesh_rsp_generic_client_init_default_transition_time_s sl_btmesh_rsp_generic_client_init_default_transition_time_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_client_init_power_on_off_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_client_init_power_on_off_s sl_btmesh_rsp_generic_client_init_power_on_off_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_client_init_power_level_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_client_init_power_level_s sl_btmesh_rsp_generic_client_init_power_level_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_client_init_battery_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_client_init_battery_s sl_btmesh_rsp_generic_client_init_battery_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_client_init_location_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_client_init_location_s sl_btmesh_rsp_generic_client_init_location_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_client_init_property_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_client_init_property_s sl_btmesh_rsp_generic_client_init_property_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_client_init_lightness_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_client_init_lightness_s sl_btmesh_rsp_generic_client_init_lightness_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_client_init_ctl_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_client_init_ctl_s sl_btmesh_rsp_generic_client_init_ctl_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_client_init_hsl_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_client_init_hsl_s sl_btmesh_rsp_generic_client_init_hsl_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_server_respond_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_server_respond_s sl_btmesh_rsp_generic_server_respond_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_server_update_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_server_update_s sl_btmesh_rsp_generic_server_update_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_server_publish_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_server_publish_s sl_btmesh_rsp_generic_server_publish_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_server_init_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_server_init_s sl_btmesh_rsp_generic_server_init_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_server_init_common_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_server_init_common_s sl_btmesh_rsp_generic_server_init_common_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_server_init_on_off_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_server_init_on_off_s sl_btmesh_rsp_generic_server_init_on_off_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_server_init_level_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_server_init_level_s sl_btmesh_rsp_generic_server_init_level_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_server_init_default_transition_time_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_server_init_default_transition_time_s sl_btmesh_rsp_generic_server_init_default_transition_time_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_server_init_power_on_off_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_server_init_power_on_off_s sl_btmesh_rsp_generic_server_init_power_on_off_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_server_init_power_level_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_server_init_power_level_s sl_btmesh_rsp_generic_server_init_power_level_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_server_init_battery_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_server_init_battery_s sl_btmesh_rsp_generic_server_init_battery_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_server_init_location_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_server_init_location_s sl_btmesh_rsp_generic_server_init_location_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_server_init_property_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_server_init_property_s sl_btmesh_rsp_generic_server_init_property_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_server_init_lightness_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_server_init_lightness_s sl_btmesh_rsp_generic_server_init_lightness_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_server_init_ctl_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_server_init_ctl_s sl_btmesh_rsp_generic_server_init_ctl_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_server_init_hsl_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_generic_server_init_hsl_s sl_btmesh_rsp_generic_server_init_hsl_t;


PACKSTRUCT( struct sl_btmesh_rsp_generic_server_get_cached_state_s
{
    uint16_t result;
    uint32_t remaining_ms;
    uint8array parameters;
});

typedef struct sl_btmesh_rsp_generic_server_get_cached_state_s sl_btmesh_rsp_generic_server_get_cached_state_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_get_nettx_s
{
    uint16_t result;
    uint8_t count;
    uint8_t interval;
});

typedef struct sl_btmesh_rsp_test_get_nettx_s sl_btmesh_rsp_test_get_nettx_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_nettx_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_set_nettx_s sl_btmesh_rsp_test_set_nettx_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_get_relay_s
{
    uint16_t result;
    uint8_t enabled;
    uint8_t count;
    uint8_t interval;
});

typedef struct sl_btmesh_rsp_test_get_relay_s sl_btmesh_rsp_test_get_relay_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_relay_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_set_relay_s sl_btmesh_rsp_test_set_relay_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_adv_scan_params_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_set_adv_scan_params_s sl_btmesh_rsp_test_set_adv_scan_params_t;


