espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
PACKSTRUCT( struct sl_btmesh_rsp_test_set_ivupdate_test_mode_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_set_ivupdate_test_mode_s sl_btmesh_rsp_test_set_ivupdate_test_mode_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_get_ivupdate_test_mode_s
{
    uint16_t result;
    uint8_t mode;
});

typedef struct sl_btmesh_rsp_test_get_ivupdate_test_mode_s sl_btmesh_rsp_test_get_ivupdate_test_mode_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_segment_send_delay_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_set_segment_send_delay_s sl_btmesh_rsp_test_set_segment_send_delay_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_ivupdate_state_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_set_ivupdate_state_s sl_btmesh_rsp_test_set_ivupdate_state_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_send_beacons_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_send_beacons_s sl_btmesh_rsp_test_send_beacons_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_bind_local_model_app_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_bind_local_model_app_s sl_btmesh_rsp_test_bind_local_model_app_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_unbind_local_model_app_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_unbind_local_model_app_s sl_btmesh_rsp_test_unbind_local_model_app_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_add_local_model_sub_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_add_local_model_sub_s sl_btmesh_rsp_test_add_local_model_sub_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_remove_local_model_sub_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_remove_local_model_sub_s sl_btmesh_rsp_test_remove_local_model_sub_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_add_local_model_sub_va_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_add_local_model_sub_va_s sl_btmesh_rsp_test_add_local_model_sub_va_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_remove_local_model_sub_va_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_remove_local_model_sub_va_s sl_btmesh_rsp_test_remove_local_model_sub_va_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_get_local_model_sub_s
{
    uint16_t result;
    uint8array addresses;
});

typedef struct sl_btmesh_rsp_test_get_local_model_sub_s sl_btmesh_rsp_test_get_local_model_sub_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_local_model_pub_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_set_local_model_pub_s sl_btmesh_rsp_test_set_local_model_pub_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_local_model_pub_va_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_set_local_model_pub_va_s sl_btmesh_rsp_test_set_local_model_pub_va_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_get_local_model_pub_s
{
    uint16_t result;
    uint16_t appkey_index;
    uint16_t pub_address;
    uint8_t ttl;
    uint8_t period;
    uint8_t retrans;
    uint8_t credentials;
});

typedef struct sl_btmesh_rsp_test_get_local_model_pub_s sl_btmesh_rsp_test_get_local_model_pub_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_local_heartbeat_subscription_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_set_local_heartbeat_subscription_s sl_btmesh_rsp_test_set_local_heartbeat_subscription_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_get_local_heartbeat_subscription_s
{
    uint16_t result;
    uint16_t count;
    uint8_t hop_min;
    uint8_t hop_max;
});

typedef struct sl_btmesh_rsp_test_get_local_heartbeat_subscription_s sl_btmesh_rsp_test_get_local_heartbeat_subscription_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_get_local_heartbeat_publication_s
{
    uint16_t result;
    uint16_t publication_address;
    uint8_t count;
    uint8_t period_log;
    uint8_t ttl;
    uint16_t features;
    uint16_t publication_netkey_index;
});

typedef struct sl_btmesh_rsp_test_get_local_heartbeat_publication_s sl_btmesh_rsp_test_get_local_heartbeat_publication_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_local_heartbeat_publication_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_set_local_heartbeat_publication_s sl_btmesh_rsp_test_set_local_heartbeat_publication_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_local_config_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_set_local_config_s sl_btmesh_rsp_test_set_local_config_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_get_local_config_s
{
    uint16_t result;
    uint8array data;
});

typedef struct sl_btmesh_rsp_test_get_local_config_s sl_btmesh_rsp_test_get_local_config_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_add_local_key_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_add_local_key_s sl_btmesh_rsp_test_add_local_key_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_remove_local_key_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_remove_local_key_s sl_btmesh_rsp_test_remove_local_key_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_update_local_key_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_update_local_key_s sl_btmesh_rsp_test_update_local_key_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_sar_config_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_set_sar_config_s sl_btmesh_rsp_test_set_sar_config_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_adv_bearer_state_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_set_adv_bearer_state_s sl_btmesh_rsp_test_set_adv_bearer_state_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_prov_get_device_key_s
{
    uint16_t result;
    aes_key_128 device_key;
});

typedef struct sl_btmesh_rsp_test_prov_get_device_key_s sl_btmesh_rsp_test_prov_get_device_key_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_prov_prepare_key_refresh_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_prov_prepare_key_refresh_s sl_btmesh_rsp_test_prov_prepare_key_refresh_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_cancel_segmented_tx_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_cancel_segmented_tx_s sl_btmesh_rsp_test_cancel_segmented_tx_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_iv_index_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_set_iv_index_s sl_btmesh_rsp_test_set_iv_index_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_element_seqnum_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_set_element_seqnum_s sl_btmesh_rsp_test_set_element_seqnum_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_model_option_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_set_model_option_s sl_btmesh_rsp_test_set_model_option_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_get_local_model_app_bindings_s
{
    uint16_t result;
    uint8array appkeys;
});

typedef struct sl_btmesh_rsp_test_get_local_model_app_bindings_s sl_btmesh_rsp_test_get_local_model_app_bindings_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_get_replay_protection_list_entry_s
{
    uint16_t result;
    uint32_t seq;
    uint32_t seq_ivindex;
});

typedef struct sl_btmesh_rsp_test_get_replay_protection_list_entry_s sl_btmesh_rsp_test_get_replay_protection_list_entry_t;


