espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
PACKSTRUCT( struct sl_btmesh_rsp_test_clear_replay_protection_list_entry_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_clear_replay_protection_list_entry_s sl_btmesh_rsp_test_clear_replay_protection_list_entry_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_replay_protection_list_diagnostics_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_test_set_replay_protection_list_diagnostics_s sl_btmesh_rsp_test_set_replay_protection_list_diagnostics_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_get_model_option_s
{
    uint16_t result;
    uint32_t value;
});

typedef struct sl_btmesh_rsp_test_get_model_option_s sl_btmesh_rsp_test_get_model_option_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_get_default_ttl_s
{
    uint16_t result;
    uint8_t value;
});

typedef struct sl_btmesh_rsp_test_get_default_ttl_s sl_btmesh_rsp_test_get_default_ttl_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_default_ttl_s
{
    uint16_t result;
    uint8_t value;
});

typedef struct sl_btmesh_rsp_test_set_default_ttl_s sl_btmesh_rsp_test_set_default_ttl_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_get_gatt_proxy_s
{
    uint16_t result;
    uint8_t value;
});

typedef struct sl_btmesh_rsp_test_get_gatt_proxy_s sl_btmesh_rsp_test_get_gatt_proxy_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_gatt_proxy_s
{
    uint16_t result;
    uint8_t value;
});

typedef struct sl_btmesh_rsp_test_set_gatt_proxy_s sl_btmesh_rsp_test_set_gatt_proxy_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_get_identity_s
{
    uint16_t result;
    uint16_t netkey_index;
    uint8_t value;
});

typedef struct sl_btmesh_rsp_test_get_identity_s sl_btmesh_rsp_test_get_identity_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_identity_s
{
    uint16_t result;
    uint16_t netkey_index;
    uint8_t value;
});

typedef struct sl_btmesh_rsp_test_set_identity_s sl_btmesh_rsp_test_set_identity_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_get_friend_s
{
    uint16_t result;
    uint8_t value;
});

typedef struct sl_btmesh_rsp_test_get_friend_s sl_btmesh_rsp_test_get_friend_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_friend_s
{
    uint16_t result;
    uint8_t value;
});

typedef struct sl_btmesh_rsp_test_set_friend_s sl_btmesh_rsp_test_set_friend_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_get_beacon_s
{
    uint16_t result;
    uint8_t value;
});

typedef struct sl_btmesh_rsp_test_get_beacon_s sl_btmesh_rsp_test_get_beacon_t;


PACKSTRUCT( struct sl_btmesh_rsp_test_set_beacon_s
{
    uint16_t result;
    uint8_t value;
});

typedef struct sl_btmesh_rsp_test_set_beacon_s sl_btmesh_rsp_test_set_beacon_t;


PACKSTRUCT( struct sl_btmesh_rsp_lpn_init_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lpn_init_s sl_btmesh_rsp_lpn_init_t;


PACKSTRUCT( struct sl_btmesh_rsp_lpn_deinit_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lpn_deinit_s sl_btmesh_rsp_lpn_deinit_t;


PACKSTRUCT( struct sl_btmesh_rsp_lpn_establish_friendship_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lpn_establish_friendship_s sl_btmesh_rsp_lpn_establish_friendship_t;


PACKSTRUCT( struct sl_btmesh_rsp_lpn_poll_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lpn_poll_s sl_btmesh_rsp_lpn_poll_t;


PACKSTRUCT( struct sl_btmesh_rsp_lpn_terminate_friendship_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lpn_terminate_friendship_s sl_btmesh_rsp_lpn_terminate_friendship_t;


PACKSTRUCT( struct sl_btmesh_rsp_lpn_config_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lpn_config_s sl_btmesh_rsp_lpn_config_t;


PACKSTRUCT( struct sl_btmesh_rsp_friend_init_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_friend_init_s sl_btmesh_rsp_friend_init_t;


PACKSTRUCT( struct sl_btmesh_rsp_friend_deinit_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_friend_deinit_s sl_btmesh_rsp_friend_deinit_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_cancel_request_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_config_client_cancel_request_s sl_btmesh_rsp_config_client_cancel_request_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_get_request_status_s
{
    uint16_t result;
    uint16_t server_address;
    uint16_t opcode;
    uint32_t age_ms;
    uint32_t remaining_ms;
    uint8_t friend_acked;
});

typedef struct sl_btmesh_rsp_config_client_get_request_status_s sl_btmesh_rsp_config_client_get_request_status_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_get_default_timeout_s
{
    uint16_t result;
    uint32_t timeout_ms;
    uint32_t lpn_timeout_ms;
});

typedef struct sl_btmesh_rsp_config_client_get_default_timeout_s sl_btmesh_rsp_config_client_get_default_timeout_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_set_default_timeout_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_config_client_set_default_timeout_s sl_btmesh_rsp_config_client_set_default_timeout_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_add_netkey_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_add_netkey_s sl_btmesh_rsp_config_client_add_netkey_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_remove_netkey_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_remove_netkey_s sl_btmesh_rsp_config_client_remove_netkey_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_list_netkeys_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_list_netkeys_s sl_btmesh_rsp_config_client_list_netkeys_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_add_appkey_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_add_appkey_s sl_btmesh_rsp_config_client_add_appkey_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_remove_appkey_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_remove_appkey_s sl_btmesh_rsp_config_client_remove_appkey_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_list_appkeys_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_list_appkeys_s sl_btmesh_rsp_config_client_list_appkeys_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_bind_model_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_bind_model_s sl_btmesh_rsp_config_client_bind_model_t;


