espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
PACKSTRUCT( struct sl_btmesh_rsp_config_client_unbind_model_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_unbind_model_s sl_btmesh_rsp_config_client_unbind_model_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_list_bindings_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_list_bindings_s sl_btmesh_rsp_config_client_list_bindings_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_get_model_pub_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_get_model_pub_s sl_btmesh_rsp_config_client_get_model_pub_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_set_model_pub_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_set_model_pub_s sl_btmesh_rsp_config_client_set_model_pub_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_set_model_pub_va_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_set_model_pub_va_s sl_btmesh_rsp_config_client_set_model_pub_va_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_add_model_sub_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_add_model_sub_s sl_btmesh_rsp_config_client_add_model_sub_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_add_model_sub_va_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_add_model_sub_va_s sl_btmesh_rsp_config_client_add_model_sub_va_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_remove_model_sub_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_remove_model_sub_s sl_btmesh_rsp_config_client_remove_model_sub_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_remove_model_sub_va_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_remove_model_sub_va_s sl_btmesh_rsp_config_client_remove_model_sub_va_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_set_model_sub_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_set_model_sub_s sl_btmesh_rsp_config_client_set_model_sub_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_set_model_sub_va_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_set_model_sub_va_s sl_btmesh_rsp_config_client_set_model_sub_va_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_clear_model_sub_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_clear_model_sub_s sl_btmesh_rsp_config_client_clear_model_sub_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_list_subs_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_list_subs_s sl_btmesh_rsp_config_client_list_subs_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_get_heartbeat_pub_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_get_heartbeat_pub_s sl_btmesh_rsp_config_client_get_heartbeat_pub_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_set_heartbeat_pub_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_set_heartbeat_pub_s sl_btmesh_rsp_config_client_set_heartbeat_pub_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_get_heartbeat_sub_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_get_heartbeat_sub_s sl_btmesh_rsp_config_client_get_heartbeat_sub_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_set_heartbeat_sub_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_set_heartbeat_sub_s sl_btmesh_rsp_config_client_set_heartbeat_sub_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_get_beacon_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_get_beacon_s sl_btmesh_rsp_config_client_get_beacon_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_set_beacon_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_set_beacon_s sl_btmesh_rsp_config_client_set_beacon_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_get_default_ttl_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_get_default_ttl_s sl_btmesh_rsp_config_client_get_default_ttl_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_set_default_ttl_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_set_default_ttl_s sl_btmesh_rsp_config_client_set_default_ttl_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_get_gatt_proxy_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_get_gatt_proxy_s sl_btmesh_rsp_config_client_get_gatt_proxy_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_set_gatt_proxy_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_set_gatt_proxy_s sl_btmesh_rsp_config_client_set_gatt_proxy_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_get_relay_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_get_relay_s sl_btmesh_rsp_config_client_get_relay_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_set_relay_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_set_relay_s sl_btmesh_rsp_config_client_set_relay_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_get_network_transmit_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_get_network_transmit_s sl_btmesh_rsp_config_client_get_network_transmit_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_set_network_transmit_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_set_network_transmit_s sl_btmesh_rsp_config_client_set_network_transmit_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_get_identity_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_get_identity_s sl_btmesh_rsp_config_client_get_identity_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_set_identity_s
{
    uint16_t result;
    uint32_t handle;
});

