espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
typedef struct sl_btmesh_rsp_config_client_set_identity_s sl_btmesh_rsp_config_client_set_identity_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_get_friend_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_get_friend_s sl_btmesh_rsp_config_client_get_friend_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_set_friend_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_set_friend_s sl_btmesh_rsp_config_client_set_friend_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_get_key_refresh_phase_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_get_key_refresh_phase_s sl_btmesh_rsp_config_client_get_key_refresh_phase_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_get_lpn_polltimeout_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_get_lpn_polltimeout_s sl_btmesh_rsp_config_client_get_lpn_polltimeout_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_get_dcd_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_get_dcd_s sl_btmesh_rsp_config_client_get_dcd_t;


PACKSTRUCT( struct sl_btmesh_rsp_config_client_reset_node_s
{
    uint16_t result;
    uint32_t handle;
});

typedef struct sl_btmesh_rsp_config_client_reset_node_s sl_btmesh_rsp_config_client_reset_node_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_server_init_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_server_init_s sl_btmesh_rsp_sensor_server_init_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_server_deinit_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_server_deinit_s sl_btmesh_rsp_sensor_server_deinit_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_server_send_descriptor_status_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_server_send_descriptor_status_s sl_btmesh_rsp_sensor_server_send_descriptor_status_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_server_send_status_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_server_send_status_s sl_btmesh_rsp_sensor_server_send_status_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_server_send_column_status_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_server_send_column_status_s sl_btmesh_rsp_sensor_server_send_column_status_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_server_send_series_status_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_server_send_series_status_s sl_btmesh_rsp_sensor_server_send_series_status_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_setup_server_send_cadence_status_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_setup_server_send_cadence_status_s sl_btmesh_rsp_sensor_setup_server_send_cadence_status_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_setup_server_send_settings_status_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_setup_server_send_settings_status_s sl_btmesh_rsp_sensor_setup_server_send_settings_status_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_setup_server_send_setting_status_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_setup_server_send_setting_status_s sl_btmesh_rsp_sensor_setup_server_send_setting_status_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_client_init_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_client_init_s sl_btmesh_rsp_sensor_client_init_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_client_deinit_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_client_deinit_s sl_btmesh_rsp_sensor_client_deinit_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_client_get_descriptor_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_client_get_descriptor_s sl_btmesh_rsp_sensor_client_get_descriptor_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_client_get_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_client_get_s sl_btmesh_rsp_sensor_client_get_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_client_get_column_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_client_get_column_s sl_btmesh_rsp_sensor_client_get_column_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_client_get_series_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_client_get_series_s sl_btmesh_rsp_sensor_client_get_series_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_client_get_cadence_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_client_get_cadence_s sl_btmesh_rsp_sensor_client_get_cadence_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_client_set_cadence_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_client_set_cadence_s sl_btmesh_rsp_sensor_client_set_cadence_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_client_get_settings_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_client_get_settings_s sl_btmesh_rsp_sensor_client_get_settings_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_client_get_setting_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_client_get_setting_s sl_btmesh_rsp_sensor_client_get_setting_t;


PACKSTRUCT( struct sl_btmesh_rsp_sensor_client_set_setting_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_sensor_client_set_setting_s sl_btmesh_rsp_sensor_client_set_setting_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_client_init_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lc_client_init_s sl_btmesh_rsp_lc_client_init_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_client_get_mode_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lc_client_get_mode_s sl_btmesh_rsp_lc_client_get_mode_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_client_set_mode_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lc_client_set_mode_s sl_btmesh_rsp_lc_client_set_mode_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_client_get_om_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lc_client_get_om_s sl_btmesh_rsp_lc_client_get_om_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_client_set_om_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lc_client_set_om_s sl_btmesh_rsp_lc_client_set_om_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_client_get_light_onoff_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lc_client_get_light_onoff_s sl_btmesh_rsp_lc_client_get_light_onoff_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_client_set_light_onoff_s
{
    uint16_t result;
});

