espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
typedef struct sl_btmesh_rsp_lc_client_set_light_onoff_s sl_btmesh_rsp_lc_client_set_light_onoff_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_client_get_property_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lc_client_get_property_s sl_btmesh_rsp_lc_client_get_property_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_client_set_property_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lc_client_set_property_s sl_btmesh_rsp_lc_client_set_property_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_server_init_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lc_server_init_s sl_btmesh_rsp_lc_server_init_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_server_deinit_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lc_server_deinit_s sl_btmesh_rsp_lc_server_deinit_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_server_update_mode_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lc_server_update_mode_s sl_btmesh_rsp_lc_server_update_mode_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_server_update_om_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lc_server_update_om_s sl_btmesh_rsp_lc_server_update_om_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_server_update_light_onoff_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lc_server_update_light_onoff_s sl_btmesh_rsp_lc_server_update_light_onoff_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_server_init_all_properties_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lc_server_init_all_properties_s sl_btmesh_rsp_lc_server_init_all_properties_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_server_set_publish_mask_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lc_server_set_publish_mask_s sl_btmesh_rsp_lc_server_set_publish_mask_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_server_set_regulator_interval_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lc_server_set_regulator_interval_s sl_btmesh_rsp_lc_server_set_regulator_interval_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_server_set_event_mask_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lc_server_set_event_mask_s sl_btmesh_rsp_lc_server_set_event_mask_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_server_get_lc_state_s
{
    uint16_t result;
    uint8_t state;
    uint32_t transition_time;
});

typedef struct sl_btmesh_rsp_lc_server_get_lc_state_s sl_btmesh_rsp_lc_server_get_lc_state_t;


PACKSTRUCT( struct sl_btmesh_rsp_lc_setup_server_update_property_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_lc_setup_server_update_property_s sl_btmesh_rsp_lc_setup_server_update_property_t;


PACKSTRUCT( struct sl_btmesh_rsp_scene_client_init_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scene_client_init_s sl_btmesh_rsp_scene_client_init_t;


PACKSTRUCT( struct sl_btmesh_rsp_scene_client_get_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scene_client_get_s sl_btmesh_rsp_scene_client_get_t;


PACKSTRUCT( struct sl_btmesh_rsp_scene_client_get_register_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scene_client_get_register_s sl_btmesh_rsp_scene_client_get_register_t;


PACKSTRUCT( struct sl_btmesh_rsp_scene_client_recall_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scene_client_recall_s sl_btmesh_rsp_scene_client_recall_t;


PACKSTRUCT( struct sl_btmesh_rsp_scene_client_store_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scene_client_store_s sl_btmesh_rsp_scene_client_store_t;


PACKSTRUCT( struct sl_btmesh_rsp_scene_client_delete_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scene_client_delete_s sl_btmesh_rsp_scene_client_delete_t;


PACKSTRUCT( struct sl_btmesh_rsp_scene_server_init_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scene_server_init_s sl_btmesh_rsp_scene_server_init_t;


PACKSTRUCT( struct sl_btmesh_rsp_scene_server_deinit_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scene_server_deinit_s sl_btmesh_rsp_scene_server_deinit_t;


PACKSTRUCT( struct sl_btmesh_rsp_scene_server_reset_register_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scene_server_reset_register_s sl_btmesh_rsp_scene_server_reset_register_t;


PACKSTRUCT( struct sl_btmesh_rsp_scene_server_enable_compact_recall_events_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scene_server_enable_compact_recall_events_s sl_btmesh_rsp_scene_server_enable_compact_recall_events_t;


PACKSTRUCT( struct sl_btmesh_rsp_scene_setup_server_init_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scene_setup_server_init_s sl_btmesh_rsp_scene_setup_server_init_t;


PACKSTRUCT( struct sl_btmesh_rsp_scheduler_client_init_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scheduler_client_init_s sl_btmesh_rsp_scheduler_client_init_t;


PACKSTRUCT( struct sl_btmesh_rsp_scheduler_client_deinit_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scheduler_client_deinit_s sl_btmesh_rsp_scheduler_client_deinit_t;


PACKSTRUCT( struct sl_btmesh_rsp_scheduler_client_get_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scheduler_client_get_s sl_btmesh_rsp_scheduler_client_get_t;


PACKSTRUCT( struct sl_btmesh_rsp_scheduler_client_get_action_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scheduler_client_get_action_s sl_btmesh_rsp_scheduler_client_get_action_t;


PACKSTRUCT( struct sl_btmesh_rsp_scheduler_client_set_action_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scheduler_client_set_action_s sl_btmesh_rsp_scheduler_client_set_action_t;


PACKSTRUCT( struct sl_btmesh_rsp_scheduler_server_init_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scheduler_server_init_s sl_btmesh_rsp_scheduler_server_init_t;


PACKSTRUCT( struct sl_btmesh_rsp_scheduler_server_deinit_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scheduler_server_deinit_s sl_btmesh_rsp_scheduler_server_deinit_t;


PACKSTRUCT( struct sl_btmesh_rsp_scheduler_server_get_s
{
    uint16_t result;
    uint16_t status;
});

typedef struct sl_btmesh_rsp_scheduler_server_get_s sl_btmesh_rsp_scheduler_server_get_t;


PACKSTRUCT( struct sl_btmesh_rsp_scheduler_server_get_action_s
{
    uint16_t result;
    uint8_t index_;
    uint8_t year;
    uint16_t month;
    uint8_t day;
    uint8_t hour;
    uint8_t minute;
    uint8_t second;
    uint8_t day_of_week;
    uint8_t action;
    uint32_t transition_time_ms;
    uint16_t scene_number;
});

typedef struct sl_btmesh_rsp_scheduler_server_get_action_s sl_btmesh_rsp_scheduler_server_get_action_t;


