espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
PACKSTRUCT( struct sl_btmesh_rsp_scheduler_server_set_action_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_scheduler_server_set_action_s sl_btmesh_rsp_scheduler_server_set_action_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_server_init_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_time_server_init_s sl_btmesh_rsp_time_server_init_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_server_deinit_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_time_server_deinit_s sl_btmesh_rsp_time_server_deinit_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_server_get_time_s
{
    uint16_t result;
    uint64_t tai_seconds;
    uint8_t subsecond;
    uint8_t uncertainty;
    uint8_t time_authority;
    int16_t time_zone_offset;
    int32_t tai_utc_delta;
});

typedef struct sl_btmesh_rsp_time_server_get_time_s sl_btmesh_rsp_time_server_get_time_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_server_set_time_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_time_server_set_time_s sl_btmesh_rsp_time_server_set_time_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_server_get_time_zone_offset_new_s
{
    uint16_t result;
    int16_t new_offset;
    uint64_t tai_of_zone_change;
});

typedef struct sl_btmesh_rsp_time_server_get_time_zone_offset_new_s sl_btmesh_rsp_time_server_get_time_zone_offset_new_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_server_set_time_zone_offset_new_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_time_server_set_time_zone_offset_new_s sl_btmesh_rsp_time_server_set_time_zone_offset_new_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_server_get_tai_utc_delta_new_s
{
    uint16_t result;
    int32_t new_delta;
    uint64_t tai_of_delta_change;
});

typedef struct sl_btmesh_rsp_time_server_get_tai_utc_delta_new_s sl_btmesh_rsp_time_server_get_tai_utc_delta_new_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_server_set_tai_utc_delta_new_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_time_server_set_tai_utc_delta_new_s sl_btmesh_rsp_time_server_set_tai_utc_delta_new_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_server_get_time_role_s
{
    uint16_t result;
    uint8_t time_role;
});

typedef struct sl_btmesh_rsp_time_server_get_time_role_s sl_btmesh_rsp_time_server_get_time_role_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_server_set_time_role_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_time_server_set_time_role_s sl_btmesh_rsp_time_server_set_time_role_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_server_get_datetime_s
{
    uint16_t result;
    uint16_t year;
    uint8_t month;
    uint8_t day;
    uint8_t hour;
    uint8_t min;
    uint8_t sec;
    uint16_t ms;
    int16_t timezone;
    uint8_t day_of_week;
});

typedef struct sl_btmesh_rsp_time_server_get_datetime_s sl_btmesh_rsp_time_server_get_datetime_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_server_publish_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_time_server_publish_s sl_btmesh_rsp_time_server_publish_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_server_status_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_time_server_status_s sl_btmesh_rsp_time_server_status_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_client_init_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_time_client_init_s sl_btmesh_rsp_time_client_init_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_client_deinit_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_time_client_deinit_s sl_btmesh_rsp_time_client_deinit_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_client_get_time_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_time_client_get_time_s sl_btmesh_rsp_time_client_get_time_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_client_set_time_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_time_client_set_time_s sl_btmesh_rsp_time_client_set_time_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_client_get_time_zone_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_time_client_get_time_zone_s sl_btmesh_rsp_time_client_get_time_zone_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_client_set_time_zone_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_time_client_set_time_zone_s sl_btmesh_rsp_time_client_set_time_zone_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_client_get_tai_utc_delta_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_time_client_get_tai_utc_delta_s sl_btmesh_rsp_time_client_get_tai_utc_delta_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_client_set_tai_utc_delta_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_time_client_set_tai_utc_delta_s sl_btmesh_rsp_time_client_set_tai_utc_delta_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_client_get_time_role_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_time_client_get_time_role_s sl_btmesh_rsp_time_client_get_time_role_t;


PACKSTRUCT( struct sl_btmesh_rsp_time_client_set_time_role_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_time_client_set_time_role_s sl_btmesh_rsp_time_client_set_time_role_t;


PACKSTRUCT( struct sl_btmesh_rsp_migration_migrate_keys_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_migration_migrate_keys_s sl_btmesh_rsp_migration_migrate_keys_t;


PACKSTRUCT( struct sl_btmesh_rsp_migration_migrate_ddb_s
{
    uint16_t result;
});

typedef struct sl_btmesh_rsp_migration_migrate_ddb_s sl_btmesh_rsp_migration_migrate_ddb_t;



PACKSTRUCT( struct sl_btmesh_packet {
  uint32_t   header;
  union {
    uint8_t handle;
    sl_bt_rsp_error_t rsp_error;
    sl_btmesh_cmd_node_start_unprov_beaconing_t                  cmd_node_start_unprov_beaconing;
    sl_btmesh_cmd_node_send_input_oob_request_response_t         cmd_node_send_input_oob_request_response;
    sl_btmesh_cmd_node_set_provisioning_data_t                   cmd_node_set_provisioning_data;
    sl_btmesh_cmd_node_init_oob_t                                cmd_node_init_oob;
    sl_btmesh_cmd_node_set_ivrecovery_mode_t                     cmd_node_set_ivrecovery_mode;
    sl_btmesh_cmd_node_set_net_relay_delay_t                     cmd_node_set_net_relay_delay;
    sl_btmesh_cmd_node_get_seq_remaining_t                       cmd_node_get_seq_remaining;
    sl_btmesh_cmd_node_set_uuid_t                                cmd_node_set_uuid;
    sl_btmesh_cmd_node_get_element_address_t                     cmd_node_get_element_address;
    sl_btmesh_cmd_node_send_static_oob_request_response_t        cmd_node_send_static_oob_request_response;
    sl_btmesh_cmd_node_set_beacon_reporting_t                    cmd_node_set_beacon_reporting;
    sl_btmesh_cmd_node_set_iv_update_age_t                       cmd_node_set_iv_update_age;
    sl_btmesh_cmd_node_get_key_count_t                           cmd_node_get_key_count;
    sl_btmesh_cmd_node_get_key_t                                 cmd_node_get_key;
    sl_btmesh_cmd_node_get_element_seqnum_t                      cmd_node_get_element_seqnum;
    sl_btmesh_cmd_node_set_model_option_t                        cmd_node_set_model_option;
    sl_btmesh_cmd_node_get_local_dcd_t                           cmd_node_get_local_dcd;
    sl_btmesh_cmd_node_set_adv_phy_t                             cmd_node_set_adv_phy;
    sl_btmesh_cmd_node_set_unprov_beaconing_adv_interval_t       cmd_node_set_unprov_beaconing_adv_interval;
    sl_btmesh_cmd_node_set_proxy_service_adv_interval_t          cmd_node_set_proxy_service_adv_interval;
    sl_btmesh_cmd_node_set_provisioning_service_adv_interval_t   cmd_node_set_provisioning_service_adv_interval;
    sl_btmesh_cmd_prov_create_provisioning_session_t             cmd_prov_create_provisioning_session;
    sl_btmesh_cmd_prov_set_provisioning_suspend_event_t          cmd_prov_set_provisioning_suspend_event;
    sl_btmesh_cmd_prov_provision_adv_device_t                    cmd_prov_provision_adv_device;
    sl_btmesh_cmd_prov_provision_gatt_device_t                   cmd_prov_provision_gatt_device;
    sl_btmesh_cmd_prov_continue_provisioning_t                   cmd_prov_continue_provisioning;
    sl_btmesh_cmd_prov_abort_provisioning_t                      cmd_prov_abort_provisioning;
    sl_btmesh_cmd_prov_set_device_address_t                      cmd_prov_set_device_address;
    sl_btmesh_cmd_prov_create_network_t                          cmd_prov_create_network;
    sl_btmesh_cmd_prov_create_appkey_t                           cmd_prov_create_appkey;
    sl_btmesh_cmd_prov_send_oob_pkey_response_t                  cmd_prov_send_oob_pkey_response;
    sl_btmesh_cmd_prov_send_oob_auth_response_t                  cmd_prov_send_oob_auth_response;
    sl_btmesh_cmd_prov_set_oob_requirements_t                    cmd_prov_set_oob_requirements;
    sl_btmesh_cmd_prov_start_key_refresh_t                       cmd_prov_start_key_refresh;
    sl_btmesh_cmd_prov_get_key_refresh_exclusion_t               cmd_prov_get_key_refresh_exclusion;
    sl_btmesh_cmd_prov_set_key_refresh_exclusion_t               cmd_prov_set_key_refresh_exclusion;
    sl_btmesh_cmd_prov_get_ddb_entry_t                           cmd_prov_get_ddb_entry;
    sl_btmesh_cmd_prov_delete_ddb_entry_t                        cmd_prov_delete_ddb_entry;
    sl_btmesh_cmd_prov_add_ddb_entry_t                           cmd_prov_add_ddb_entry;
    sl_btmesh_cmd_prov_initialize_network_t                      cmd_prov_initialize_network;
    sl_btmesh_cmd_prov_get_key_refresh_appkey_exclusion_t        cmd_prov_get_key_refresh_appkey_exclusion;
    sl_btmesh_cmd_prov_set_key_refresh_appkey_exclusion_t        cmd_prov_set_key_refresh_appkey_exclusion;
    sl_btmesh_cmd_prov_update_device_netkey_index_t              cmd_prov_update_device_netkey_index;
    sl_btmesh_cmd_prov_suspend_key_refresh_t                     cmd_prov_suspend_key_refresh;
    sl_btmesh_cmd_prov_resume_key_refresh_t                      cmd_prov_resume_key_refresh;
    sl_btmesh_cmd_prov_get_key_refresh_phase_t                   cmd_prov_get_key_refresh_phase;
    sl_btmesh_cmd_prov_start_key_refresh_from_phase_t            cmd_prov_start_key_refresh_from_phase;
    sl_btmesh_cmd_prov_flush_key_refresh_state_t                 cmd_prov_flush_key_refresh_state;
    sl_btmesh_cmd_prov_test_identity_t                           cmd_prov_test_identity;
    sl_btmesh_cmd_proxy_connect_t                                cmd_proxy_connect;
    sl_btmesh_cmd_proxy_disconnect_t                             cmd_proxy_disconnect;
    sl_btmesh_cmd_proxy_set_filter_type_t                        cmd_proxy_set_filter_type;
    sl_btmesh_cmd_proxy_allow_t                                  cmd_proxy_allow;
    sl_btmesh_cmd_proxy_deny_t                                   cmd_proxy_deny;
    sl_btmesh_cmd_proxy_optimisation_toggle_t                    cmd_proxy_optimisation_toggle;
    sl_btmesh_cmd_vendor_model_send_t                            cmd_vendor_model_send;
    sl_btmesh_cmd_vendor_model_set_publication_t                 cmd_vendor_model_set_publication;
    sl_btmesh_cmd_vendor_model_clear_publication_t               cmd_vendor_model_clear_publication;
    sl_btmesh_cmd_vendor_model_publish_t                         cmd_vendor_model_publish;
    sl_btmesh_cmd_vendor_model_init_t                            cmd_vendor_model_init;
    sl_btmesh_cmd_vendor_model_deinit_t                          cmd_vendor_model_deinit;
    sl_btmesh_cmd_vendor_model_send_tracked_t                    cmd_vendor_model_send_tracked;
    sl_btmesh_cmd_vendor_model_set_publication_tracked_t         cmd_vendor_model_set_publication_tracked;
    sl_btmesh_cmd_health_client_get_t                            cmd_health_client_get;
    sl_btmesh_cmd_health_client_clear_t                          cmd_health_client_clear;
    sl_btmesh_cmd_health_client_test_t                           cmd_health_client_test;
    sl_btmesh_cmd_health_client_get_period_t                     cmd_health_client_get_period;
    sl_btmesh_cmd_health_client_set_period_t                     cmd_health_client_set_period;
    sl_btmesh_cmd_health_client_get_attention_t                  cmd_health_client_get_attention;
    sl_btmesh_cmd_health_client_set_attention_t                  cmd_health_client_set_attention;
    sl_btmesh_cmd_health_server_set_fault_t                      cmd_health_server_set_fault;
    sl_btmesh_cmd_health_server_clear_fault_t                    cmd_health_server_clear_fault;
    sl_btmesh_cmd_health_server_send_test_response_t             cmd_health_server_send_test_response;
    sl_btmesh_cmd_generic_client_get_t                           cmd_generic_client_get;
    sl_btmesh_cmd_generic_client_set_t                           cmd_generic_client_set;
    sl_btmesh_cmd_generic_client_publish_t                       cmd_generic_client_publish;
    sl_btmesh_cmd_generic_client_get_params_t                    cmd_generic_client_get_params;
    sl_btmesh_cmd_generic_server_respond_t                       cmd_generic_server_respond;
    sl_btmesh_cmd_generic_server_update_t                        cmd_generic_server_update;
    sl_btmesh_cmd_generic_server_publish_t                       cmd_generic_server_publish;
    sl_btmesh_cmd_generic_server_get_cached_state_t              cmd_generic_server_get_cached_state;
    sl_btmesh_cmd_test_set_nettx_t                               cmd_test_set_nettx;
    sl_btmesh_cmd_test_set_relay_t                               cmd_test_set_relay;
    sl_btmesh_cmd_test_set_adv_scan_params_t                     cmd_test_set_adv_scan_params;
    sl_btmesh_cmd_test_set_ivupdate_test_mode_t                  cmd_test_set_ivupdate_test_mode;
    sl_btmesh_cmd_test_set_segment_send_delay_t                  cmd_test_set_segment_send_delay;
    sl_btmesh_cmd_test_set_ivupdate_state_t                      cmd_test_set_ivupdate_state;
    sl_btmesh_cmd_test_bind_local_model_app_t                    cmd_test_bind_local_model_app;
    sl_btmesh_cmd_test_unbind_local_model_app_t                  cmd_test_unbind_local_model_app;
    sl_btmesh_cmd_test_add_local_model_sub_t                     cmd_test_add_local_model_sub;
    sl_btmesh_cmd_test_remove_local_model_sub_t                  cmd_test_remove_local_model_sub;
    sl_btmesh_cmd_test_add_local_model_sub_va_t                  cmd_test_add_local_model_sub_va;
    sl_btmesh_cmd_test_remove_local_model_sub_va_t               cmd_test_remove_local_model_sub_va;
    sl_btmesh_cmd_test_get_local_model_sub_t                     cmd_test_get_local_model_sub;
    sl_btmesh_cmd_test_set_local_model_pub_t                     cmd_test_set_local_model_pub;
    sl_btmesh_cmd_test_set_local_model_pub_va_t                  cmd_test_set_local_model_pub_va;
    sl_btmesh_cmd_test_get_local_model_pub_t                     cmd_test_get_local_model_pub;
    sl_btmesh_cmd_test_set_local_heartbeat_subscription_t        cmd_test_set_local_heartbeat_subscription;
    sl_btmesh_cmd_test_set_local_heartbeat_publication_t         cmd_test_set_local_heartbeat_publication;
    sl_btmesh_cmd_test_set_local_config_t                        cmd_test_set_local_config;
    sl_btmesh_cmd_test_get_local_config_t                        cmd_test_get_local_config;
    sl_btmesh_cmd_test_add_local_key_t                           cmd_test_add_local_key;
    sl_btmesh_cmd_test_remove_local_key_t                        cmd_test_remove_local_key;
    sl_btmesh_cmd_test_update_local_key_t                        cmd_test_update_local_key;
    sl_btmesh_cmd_test_set_sar_config_t                          cmd_test_set_sar_config;
    sl_btmesh_cmd_test_set_adv_bearer_state_t                    cmd_test_set_adv_bearer_state;
    sl_btmesh_cmd_test_prov_get_device_key_t                     cmd_test_prov_get_device_key;
    sl_btmesh_cmd_test_prov_prepare_key_refresh_t                cmd_test_prov_prepare_key_refresh;
    sl_btmesh_cmd_test_cancel_segmented_tx_t                     cmd_test_cancel_segmented_tx;
    sl_btmesh_cmd_test_set_iv_index_t                            cmd_test_set_iv_index;
    sl_btmesh_cmd_test_set_element_seqnum_t                      cmd_test_set_element_seqnum;
    sl_btmesh_cmd_test_set_model_option_t                        cmd_test_set_model_option;
    sl_btmesh_cmd_test_get_local_model_app_bindings_t            cmd_test_get_local_model_app_bindings;
    sl_btmesh_cmd_test_get_replay_protection_list_entry_t        cmd_test_get_replay_protection_list_entry;
    sl_btmesh_cmd_test_clear_replay_protection_list_entry_t      cmd_test_clear_replay_protection_list_entry;
    sl_btmesh_cmd_test_set_replay_protection_list_diagnostics_t  cmd_test_set_replay_protection_list_diagnostics;
    sl_btmesh_cmd_test_get_model_option_t                        cmd_test_get_model_option;
    sl_btmesh_cmd_test_set_default_ttl_t                         cmd_test_set_default_ttl;
    sl_btmesh_cmd_test_set_gatt_proxy_t                          cmd_test_set_gatt_proxy;
    sl_btmesh_cmd_test_get_identity_t                            cmd_test_get_identity;
    sl_btmesh_cmd_test_set_identity_t                            cmd_test_set_identity;
    sl_btmesh_cmd_test_set_friend_t                              cmd_test_set_friend;
    sl_btmesh_cmd_test_set_beacon_t                              cmd_test_set_beacon;
    sl_btmesh_cmd_lpn_establish_friendship_t                     cmd_lpn_establish_friendship;
    sl_btmesh_cmd_lpn_poll_t                                     cmd_lpn_poll;
    sl_btmesh_cmd_lpn_terminate_friendship_t                     cmd_lpn_terminate_friendship;
    sl_btmesh_cmd_lpn_config_t                                   cmd_lpn_config;
    sl_btmesh_cmd_config_client_cancel_request_t                 cmd_config_client_cancel_request;
    sl_btmesh_cmd_config_client_get_request_status_t             cmd_config_client_get_request_status;
    sl_btmesh_cmd_config_client_set_default_timeout_t            cmd_config_client_set_default_timeout;
    sl_btmesh_cmd_config_client_add_netkey_t                     cmd_config_client_add_netkey;
    sl_btmesh_cmd_config_client_remove_netkey_t                  cmd_config_client_remove_netkey;
    sl_btmesh_cmd_config_client_list_netkeys_t                   cmd_config_client_list_netkeys;
    sl_btmesh_cmd_config_client_add_appkey_t                     cmd_config_client_add_appkey;
    sl_btmesh_cmd_config_client_remove_appkey_t                  cmd_config_client_remove_appkey;
    sl_btmesh_cmd_config_client_list_appkeys_t                   cmd_config_client_list_appkeys;
    sl_btmesh_cmd_config_client_bind_model_t                     cmd_config_client_bind_model;
    sl_btmesh_cmd_config_client_unbind_model_t                   cmd_config_client_unbind_model;
    sl_btmesh_cmd_config_client_list_bindings_t                  cmd_config_client_list_bindings;
    sl_btmesh_cmd_config_client_get_model_pub_t                  cmd_config_client_get_model_pub;
    sl_btmesh_cmd_config_client_set_model_pub_t                  cmd_config_client_set_model_pub;
    sl_btmesh_cmd_config_client_set_model_pub_va_t               cmd_config_client_set_model_pub_va;
    sl_btmesh_cmd_config_client_add_model_sub_t                  cmd_config_client_add_model_sub;
    sl_btmesh_cmd_config_client_add_model_sub_va_t               cmd_config_client_add_model_sub_va;
    sl_btmesh_cmd_config_client_remove_model_sub_t               cmd_config_client_remove_model_sub;
    sl_btmesh_cmd_config_client_remove_model_sub_va_t            cmd_config_client_remove_model_sub_va;
    sl_btmesh_cmd_config_client_set_model_sub_t                  cmd_config_client_set_model_sub;
    sl_btmesh_cmd_config_client_set_model_sub_va_t               cmd_config_client_set_model_sub_va;
    sl_btmesh_cmd_config_client_clear_model_sub_t                cmd_config_client_clear_model_sub;
    sl_btmesh_cmd_config_client_list_subs_t                      cmd_config_client_list_subs;
    sl_btmesh_cmd_config_client_get_heartbeat_pub_t              cmd_config_client_get_heartbeat_pub;
    sl_btmesh_cmd_config_client_set_heartbeat_pub_t              cmd_config_client_set_heartbeat_pub;
    sl_btmesh_cmd_config_client_get_heartbeat_sub_t              cmd_config_client_get_heartbeat_sub;
    sl_btmesh_cmd_config_client_set_heartbeat_sub_t              cmd_config_client_set_heartbeat_sub;
    sl_btmesh_cmd_config_client_get_beacon_t                     cmd_config_client_get_beacon;
    sl_btmesh_cmd_config_client_set_beacon_t                     cmd_config_client_set_beacon;
    sl_btmesh_cmd_config_client_get_default_ttl_t                cmd_config_client_get_default_ttl;
    sl_btmesh_cmd_config_client_set_default_ttl_t                cmd_config_client_set_default_ttl;
    sl_btmesh_cmd_config_client_get_gatt_proxy_t                 cmd_config_client_get_gatt_proxy;
    sl_btmesh_cmd_config_client_set_gatt_proxy_t                 cmd_config_client_set_gatt_proxy;
    sl_btmesh_cmd_config_client_get_relay_t                      cmd_config_client_get_relay;
    sl_btmesh_cmd_config_client_set_relay_t                      cmd_config_client_set_relay;
    sl_btmesh_cmd_config_client_get_network_transmit_t           cmd_config_client_get_network_transmit;
    sl_btmesh_cmd_config_client_set_network_transmit_t           cmd_config_client_set_network_transmit;
    sl_btmesh_cmd_config_client_get_identity_t                   cmd_config_client_get_identity;
    sl_btmesh_cmd_config_client_set_identity_t                   cmd_config_client_set_identity;
    sl_btmesh_cmd_config_client_get_friend_t                     cmd_config_client_get_friend;
    sl_btmesh_cmd_config_client_set_friend_t                     cmd_config_client_set_friend;
    sl_btmesh_cmd_config_client_get_key_refresh_phase_t          cmd_config_client_get_key_refresh_phase;
    sl_btmesh_cmd_config_client_get_lpn_polltimeout_t            cmd_config_client_get_lpn_polltimeout;
    sl_btmesh_cmd_config_client_get_dcd_t                        cmd_config_client_get_dcd;
    sl_btmesh_cmd_config_client_reset_node_t                     cmd_config_client_reset_node;
    sl_btmesh_cmd_sensor_server_init_t                           cmd_sensor_server_init;
    sl_btmesh_cmd_sensor_server_deinit_t                         cmd_sensor_server_deinit;
    sl_btmesh_cmd_sensor_server_send_descriptor_status_t         cmd_sensor_server_send_descriptor_status;
    sl_btmesh_cmd_sensor_server_send_status_t                    cmd_sensor_server_send_status;
    sl_btmesh_cmd_sensor_server_send_column_status_t             cmd_sensor_server_send_column_status;
    sl_btmesh_cmd_sensor_server_send_series_status_t             cmd_sensor_server_send_series_status;
    sl_btmesh_cmd_sensor_setup_server_send_cadence_status_t      cmd_sensor_setup_server_send_cadence_status;
    sl_btmesh_cmd_sensor_setup_server_send_settings_status_t     cmd_sensor_setup_server_send_settings_status;
    sl_btmesh_cmd_sensor_setup_server_send_setting_status_t      cmd_sensor_setup_server_send_setting_status;
    sl_btmesh_cmd_sensor_client_get_descriptor_t                 cmd_sensor_client_get_descriptor;
    sl_btmesh_cmd_sensor_client_get_t                            cmd_sensor_client_get;
    sl_btmesh_cmd_sensor_client_get_column_t                     cmd_sensor_client_get_column;
    sl_btmesh_cmd_sensor_client_get_series_t                     cmd_sensor_client_get_series;
    sl_btmesh_cmd_sensor_client_get_cadence_t                    cmd_sensor_client_get_cadence;
    sl_btmesh_cmd_sensor_client_set_cadence_t                    cmd_sensor_client_set_cadence;
    sl_btmesh_cmd_sensor_client_get_settings_t                   cmd_sensor_client_get_settings;
    sl_btmesh_cmd_sensor_client_get_setting_t                    cmd_sensor_client_get_setting;
    sl_btmesh_cmd_sensor_client_set_setting_t                    cmd_sensor_client_set_setting;
    sl_btmesh_cmd_lc_client_init_t                               cmd_lc_client_init;
    sl_btmesh_cmd_lc_client_get_mode_t                           cmd_lc_client_get_mode;
