espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
    sl_btmesh_cmd_lc_client_set_mode_t                           cmd_lc_client_set_mode;
    sl_btmesh_cmd_lc_client_get_om_t                             cmd_lc_client_get_om;
    sl_btmesh_cmd_lc_client_set_om_t                             cmd_lc_client_set_om;
    sl_btmesh_cmd_lc_client_get_light_onoff_t                    cmd_lc_client_get_light_onoff;
    sl_btmesh_cmd_lc_client_set_light_onoff_t                    cmd_lc_client_set_light_onoff;
    sl_btmesh_cmd_lc_client_get_property_t                       cmd_lc_client_get_property;
    sl_btmesh_cmd_lc_client_set_property_t                       cmd_lc_client_set_property;
    sl_btmesh_cmd_lc_server_init_t                               cmd_lc_server_init;
    sl_btmesh_cmd_lc_server_deinit_t                             cmd_lc_server_deinit;
    sl_btmesh_cmd_lc_server_update_mode_t                        cmd_lc_server_update_mode;
    sl_btmesh_cmd_lc_server_update_om_t                          cmd_lc_server_update_om;
    sl_btmesh_cmd_lc_server_update_light_onoff_t                 cmd_lc_server_update_light_onoff;
    sl_btmesh_cmd_lc_server_init_all_properties_t                cmd_lc_server_init_all_properties;
    sl_btmesh_cmd_lc_server_set_publish_mask_t                   cmd_lc_server_set_publish_mask;
    sl_btmesh_cmd_lc_server_set_regulator_interval_t             cmd_lc_server_set_regulator_interval;
    sl_btmesh_cmd_lc_server_set_event_mask_t                     cmd_lc_server_set_event_mask;
    sl_btmesh_cmd_lc_server_get_lc_state_t                       cmd_lc_server_get_lc_state;
    sl_btmesh_cmd_lc_setup_server_update_property_t              cmd_lc_setup_server_update_property;
    sl_btmesh_cmd_scene_client_init_t                            cmd_scene_client_init;
    sl_btmesh_cmd_scene_client_get_t                             cmd_scene_client_get;
    sl_btmesh_cmd_scene_client_get_register_t                    cmd_scene_client_get_register;
    sl_btmesh_cmd_scene_client_recall_t                          cmd_scene_client_recall;
    sl_btmesh_cmd_scene_client_store_t                           cmd_scene_client_store;
    sl_btmesh_cmd_scene_client_delete_t                          cmd_scene_client_delete;
    sl_btmesh_cmd_scene_server_init_t                            cmd_scene_server_init;
    sl_btmesh_cmd_scene_server_deinit_t                          cmd_scene_server_deinit;
    sl_btmesh_cmd_scene_server_reset_register_t                  cmd_scene_server_reset_register;
    sl_btmesh_cmd_scene_setup_server_init_t                      cmd_scene_setup_server_init;
    sl_btmesh_cmd_scheduler_client_init_t                        cmd_scheduler_client_init;
    sl_btmesh_cmd_scheduler_client_deinit_t                      cmd_scheduler_client_deinit;
    sl_btmesh_cmd_scheduler_client_get_t                         cmd_scheduler_client_get;
    sl_btmesh_cmd_scheduler_client_get_action_t                  cmd_scheduler_client_get_action;
    sl_btmesh_cmd_scheduler_client_set_action_t                  cmd_scheduler_client_set_action;
    sl_btmesh_cmd_scheduler_server_init_t                        cmd_scheduler_server_init;
    sl_btmesh_cmd_scheduler_server_deinit_t                      cmd_scheduler_server_deinit;
    sl_btmesh_cmd_scheduler_server_get_t                         cmd_scheduler_server_get;
    sl_btmesh_cmd_scheduler_server_get_action_t                  cmd_scheduler_server_get_action;
    sl_btmesh_cmd_scheduler_server_set_action_t                  cmd_scheduler_server_set_action;
    sl_btmesh_cmd_time_server_init_t                             cmd_time_server_init;
    sl_btmesh_cmd_time_server_deinit_t                           cmd_time_server_deinit;
    sl_btmesh_cmd_time_server_get_time_t                         cmd_time_server_get_time;
    sl_btmesh_cmd_time_server_set_time_t                         cmd_time_server_set_time;
    sl_btmesh_cmd_time_server_get_time_zone_offset_new_t         cmd_time_server_get_time_zone_offset_new;
    sl_btmesh_cmd_time_server_set_time_zone_offset_new_t         cmd_time_server_set_time_zone_offset_new;
    sl_btmesh_cmd_time_server_get_tai_utc_delta_new_t            cmd_time_server_get_tai_utc_delta_new;
    sl_btmesh_cmd_time_server_set_tai_utc_delta_new_t            cmd_time_server_set_tai_utc_delta_new;
    sl_btmesh_cmd_time_server_get_time_role_t                    cmd_time_server_get_time_role;
    sl_btmesh_cmd_time_server_set_time_role_t                    cmd_time_server_set_time_role;
    sl_btmesh_cmd_time_server_get_datetime_t                     cmd_time_server_get_datetime;
    sl_btmesh_cmd_time_server_publish_t                          cmd_time_server_publish;
    sl_btmesh_cmd_time_server_status_t                           cmd_time_server_status;
    sl_btmesh_cmd_time_client_init_t                             cmd_time_client_init;
    sl_btmesh_cmd_time_client_deinit_t                           cmd_time_client_deinit;
    sl_btmesh_cmd_time_client_get_time_t                         cmd_time_client_get_time;
    sl_btmesh_cmd_time_client_set_time_t                         cmd_time_client_set_time;
    sl_btmesh_cmd_time_client_get_time_zone_t                    cmd_time_client_get_time_zone;
    sl_btmesh_cmd_time_client_set_time_zone_t                    cmd_time_client_set_time_zone;
    sl_btmesh_cmd_time_client_get_tai_utc_delta_t                cmd_time_client_get_tai_utc_delta;
    sl_btmesh_cmd_time_client_set_tai_utc_delta_t                cmd_time_client_set_tai_utc_delta;
    sl_btmesh_cmd_time_client_get_time_role_t                    cmd_time_client_get_time_role;
    sl_btmesh_cmd_time_client_set_time_role_t                    cmd_time_client_set_time_role;
    sl_btmesh_rsp_node_init_t                                    rsp_node_init;
    sl_btmesh_rsp_node_set_exportable_keys_t                     rsp_node_set_exportable_keys;
    sl_btmesh_rsp_node_start_unprov_beaconing_t                  rsp_node_start_unprov_beaconing;
    sl_btmesh_rsp_node_stop_unprov_beaconing_t                   rsp_node_stop_unprov_beaconing;
    sl_btmesh_rsp_node_get_rssi_t                                rsp_node_get_rssi;
    sl_btmesh_rsp_node_send_input_oob_request_response_t         rsp_node_send_input_oob_request_response;
    sl_btmesh_rsp_node_get_uuid_t                                rsp_node_get_uuid;
    sl_btmesh_rsp_node_set_provisioning_data_t                   rsp_node_set_provisioning_data;
    sl_btmesh_rsp_node_init_oob_t                                rsp_node_init_oob;
    sl_btmesh_rsp_node_set_ivrecovery_mode_t                     rsp_node_set_ivrecovery_mode;
    sl_btmesh_rsp_node_get_ivrecovery_mode_t                     rsp_node_get_ivrecovery_mode;
    sl_btmesh_rsp_node_get_statistics_t                          rsp_node_get_statistics;
    sl_btmesh_rsp_node_clear_statistics_t                        rsp_node_clear_statistics;
    sl_btmesh_rsp_node_set_net_relay_delay_t                     rsp_node_set_net_relay_delay;
    sl_btmesh_rsp_node_get_net_relay_delay_t                     rsp_node_get_net_relay_delay;
    sl_btmesh_rsp_node_get_ivupdate_state_t                      rsp_node_get_ivupdate_state;
    sl_btmesh_rsp_node_request_ivupdate_t                        rsp_node_request_ivupdate;
    sl_btmesh_rsp_node_get_seq_remaining_t                       rsp_node_get_seq_remaining;
    sl_btmesh_rsp_node_save_replay_protection_list_t             rsp_node_save_replay_protection_list;
    sl_btmesh_rsp_node_set_uuid_t                                rsp_node_set_uuid;
    sl_btmesh_rsp_node_get_replay_protection_list_status_t       rsp_node_get_replay_protection_list_status;
    sl_btmesh_rsp_node_get_element_address_t                     rsp_node_get_element_address;
    sl_btmesh_rsp_node_send_static_oob_request_response_t        rsp_node_send_static_oob_request_response;
    sl_btmesh_rsp_node_reset_t                                   rsp_node_reset;
    sl_btmesh_rsp_node_set_beacon_reporting_t                    rsp_node_set_beacon_reporting;
    sl_btmesh_rsp_node_set_iv_update_age_t                       rsp_node_set_iv_update_age;
    sl_btmesh_rsp_node_get_key_count_t                           rsp_node_get_key_count;
    sl_btmesh_rsp_node_get_key_t                                 rsp_node_get_key;
    sl_btmesh_rsp_node_get_networks_t                            rsp_node_get_networks;
    sl_btmesh_rsp_node_get_element_seqnum_t                      rsp_node_get_element_seqnum;
    sl_btmesh_rsp_node_set_model_option_t                        rsp_node_set_model_option;
    sl_btmesh_rsp_node_get_local_dcd_t                           rsp_node_get_local_dcd;
    sl_btmesh_rsp_node_power_off_t                               rsp_node_power_off;
    sl_btmesh_rsp_node_set_adv_phy_t                             rsp_node_set_adv_phy;
    sl_btmesh_rsp_node_get_adv_phy_t                             rsp_node_get_adv_phy;
    sl_btmesh_rsp_node_set_unprov_beaconing_adv_interval_t       rsp_node_set_unprov_beaconing_adv_interval;
    sl_btmesh_rsp_node_set_proxy_service_adv_interval_t          rsp_node_set_proxy_service_adv_interval;
    sl_btmesh_rsp_node_set_provisioning_service_adv_interval_t   rsp_node_set_provisioning_service_adv_interval;
    sl_btmesh_rsp_prov_init_t                                    rsp_prov_init;
    sl_btmesh_rsp_prov_scan_unprov_beacons_t                     rsp_prov_scan_unprov_beacons;
    sl_btmesh_rsp_prov_create_provisioning_session_t             rsp_prov_create_provisioning_session;
    sl_btmesh_rsp_prov_set_provisioning_suspend_event_t          rsp_prov_set_provisioning_suspend_event;
    sl_btmesh_rsp_prov_provision_adv_device_t                    rsp_prov_provision_adv_device;
    sl_btmesh_rsp_prov_provision_gatt_device_t                   rsp_prov_provision_gatt_device;
    sl_btmesh_rsp_prov_continue_provisioning_t                   rsp_prov_continue_provisioning;
    sl_btmesh_rsp_prov_abort_provisioning_t                      rsp_prov_abort_provisioning;
    sl_btmesh_rsp_prov_set_device_address_t                      rsp_prov_set_device_address;
    sl_btmesh_rsp_prov_create_network_t                          rsp_prov_create_network;
    sl_btmesh_rsp_prov_create_appkey_t                           rsp_prov_create_appkey;
    sl_btmesh_rsp_prov_send_oob_pkey_response_t                  rsp_prov_send_oob_pkey_response;
    sl_btmesh_rsp_prov_send_oob_auth_response_t                  rsp_prov_send_oob_auth_response;
    sl_btmesh_rsp_prov_set_oob_requirements_t                    rsp_prov_set_oob_requirements;
    sl_btmesh_rsp_prov_start_key_refresh_t                       rsp_prov_start_key_refresh;
    sl_btmesh_rsp_prov_get_key_refresh_exclusion_t               rsp_prov_get_key_refresh_exclusion;
    sl_btmesh_rsp_prov_set_key_refresh_exclusion_t               rsp_prov_set_key_refresh_exclusion;
    sl_btmesh_rsp_prov_get_ddb_entry_t                           rsp_prov_get_ddb_entry;
    sl_btmesh_rsp_prov_delete_ddb_entry_t                        rsp_prov_delete_ddb_entry;
    sl_btmesh_rsp_prov_add_ddb_entry_t                           rsp_prov_add_ddb_entry;
    sl_btmesh_rsp_prov_list_ddb_entries_t                        rsp_prov_list_ddb_entries;
    sl_btmesh_rsp_prov_initialize_network_t                      rsp_prov_initialize_network;
    sl_btmesh_rsp_prov_get_key_refresh_appkey_exclusion_t        rsp_prov_get_key_refresh_appkey_exclusion;
    sl_btmesh_rsp_prov_set_key_refresh_appkey_exclusion_t        rsp_prov_set_key_refresh_appkey_exclusion;
    sl_btmesh_rsp_prov_stop_scan_unprov_beacons_t                rsp_prov_stop_scan_unprov_beacons;
    sl_btmesh_rsp_prov_update_device_netkey_index_t              rsp_prov_update_device_netkey_index;
    sl_btmesh_rsp_prov_suspend_key_refresh_t                     rsp_prov_suspend_key_refresh;
    sl_btmesh_rsp_prov_resume_key_refresh_t                      rsp_prov_resume_key_refresh;
    sl_btmesh_rsp_prov_get_key_refresh_phase_t                   rsp_prov_get_key_refresh_phase;
    sl_btmesh_rsp_prov_start_key_refresh_from_phase_t            rsp_prov_start_key_refresh_from_phase;
    sl_btmesh_rsp_prov_flush_key_refresh_state_t                 rsp_prov_flush_key_refresh_state;
    sl_btmesh_rsp_prov_test_identity_t                           rsp_prov_test_identity;
    sl_btmesh_rsp_proxy_connect_t                                rsp_proxy_connect;
    sl_btmesh_rsp_proxy_disconnect_t                             rsp_proxy_disconnect;
    sl_btmesh_rsp_proxy_set_filter_type_t                        rsp_proxy_set_filter_type;
    sl_btmesh_rsp_proxy_allow_t                                  rsp_proxy_allow;
    sl_btmesh_rsp_proxy_deny_t                                   rsp_proxy_deny;
    sl_btmesh_rsp_proxy_optimisation_toggle_t                    rsp_proxy_optimisation_toggle;
    sl_btmesh_rsp_vendor_model_send_t                            rsp_vendor_model_send;
    sl_btmesh_rsp_vendor_model_set_publication_t                 rsp_vendor_model_set_publication;
    sl_btmesh_rsp_vendor_model_clear_publication_t               rsp_vendor_model_clear_publication;
    sl_btmesh_rsp_vendor_model_publish_t                         rsp_vendor_model_publish;
    sl_btmesh_rsp_vendor_model_init_t                            rsp_vendor_model_init;
    sl_btmesh_rsp_vendor_model_deinit_t                          rsp_vendor_model_deinit;
    sl_btmesh_rsp_vendor_model_send_tracked_t                    rsp_vendor_model_send_tracked;
    sl_btmesh_rsp_vendor_model_set_publication_tracked_t         rsp_vendor_model_set_publication_tracked;
    sl_btmesh_rsp_health_client_get_t                            rsp_health_client_get;
    sl_btmesh_rsp_health_client_clear_t                          rsp_health_client_clear;
    sl_btmesh_rsp_health_client_test_t                           rsp_health_client_test;
    sl_btmesh_rsp_health_client_get_period_t                     rsp_health_client_get_period;
    sl_btmesh_rsp_health_client_set_period_t                     rsp_health_client_set_period;
    sl_btmesh_rsp_health_client_get_attention_t                  rsp_health_client_get_attention;
    sl_btmesh_rsp_health_client_set_attention_t                  rsp_health_client_set_attention;
    sl_btmesh_rsp_health_server_set_fault_t                      rsp_health_server_set_fault;
    sl_btmesh_rsp_health_server_clear_fault_t                    rsp_health_server_clear_fault;
    sl_btmesh_rsp_health_server_send_test_response_t             rsp_health_server_send_test_response;
    sl_btmesh_rsp_generic_client_get_t                           rsp_generic_client_get;
    sl_btmesh_rsp_generic_client_set_t                           rsp_generic_client_set;
    sl_btmesh_rsp_generic_client_publish_t                       rsp_generic_client_publish;
    sl_btmesh_rsp_generic_client_get_params_t                    rsp_generic_client_get_params;
    sl_btmesh_rsp_generic_client_init_t                          rsp_generic_client_init;
    sl_btmesh_rsp_generic_client_init_common_t                   rsp_generic_client_init_common;
    sl_btmesh_rsp_generic_client_init_on_off_t                   rsp_generic_client_init_on_off;
    sl_btmesh_rsp_generic_client_init_level_t                    rsp_generic_client_init_level;
    sl_btmesh_rsp_generic_client_init_default_transition_time_t  rsp_generic_client_init_default_transition_time;
    sl_btmesh_rsp_generic_client_init_power_on_off_t             rsp_generic_client_init_power_on_off;
    sl_btmesh_rsp_generic_client_init_power_level_t              rsp_generic_client_init_power_level;
    sl_btmesh_rsp_generic_client_init_battery_t                  rsp_generic_client_init_battery;
    sl_btmesh_rsp_generic_client_init_location_t                 rsp_generic_client_init_location;
    sl_btmesh_rsp_generic_client_init_property_t                 rsp_generic_client_init_property;
    sl_btmesh_rsp_generic_client_init_lightness_t                rsp_generic_client_init_lightness;
    sl_btmesh_rsp_generic_client_init_ctl_t                      rsp_generic_client_init_ctl;
    sl_btmesh_rsp_generic_client_init_hsl_t                      rsp_generic_client_init_hsl;
    sl_btmesh_rsp_generic_server_respond_t                       rsp_generic_server_respond;
    sl_btmesh_rsp_generic_server_update_t                        rsp_generic_server_update;
    sl_btmesh_rsp_generic_server_publish_t                       rsp_generic_server_publish;
    sl_btmesh_rsp_generic_server_init_t                          rsp_generic_server_init;
    sl_btmesh_rsp_generic_server_init_common_t                   rsp_generic_server_init_common;
    sl_btmesh_rsp_generic_server_init_on_off_t                   rsp_generic_server_init_on_off;
    sl_btmesh_rsp_generic_server_init_level_t                    rsp_generic_server_init_level;
    sl_btmesh_rsp_generic_server_init_default_transition_time_t  rsp_generic_server_init_default_transition_time;
    sl_btmesh_rsp_generic_server_init_power_on_off_t             rsp_generic_server_init_power_on_off;
    sl_btmesh_rsp_generic_server_init_power_level_t              rsp_generic_server_init_power_level;
    sl_btmesh_rsp_generic_server_init_battery_t                  rsp_generic_server_init_battery;
    sl_btmesh_rsp_generic_server_init_location_t                 rsp_generic_server_init_location;
    sl_btmesh_rsp_generic_server_init_property_t                 rsp_generic_server_init_property;
    sl_btmesh_rsp_generic_server_init_lightness_t                rsp_generic_server_init_lightness;
    sl_btmesh_rsp_generic_server_init_ctl_t                      rsp_generic_server_init_ctl;
    sl_btmesh_rsp_generic_server_init_hsl_t                      rsp_generic_server_init_hsl;
    sl_btmesh_rsp_generic_server_get_cached_state_t              rsp_generic_server_get_cached_state;
    sl_btmesh_rsp_test_get_nettx_t                               rsp_test_get_nettx;
    sl_btmesh_rsp_test_set_nettx_t                               rsp_test_set_nettx;
    sl_btmesh_rsp_test_get_relay_t                               rsp_test_get_relay;
    sl_btmesh_rsp_test_set_relay_t                               rsp_test_set_relay;
    sl_btmesh_rsp_test_set_adv_scan_params_t                     rsp_test_set_adv_scan_params;
    sl_btmesh_rsp_test_set_ivupdate_test_mode_t                  rsp_test_set_ivupdate_test_mode;
    sl_btmesh_rsp_test_get_ivupdate_test_mode_t                  rsp_test_get_ivupdate_test_mode;
    sl_btmesh_rsp_test_set_segment_send_delay_t                  rsp_test_set_segment_send_delay;
    sl_btmesh_rsp_test_set_ivupdate_state_t                      rsp_test_set_ivupdate_state;
    sl_btmesh_rsp_test_send_beacons_t                            rsp_test_send_beacons;
    sl_btmesh_rsp_test_bind_local_model_app_t                    rsp_test_bind_local_model_app;
    sl_btmesh_rsp_test_unbind_local_model_app_t                  rsp_test_unbind_local_model_app;
    sl_btmesh_rsp_test_add_local_model_sub_t                     rsp_test_add_local_model_sub;
    sl_btmesh_rsp_test_remove_local_model_sub_t                  rsp_test_remove_local_model_sub;
    sl_btmesh_rsp_test_add_local_model_sub_va_t                  rsp_test_add_local_model_sub_va;
    sl_btmesh_rsp_test_remove_local_model_sub_va_t               rsp_test_remove_local_model_sub_va;
    sl_btmesh_rsp_test_get_local_model_sub_t                     rsp_test_get_local_model_sub;
    sl_btmesh_rsp_test_set_local_model_pub_t                     rsp_test_set_local_model_pub;
    sl_btmesh_rsp_test_set_local_model_pub_va_t                  rsp_test_set_local_model_pub_va;
    sl_btmesh_rsp_test_get_local_model_pub_t                     rsp_test_get_local_model_pub;
    sl_btmesh_rsp_test_set_local_heartbeat_subscription_t        rsp_test_set_local_heartbeat_subscription;
    sl_btmesh_rsp_test_get_local_heartbeat_subscription_t        rsp_test_get_local_heartbeat_subscription;
    sl_btmesh_rsp_test_get_local_heartbeat_publication_t         rsp_test_get_local_heartbeat_publication;
    sl_btmesh_rsp_test_set_local_heartbeat_publication_t         rsp_test_set_local_heartbeat_publication;
    sl_btmesh_rsp_test_set_local_config_t                        rsp_test_set_local_config;
    sl_btmesh_rsp_test_get_local_config_t                        rsp_test_get_local_config;
    sl_btmesh_rsp_test_add_local_key_t                           rsp_test_add_local_key;
    sl_btmesh_rsp_test_remove_local_key_t                        rsp_test_remove_local_key;
    sl_btmesh_rsp_test_update_local_key_t                        rsp_test_update_local_key;
    sl_btmesh_rsp_test_set_sar_config_t                          rsp_test_set_sar_config;
    sl_btmesh_rsp_test_set_adv_bearer_state_t                    rsp_test_set_adv_bearer_state;
    sl_btmesh_rsp_test_prov_get_device_key_t                     rsp_test_prov_get_device_key;
    sl_btmesh_rsp_test_prov_prepare_key_refresh_t                rsp_test_prov_prepare_key_refresh;
    sl_btmesh_rsp_test_cancel_segmented_tx_t                     rsp_test_cancel_segmented_tx;
    sl_btmesh_rsp_test_set_iv_index_t                            rsp_test_set_iv_index;
    sl_btmesh_rsp_test_set_element_seqnum_t                      rsp_test_set_element_seqnum;
    sl_btmesh_rsp_test_set_model_option_t                        rsp_test_set_model_option;
    sl_btmesh_rsp_test_get_local_model_app_bindings_t            rsp_test_get_local_model_app_bindings;
    sl_btmesh_rsp_test_get_replay_protection_list_entry_t        rsp_test_get_replay_protection_list_entry;
    sl_btmesh_rsp_test_clear_replay_protection_list_entry_t      rsp_test_clear_replay_protection_list_entry;
    sl_btmesh_rsp_test_set_replay_protection_list_diagnostics_t  rsp_test_set_replay_protection_list_diagnostics;
    sl_btmesh_rsp_test_get_model_option_t                        rsp_test_get_model_option;
    sl_btmesh_rsp_test_get_default_ttl_t                         rsp_test_get_default_ttl;
    sl_btmesh_rsp_test_set_default_ttl_t                         rsp_test_set_default_ttl;
    sl_btmesh_rsp_test_get_gatt_proxy_t                          rsp_test_get_gatt_proxy;
    sl_btmesh_rsp_test_set_gatt_proxy_t                          rsp_test_set_gatt_proxy;
    sl_btmesh_rsp_test_get_identity_t                            rsp_test_get_identity;
    sl_btmesh_rsp_test_set_identity_t                            rsp_test_set_identity;
    sl_btmesh_rsp_test_get_friend_t                              rsp_test_get_friend;
    sl_btmesh_rsp_test_set_friend_t                              rsp_test_set_friend;
    sl_btmesh_rsp_test_get_beacon_t                              rsp_test_get_beacon;
    sl_btmesh_rsp_test_set_beacon_t                              rsp_test_set_beacon;
    sl_btmesh_rsp_lpn_init_t                                     rsp_lpn_init;
    sl_btmesh_rsp_lpn_deinit_t                                   rsp_lpn_deinit;
    sl_btmesh_rsp_lpn_establish_friendship_t                     rsp_lpn_establish_friendship;
    sl_btmesh_rsp_lpn_poll_t                                     rsp_lpn_poll;
    sl_btmesh_rsp_lpn_terminate_friendship_t                     rsp_lpn_terminate_friendship;
    sl_btmesh_rsp_lpn_config_t                                   rsp_lpn_config;
    sl_btmesh_rsp_friend_init_t                                  rsp_friend_init;
    sl_btmesh_rsp_friend_deinit_t                                rsp_friend_deinit;
    sl_btmesh_rsp_config_client_cancel_request_t                 rsp_config_client_cancel_request;
    sl_btmesh_rsp_config_client_get_request_status_t             rsp_config_client_get_request_status;
    sl_btmesh_rsp_config_client_get_default_timeout_t            rsp_config_client_get_default_timeout;
    sl_btmesh_rsp_config_client_set_default_timeout_t            rsp_config_client_set_default_timeout;
