espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
    sl_btmesh_rsp_config_client_add_netkey_t                     rsp_config_client_add_netkey;
    sl_btmesh_rsp_config_client_remove_netkey_t                  rsp_config_client_remove_netkey;
    sl_btmesh_rsp_config_client_list_netkeys_t                   rsp_config_client_list_netkeys;
    sl_btmesh_rsp_config_client_add_appkey_t                     rsp_config_client_add_appkey;
    sl_btmesh_rsp_config_client_remove_appkey_t                  rsp_config_client_remove_appkey;
    sl_btmesh_rsp_config_client_list_appkeys_t                   rsp_config_client_list_appkeys;
    sl_btmesh_rsp_config_client_bind_model_t                     rsp_config_client_bind_model;
    sl_btmesh_rsp_config_client_unbind_model_t                   rsp_config_client_unbind_model;
    sl_btmesh_rsp_config_client_list_bindings_t                  rsp_config_client_list_bindings;
    sl_btmesh_rsp_config_client_get_model_pub_t                  rsp_config_client_get_model_pub;
    sl_btmesh_rsp_config_client_set_model_pub_t                  rsp_config_client_set_model_pub;
    sl_btmesh_rsp_config_client_set_model_pub_va_t               rsp_config_client_set_model_pub_va;
    sl_btmesh_rsp_config_client_add_model_sub_t                  rsp_config_client_add_model_sub;
    sl_btmesh_rsp_config_client_add_model_sub_va_t               rsp_config_client_add_model_sub_va;
    sl_btmesh_rsp_config_client_remove_model_sub_t               rsp_config_client_remove_model_sub;
    sl_btmesh_rsp_config_client_remove_model_sub_va_t            rsp_config_client_remove_model_sub_va;
    sl_btmesh_rsp_config_client_set_model_sub_t                  rsp_config_client_set_model_sub;
    sl_btmesh_rsp_config_client_set_model_sub_va_t               rsp_config_client_set_model_sub_va;
    sl_btmesh_rsp_config_client_clear_model_sub_t                rsp_config_client_clear_model_sub;
    sl_btmesh_rsp_config_client_list_subs_t                      rsp_config_client_list_subs;
    sl_btmesh_rsp_config_client_get_heartbeat_pub_t              rsp_config_client_get_heartbeat_pub;
    sl_btmesh_rsp_config_client_set_heartbeat_pub_t              rsp_config_client_set_heartbeat_pub;
    sl_btmesh_rsp_config_client_get_heartbeat_sub_t              rsp_config_client_get_heartbeat_sub;
    sl_btmesh_rsp_config_client_set_heartbeat_sub_t              rsp_config_client_set_heartbeat_sub;
    sl_btmesh_rsp_config_client_get_beacon_t                     rsp_config_client_get_beacon;
    sl_btmesh_rsp_config_client_set_beacon_t                     rsp_config_client_set_beacon;
    sl_btmesh_rsp_config_client_get_default_ttl_t                rsp_config_client_get_default_ttl;
    sl_btmesh_rsp_config_client_set_default_ttl_t                rsp_config_client_set_default_ttl;
    sl_btmesh_rsp_config_client_get_gatt_proxy_t                 rsp_config_client_get_gatt_proxy;
    sl_btmesh_rsp_config_client_set_gatt_proxy_t                 rsp_config_client_set_gatt_proxy;
    sl_btmesh_rsp_config_client_get_relay_t                      rsp_config_client_get_relay;
    sl_btmesh_rsp_config_client_set_relay_t                      rsp_config_client_set_relay;
    sl_btmesh_rsp_config_client_get_network_transmit_t           rsp_config_client_get_network_transmit;
    sl_btmesh_rsp_config_client_set_network_transmit_t           rsp_config_client_set_network_transmit;
    sl_btmesh_rsp_config_client_get_identity_t                   rsp_config_client_get_identity;
    sl_btmesh_rsp_config_client_set_identity_t                   rsp_config_client_set_identity;
    sl_btmesh_rsp_config_client_get_friend_t                     rsp_config_client_get_friend;
    sl_btmesh_rsp_config_client_set_friend_t                     rsp_config_client_set_friend;
    sl_btmesh_rsp_config_client_get_key_refresh_phase_t          rsp_config_client_get_key_refresh_phase;
    sl_btmesh_rsp_config_client_get_lpn_polltimeout_t            rsp_config_client_get_lpn_polltimeout;
    sl_btmesh_rsp_config_client_get_dcd_t                        rsp_config_client_get_dcd;
    sl_btmesh_rsp_config_client_reset_node_t                     rsp_config_client_reset_node;
    sl_btmesh_rsp_sensor_server_init_t                           rsp_sensor_server_init;
    sl_btmesh_rsp_sensor_server_deinit_t                         rsp_sensor_server_deinit;
    sl_btmesh_rsp_sensor_server_send_descriptor_status_t         rsp_sensor_server_send_descriptor_status;
    sl_btmesh_rsp_sensor_server_send_status_t                    rsp_sensor_server_send_status;
    sl_btmesh_rsp_sensor_server_send_column_status_t             rsp_sensor_server_send_column_status;
    sl_btmesh_rsp_sensor_server_send_series_status_t             rsp_sensor_server_send_series_status;
    sl_btmesh_rsp_sensor_setup_server_send_cadence_status_t      rsp_sensor_setup_server_send_cadence_status;
    sl_btmesh_rsp_sensor_setup_server_send_settings_status_t     rsp_sensor_setup_server_send_settings_status;
    sl_btmesh_rsp_sensor_setup_server_send_setting_status_t      rsp_sensor_setup_server_send_setting_status;
    sl_btmesh_rsp_sensor_client_init_t                           rsp_sensor_client_init;
    sl_btmesh_rsp_sensor_client_deinit_t                         rsp_sensor_client_deinit;
    sl_btmesh_rsp_sensor_client_get_descriptor_t                 rsp_sensor_client_get_descriptor;
    sl_btmesh_rsp_sensor_client_get_t                            rsp_sensor_client_get;
    sl_btmesh_rsp_sensor_client_get_column_t                     rsp_sensor_client_get_column;
    sl_btmesh_rsp_sensor_client_get_series_t                     rsp_sensor_client_get_series;
    sl_btmesh_rsp_sensor_client_get_cadence_t                    rsp_sensor_client_get_cadence;
    sl_btmesh_rsp_sensor_client_set_cadence_t                    rsp_sensor_client_set_cadence;
    sl_btmesh_rsp_sensor_client_get_settings_t                   rsp_sensor_client_get_settings;
    sl_btmesh_rsp_sensor_client_get_setting_t                    rsp_sensor_client_get_setting;
    sl_btmesh_rsp_sensor_client_set_setting_t                    rsp_sensor_client_set_setting;
    sl_btmesh_rsp_lc_client_init_t                               rsp_lc_client_init;
    sl_btmesh_rsp_lc_client_get_mode_t                           rsp_lc_client_get_mode;
    sl_btmesh_rsp_lc_client_set_mode_t                           rsp_lc_client_set_mode;
    sl_btmesh_rsp_lc_client_get_om_t                             rsp_lc_client_get_om;
    sl_btmesh_rsp_lc_client_set_om_t                             rsp_lc_client_set_om;
    sl_btmesh_rsp_lc_client_get_light_onoff_t                    rsp_lc_client_get_light_onoff;
    sl_btmesh_rsp_lc_client_set_light_onoff_t                    rsp_lc_client_set_light_onoff;
    sl_btmesh_rsp_lc_client_get_property_t                       rsp_lc_client_get_property;
    sl_btmesh_rsp_lc_client_set_property_t                       rsp_lc_client_set_property;
    sl_btmesh_rsp_lc_server_init_t                               rsp_lc_server_init;
    sl_btmesh_rsp_lc_server_deinit_t                             rsp_lc_server_deinit;
    sl_btmesh_rsp_lc_server_update_mode_t                        rsp_lc_server_update_mode;
    sl_btmesh_rsp_lc_server_update_om_t                          rsp_lc_server_update_om;
    sl_btmesh_rsp_lc_server_update_light_onoff_t                 rsp_lc_server_update_light_onoff;
    sl_btmesh_rsp_lc_server_init_all_properties_t                rsp_lc_server_init_all_properties;
    sl_btmesh_rsp_lc_server_set_publish_mask_t                   rsp_lc_server_set_publish_mask;
    sl_btmesh_rsp_lc_server_set_regulator_interval_t             rsp_lc_server_set_regulator_interval;
    sl_btmesh_rsp_lc_server_set_event_mask_t                     rsp_lc_server_set_event_mask;
    sl_btmesh_rsp_lc_server_get_lc_state_t                       rsp_lc_server_get_lc_state;
    sl_btmesh_rsp_lc_setup_server_update_property_t              rsp_lc_setup_server_update_property;
    sl_btmesh_rsp_scene_client_init_t                            rsp_scene_client_init;
    sl_btmesh_rsp_scene_client_get_t                             rsp_scene_client_get;
    sl_btmesh_rsp_scene_client_get_register_t                    rsp_scene_client_get_register;
    sl_btmesh_rsp_scene_client_recall_t                          rsp_scene_client_recall;
    sl_btmesh_rsp_scene_client_store_t                           rsp_scene_client_store;
    sl_btmesh_rsp_scene_client_delete_t                          rsp_scene_client_delete;
    sl_btmesh_rsp_scene_server_init_t                            rsp_scene_server_init;
    sl_btmesh_rsp_scene_server_deinit_t                          rsp_scene_server_deinit;
    sl_btmesh_rsp_scene_server_reset_register_t                  rsp_scene_server_reset_register;
    sl_btmesh_rsp_scene_server_enable_compact_recall_events_t    rsp_scene_server_enable_compact_recall_events;
    sl_btmesh_rsp_scene_setup_server_init_t                      rsp_scene_setup_server_init;
    sl_btmesh_rsp_scheduler_client_init_t                        rsp_scheduler_client_init;
    sl_btmesh_rsp_scheduler_client_deinit_t                      rsp_scheduler_client_deinit;
    sl_btmesh_rsp_scheduler_client_get_t                         rsp_scheduler_client_get;
    sl_btmesh_rsp_scheduler_client_get_action_t                  rsp_scheduler_client_get_action;
    sl_btmesh_rsp_scheduler_client_set_action_t                  rsp_scheduler_client_set_action;
    sl_btmesh_rsp_scheduler_server_init_t                        rsp_scheduler_server_init;
    sl_btmesh_rsp_scheduler_server_deinit_t                      rsp_scheduler_server_deinit;
    sl_btmesh_rsp_scheduler_server_get_t                         rsp_scheduler_server_get;
    sl_btmesh_rsp_scheduler_server_get_action_t                  rsp_scheduler_server_get_action;
    sl_btmesh_rsp_scheduler_server_set_action_t                  rsp_scheduler_server_set_action;
    sl_btmesh_rsp_time_server_init_t                             rsp_time_server_init;
    sl_btmesh_rsp_time_server_deinit_t                           rsp_time_server_deinit;
    sl_btmesh_rsp_time_server_get_time_t                         rsp_time_server_get_time;
    sl_btmesh_rsp_time_server_set_time_t                         rsp_time_server_set_time;
    sl_btmesh_rsp_time_server_get_time_zone_offset_new_t         rsp_time_server_get_time_zone_offset_new;
    sl_btmesh_rsp_time_server_set_time_zone_offset_new_t         rsp_time_server_set_time_zone_offset_new;
    sl_btmesh_rsp_time_server_get_tai_utc_delta_new_t            rsp_time_server_get_tai_utc_delta_new;
    sl_btmesh_rsp_time_server_set_tai_utc_delta_new_t            rsp_time_server_set_tai_utc_delta_new;
    sl_btmesh_rsp_time_server_get_time_role_t                    rsp_time_server_get_time_role;
    sl_btmesh_rsp_time_server_set_time_role_t                    rsp_time_server_set_time_role;
    sl_btmesh_rsp_time_server_get_datetime_t                     rsp_time_server_get_datetime;
    sl_btmesh_rsp_time_server_publish_t                          rsp_time_server_publish;
    sl_btmesh_rsp_time_server_status_t                           rsp_time_server_status;
    sl_btmesh_rsp_time_client_init_t                             rsp_time_client_init;
    sl_btmesh_rsp_time_client_deinit_t                           rsp_time_client_deinit;
    sl_btmesh_rsp_time_client_get_time_t                         rsp_time_client_get_time;
    sl_btmesh_rsp_time_client_set_time_t                         rsp_time_client_set_time;
    sl_btmesh_rsp_time_client_get_time_zone_t                    rsp_time_client_get_time_zone;
    sl_btmesh_rsp_time_client_set_time_zone_t                    rsp_time_client_set_time_zone;
    sl_btmesh_rsp_time_client_get_tai_utc_delta_t                rsp_time_client_get_tai_utc_delta;
    sl_btmesh_rsp_time_client_set_tai_utc_delta_t                rsp_time_client_set_tai_utc_delta;
    sl_btmesh_rsp_time_client_get_time_role_t                    rsp_time_client_get_time_role;
    sl_btmesh_rsp_time_client_set_time_role_t                    rsp_time_client_set_time_role;
    sl_btmesh_rsp_migration_migrate_keys_t                       rsp_migration_migrate_keys;
    sl_btmesh_rsp_migration_migrate_ddb_t                        rsp_migration_migrate_ddb;
    sl_btmesh_evt_node_initialized_t                             evt_node_initialized;
    sl_btmesh_evt_node_provisioned_t                             evt_node_provisioned;
    sl_btmesh_evt_node_config_get_t                              evt_node_config_get;
    sl_btmesh_evt_node_config_set_t                              evt_node_config_set;
    sl_btmesh_evt_node_display_output_oob_t                      evt_node_display_output_oob;
    sl_btmesh_evt_node_input_oob_request_t                       evt_node_input_oob_request;
    sl_btmesh_evt_node_provisioning_started_t                    evt_node_provisioning_started;
    sl_btmesh_evt_node_provisioning_failed_t                     evt_node_provisioning_failed;
    sl_btmesh_evt_node_key_added_t                               evt_node_key_added;
    sl_btmesh_evt_node_model_config_changed_t                    evt_node_model_config_changed;
    sl_btmesh_evt_node_ivrecovery_needed_t                       evt_node_ivrecovery_needed;
    sl_btmesh_evt_node_changed_ivupdate_state_t                  evt_node_changed_ivupdate_state;
    sl_btmesh_evt_node_key_removed_t                             evt_node_key_removed;
    sl_btmesh_evt_node_key_updated_t                             evt_node_key_updated;
    sl_btmesh_evt_node_heartbeat_t                               evt_node_heartbeat;
    sl_btmesh_evt_node_heartbeat_start_t                         evt_node_heartbeat_start;
    sl_btmesh_evt_node_heartbeat_stop_t                          evt_node_heartbeat_stop;
    sl_btmesh_evt_node_beacon_received_t                         evt_node_beacon_received;
    sl_btmesh_evt_node_local_dcd_data_t                          evt_node_local_dcd_data;
    sl_btmesh_evt_node_local_dcd_data_end_t                      evt_node_local_dcd_data_end;
    sl_btmesh_evt_node_start_received_t                          evt_node_start_received;
    sl_btmesh_evt_prov_initialized_t                             evt_prov_initialized;
    sl_btmesh_evt_prov_provisioning_suspended_t                  evt_prov_provisioning_suspended;
    sl_btmesh_evt_prov_capabilities_t                            evt_prov_capabilities;
    sl_btmesh_evt_prov_provisioning_failed_t                     evt_prov_provisioning_failed;
    sl_btmesh_evt_prov_device_provisioned_t                      evt_prov_device_provisioned;
    sl_btmesh_evt_prov_unprov_beacon_t                           evt_prov_unprov_beacon;
    sl_btmesh_evt_prov_oob_pkey_request_t                        evt_prov_oob_pkey_request;
    sl_btmesh_evt_prov_oob_auth_request_t                        evt_prov_oob_auth_request;
    sl_btmesh_evt_prov_oob_display_input_t                       evt_prov_oob_display_input;
    sl_btmesh_evt_prov_ddb_list_t                                evt_prov_ddb_list;
    sl_btmesh_evt_prov_uri_t                                     evt_prov_uri;
    sl_btmesh_evt_prov_key_refresh_phase_update_t                evt_prov_key_refresh_phase_update;
    sl_btmesh_evt_prov_key_refresh_node_update_t                 evt_prov_key_refresh_node_update;
    sl_btmesh_evt_prov_key_refresh_complete_t                    evt_prov_key_refresh_complete;
    sl_btmesh_evt_prov_add_ddb_entry_complete_t                  evt_prov_add_ddb_entry_complete;
    sl_btmesh_evt_prov_delete_ddb_entry_complete_t               evt_prov_delete_ddb_entry_complete;
    sl_btmesh_evt_prov_initialization_failed_t                   evt_prov_initialization_failed;
    sl_btmesh_evt_prov_start_sent_t                              evt_prov_start_sent;
    sl_btmesh_evt_proxy_connected_t                              evt_proxy_connected;
    sl_btmesh_evt_proxy_disconnected_t                           evt_proxy_disconnected;
    sl_btmesh_evt_proxy_filter_status_t                          evt_proxy_filter_status;
    sl_btmesh_evt_vendor_model_receive_t                         evt_vendor_model_receive;
    sl_btmesh_evt_vendor_model_send_complete_t                   evt_vendor_model_send_complete;
    sl_btmesh_evt_health_client_server_status_t                  evt_health_client_server_status;
    sl_btmesh_evt_health_client_server_status_period_t           evt_health_client_server_status_period;
    sl_btmesh_evt_health_client_server_status_attention_t        evt_health_client_server_status_attention;
    sl_btmesh_evt_health_server_attention_t                      evt_health_server_attention;
    sl_btmesh_evt_health_server_test_request_t                   evt_health_server_test_request;
    sl_btmesh_evt_generic_client_server_status_t                 evt_generic_client_server_status;
    sl_btmesh_evt_generic_server_client_request_t                evt_generic_server_client_request;
    sl_btmesh_evt_generic_server_state_changed_t                 evt_generic_server_state_changed;
    sl_btmesh_evt_generic_server_state_recall_t                  evt_generic_server_state_recall;
    sl_btmesh_evt_test_local_heartbeat_subscription_complete_t   evt_test_local_heartbeat_subscription_complete;
    sl_btmesh_evt_test_replay_protection_list_entry_set_t        evt_test_replay_protection_list_entry_set;
    sl_btmesh_evt_test_replay_protection_list_entry_cleared_t    evt_test_replay_protection_list_entry_cleared;
    sl_btmesh_evt_test_replay_protection_list_saved_t            evt_test_replay_protection_list_saved;
    sl_btmesh_evt_lpn_friendship_established_t                   evt_lpn_friendship_established;
    sl_btmesh_evt_lpn_friendship_failed_t                        evt_lpn_friendship_failed;
    sl_btmesh_evt_lpn_friendship_terminated_t                    evt_lpn_friendship_terminated;
    sl_btmesh_evt_friend_friendship_established_t                evt_friend_friendship_established;
    sl_btmesh_evt_friend_friendship_terminated_t                 evt_friend_friendship_terminated;
    sl_btmesh_evt_config_client_request_modified_t               evt_config_client_request_modified;
    sl_btmesh_evt_config_client_netkey_status_t                  evt_config_client_netkey_status;
    sl_btmesh_evt_config_client_netkey_list_t                    evt_config_client_netkey_list;
    sl_btmesh_evt_config_client_netkey_list_end_t                evt_config_client_netkey_list_end;
    sl_btmesh_evt_config_client_appkey_status_t                  evt_config_client_appkey_status;
    sl_btmesh_evt_config_client_appkey_list_t                    evt_config_client_appkey_list;
    sl_btmesh_evt_config_client_appkey_list_end_t                evt_config_client_appkey_list_end;
    sl_btmesh_evt_config_client_binding_status_t                 evt_config_client_binding_status;
    sl_btmesh_evt_config_client_bindings_list_t                  evt_config_client_bindings_list;
    sl_btmesh_evt_config_client_bindings_list_end_t              evt_config_client_bindings_list_end;
    sl_btmesh_evt_config_client_model_pub_status_t               evt_config_client_model_pub_status;
    sl_btmesh_evt_config_client_model_sub_status_t               evt_config_client_model_sub_status;
    sl_btmesh_evt_config_client_subs_list_t                      evt_config_client_subs_list;
    sl_btmesh_evt_config_client_subs_list_end_t                  evt_config_client_subs_list_end;
    sl_btmesh_evt_config_client_heartbeat_pub_status_t           evt_config_client_heartbeat_pub_status;
    sl_btmesh_evt_config_client_heartbeat_sub_status_t           evt_config_client_heartbeat_sub_status;
    sl_btmesh_evt_config_client_beacon_status_t                  evt_config_client_beacon_status;
    sl_btmesh_evt_config_client_default_ttl_status_t             evt_config_client_default_ttl_status;
    sl_btmesh_evt_config_client_gatt_proxy_status_t              evt_config_client_gatt_proxy_status;
    sl_btmesh_evt_config_client_relay_status_t                   evt_config_client_relay_status;
    sl_btmesh_evt_config_client_network_transmit_status_t        evt_config_client_network_transmit_status;
    sl_btmesh_evt_config_client_identity_status_t                evt_config_client_identity_status;
    sl_btmesh_evt_config_client_friend_status_t                  evt_config_client_friend_status;
    sl_btmesh_evt_config_client_key_refresh_phase_status_t       evt_config_client_key_refresh_phase_status;
    sl_btmesh_evt_config_client_lpn_polltimeout_status_t         evt_config_client_lpn_polltimeout_status;
    sl_btmesh_evt_config_client_dcd_data_t                       evt_config_client_dcd_data;
    sl_btmesh_evt_config_client_dcd_data_end_t                   evt_config_client_dcd_data_end;
    sl_btmesh_evt_config_client_reset_status_t                   evt_config_client_reset_status;
    sl_btmesh_evt_sensor_server_get_request_t                    evt_sensor_server_get_request;
    sl_btmesh_evt_sensor_server_get_column_request_t             evt_sensor_server_get_column_request;
    sl_btmesh_evt_sensor_server_get_series_request_t             evt_sensor_server_get_series_request;
    sl_btmesh_evt_sensor_server_publish_t                        evt_sensor_server_publish;
    sl_btmesh_evt_sensor_setup_server_get_cadence_request_t      evt_sensor_setup_server_get_cadence_request;
    sl_btmesh_evt_sensor_setup_server_set_cadence_request_t      evt_sensor_setup_server_set_cadence_request;
    sl_btmesh_evt_sensor_setup_server_get_settings_request_t     evt_sensor_setup_server_get_settings_request;
    sl_btmesh_evt_sensor_setup_server_get_setting_request_t      evt_sensor_setup_server_get_setting_request;
    sl_btmesh_evt_sensor_setup_server_set_setting_request_t      evt_sensor_setup_server_set_setting_request;
    sl_btmesh_evt_sensor_setup_server_publish_t                  evt_sensor_setup_server_publish;
    sl_btmesh_evt_sensor_client_descriptor_status_t              evt_sensor_client_descriptor_status;
    sl_btmesh_evt_sensor_client_cadence_status_t                 evt_sensor_client_cadence_status;
    sl_btmesh_evt_sensor_client_settings_status_t                evt_sensor_client_settings_status;
    sl_btmesh_evt_sensor_client_setting_status_t                 evt_sensor_client_setting_status;
    sl_btmesh_evt_sensor_client_status_t                         evt_sensor_client_status;
    sl_btmesh_evt_sensor_client_column_status_t                  evt_sensor_client_column_status;
    sl_btmesh_evt_sensor_client_series_status_t                  evt_sensor_client_series_status;
    sl_btmesh_evt_sensor_client_publish_t                        evt_sensor_client_publish;
    sl_btmesh_evt_lc_client_mode_status_t                        evt_lc_client_mode_status;
    sl_btmesh_evt_lc_client_om_status_t                          evt_lc_client_om_status;
    sl_btmesh_evt_lc_client_light_onoff_status_t                 evt_lc_client_light_onoff_status;
    sl_btmesh_evt_lc_client_property_status_t                    evt_lc_client_property_status;
    sl_btmesh_evt_lc_server_mode_updated_t                       evt_lc_server_mode_updated;
    sl_btmesh_evt_lc_server_om_updated_t                         evt_lc_server_om_updated;
    sl_btmesh_evt_lc_server_light_onoff_updated_t                evt_lc_server_light_onoff_updated;
    sl_btmesh_evt_lc_server_occupancy_updated_t                  evt_lc_server_occupancy_updated;
    sl_btmesh_evt_lc_server_ambient_lux_level_updated_t          evt_lc_server_ambient_lux_level_updated;
    sl_btmesh_evt_lc_server_linear_output_updated_t              evt_lc_server_linear_output_updated;
    sl_btmesh_evt_lc_server_state_updated_t                      evt_lc_server_state_updated;
    sl_btmesh_evt_lc_server_regulator_debug_info_t               evt_lc_server_regulator_debug_info;
