espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_btmesh_api.h
    sl_btmesh_evt_lc_setup_server_set_property_t                 evt_lc_setup_server_set_property;
    sl_btmesh_evt_scene_client_status_t                          evt_scene_client_status;
    sl_btmesh_evt_scene_client_register_status_t                 evt_scene_client_register_status;
    sl_btmesh_evt_scene_server_get_t                             evt_scene_server_get;
    sl_btmesh_evt_scene_server_register_get_t                    evt_scene_server_register_get;
    sl_btmesh_evt_scene_server_recall_t                          evt_scene_server_recall;
    sl_btmesh_evt_scene_server_publish_t                         evt_scene_server_publish;
    sl_btmesh_evt_scene_server_compact_recall_t                  evt_scene_server_compact_recall;
    sl_btmesh_evt_scene_setup_server_store_t                     evt_scene_setup_server_store;
    sl_btmesh_evt_scene_setup_server_delete_t                    evt_scene_setup_server_delete;
    sl_btmesh_evt_scene_setup_server_publish_t                   evt_scene_setup_server_publish;
    sl_btmesh_evt_scheduler_client_status_t                      evt_scheduler_client_status;
    sl_btmesh_evt_scheduler_client_action_status_t               evt_scheduler_client_action_status;
    sl_btmesh_evt_scheduler_server_action_changed_t              evt_scheduler_server_action_changed;
    sl_btmesh_evt_scheduler_server_scene_changed_t               evt_scheduler_server_scene_changed;
    sl_btmesh_evt_scheduler_server_action_triggered_t            evt_scheduler_server_action_triggered;
    sl_btmesh_evt_time_server_time_updated_t                     evt_time_server_time_updated;
    sl_btmesh_evt_time_server_time_zone_offset_updated_t         evt_time_server_time_zone_offset_updated;
    sl_btmesh_evt_time_server_tai_utc_delta_updated_t            evt_time_server_tai_utc_delta_updated;
    sl_btmesh_evt_time_server_time_role_updated_t                evt_time_server_time_role_updated;
    sl_btmesh_evt_time_client_time_status_t                      evt_time_client_time_status;
    sl_btmesh_evt_time_client_time_zone_status_t                 evt_time_client_time_zone_status;
    sl_btmesh_evt_time_client_tai_utc_delta_status_t             evt_time_client_tai_utc_delta_status;
    sl_btmesh_evt_time_client_time_role_status_t                 evt_time_client_time_role_status;
    uint8_t payload[SL_BGAPI_MAX_PAYLOAD_SIZE];
  } data;
});

#ifdef __cplusplus
}
#endif

#endif